[{"breed":"afghan-hound","details":" Afghan Hound  History  DNA studies have shown that the Afghan hound is one of the oldest breeds still in existence.\nAfghan hounds originated in Afghanistan, where they were used by nomadic tribes to chase down hare and gazelle over rocky mountainous terrain. They are extremely agile and excellent jumpers, as well as being extremely fleet.\nThe first Afghan hounds came to England in the early 1900s. At the time they were called Barukhzy hounds.\nA particularly striking dog named Zardin was used as the model for the standard of perfection.\nThe breed became known as one of the most glamorous of dogs, and was often seen with celebrities.\nIn the 1970s, the Afghan became very popular as a status dog.\nThe breed's popularity has since fallen so that it is now unusual to see one outside of the show ring.  Afghan Hound Behavior Concerns  Makes a loyal, gentle, but independent companion.\nCan be clownish and playful, but its independent nature may make play frustrating for children. It is not a retriever at heart, but does like to chase and run.\nIt is inclined to run off and is not very good at coming when called.\nIt loves to hunt and chase small animals outdoors. It is good with indoor pets, including cats, however.\nA one family dog, tending to be aloof toward strangers.\nAdequate watchdog but poor protection dog.\nLearns quickly, but is easily bored.\nDoes best with reward-based training involving food or games.  Afghan Hound Suggested Exercises  Makes a quiet housedog as long as its exercise needs are met.\nRequires a long walk or jog, or a run in an enclosed area, every day.\nMost Afghans should not be let off leash unless the area is securely fenced.\nA few games and tricks provide needed mental exercise.\nIts long coat provides good protection against cold weather.  Afghan Hound Grooming  Coat is long and soft. Some coats (called \"cotton coats\") tend to mat more than others. \nThe coat needs brushing and combing every two to three days---daily when the puppy coat is being shed.\nWeekly bathing will reduce tangling.\nNeutered and spayed dogs tend to lose the breed's characteristic saddle, the area of short hair along the backline.\nShedding is below average.  Suggested Afghan Hound Nutritional Needs  Afghans are naturally very thin. Their conformation is such that even in good weight their hip bones are prominent. Feel under the coat to make sure they are not too thin. You should be able to feel the ribs, but they should not be too noticeable.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":11,"lifespan_upper_yr":13,"height_lower_in":24,"height_upper_in":28,"weight_lower_lb":50,"weight_upper_lb":60,"jogging_partner":4,"lap_dog":2,"good_with_children":2,"warm_weather":3,"cold_weather":3,"grooming_requirements":4,"shedding":2,"barking":2,"ease_of_training":2,"created_ts":"2024-02-27 20:20:01","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"akita","details":" Akita  History  The Akita is the largest of seven native Japanese dog breeds. The modern akita is actually a recreation of that breed, restored using a combination of many breeds.\nThe original akitas were used for big game hunting and for guarding. They were also used for dog fighting beginning in the 1600s, with crosses made to improve that ability. At that time they were called odate inu, or odate dog.\nIn the late 1800s they began to be interbred with some foreign dogs that were brought into Japan. This influx of other genes threatened the breed's identity, as it lost many of its spitz characteristics.\nIn the early 1900s a zoologist realized that the breed was in danger of being lost, and he worked to preserve it as a natural monument.\nIn 1932, Hachiko gained fame for the breed as the faithful dog that waited for his master at the train station every day for the rest of his life, unaware that the man had died at work.\nIn 1937, Helen Keller brought further fame to the breed when she selected one as her companion and brought it to America. It was the first akita in America.\nDuring World War II, most akitas were killed for fur or because of lack of food, or they were interbred with German shepherds, which were the only dogs allowed. After the war, only about 20 akitas were left in Japan. Most others were part German shepherd.\nThe breed grew slowly, with fanciers making great strides to restore it to its earlier nature.\nThe AKC recognized the akita in 1972.  Akita Behavior Concerns  Makes a loyal and protective companion.\nPlayful with children, but may mistake the play of visiting children as threats to family children. As with any large breed, dogs and children should be supervised.\nTrue to its spitz heritage, it is independent, bold and adventurous.\nA one family dog, tending to be aloof toward strangers. Early socialization so that it willingly accepts new people is important.\nOften aggressive toward other dogs and pets.\nObedience training is a requirement for this breed.\nLearns quickly, but can be stubborn.\nDoes best with reward-based training involving food or games, and an owner who can be a strong leader. Does best with reward-based training involving food or games, and an owner who can be a strong leader.  Akita Suggested Exercises  Makes a trustworthy and alert housedog as long as its exercise needs are met.\nRequires a long walk or jog every day.\nMost akitas do not do well in dog parks.\nGames and tricks provide needed mental exercise.\nIts thick coat provides good protection against cold weather but may make it prone to overheating.  Akita Grooming  Coat is made up of a soft thick undercoat covered by a straight, harsh outer coat that stands off from the body.\nThe coat needs weekly brushing weekly-more when shedding heavily.\nShedding is above average.  Suggested Akita Nutritional Needs  Akitas tend to stay in good weight. The thick coat can obscure weight problems, so be sure to use your hands to feel.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nPuppies should be fed a large-breed growth food, which slows their growing rate but not final size. This may decrease the incidence or severity of hip dysplasia in adults. ","lifespan_lower_yr":10,"lifespan_upper_yr":12,"height_lower_in":23,"height_upper_in":28,"weight_lower_lb":65,"weight_upper_lb":115,"jogging_partner":3,"lap_dog":1,"good_with_children":2,"warm_weather":1,"cold_weather":5,"grooming_requirements":2,"shedding":4,"barking":2,"ease_of_training":3,"created_ts":"2024-02-27 20:20:02","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"alaskan-malamute","details":" Alaskan Malamute  History  The Alaskan Malamute was first described living amongst the Mahlemut people on Alaska's northwest coast.\nThe dogs served as hunting partners for seals and polar bears, among other big game, and as sled dogs for hauling heavy loads.\nThe dogs were an integral part of these people's survival, and were valued both as workers and tribal members.\nIn 1896, the discovery of gold sparked the gold rush, and with it an influx of outsiders who immediately realized the value of good sled dogs both as workers and entertainment. They staged weight pulling contests and races among their dogs. They crossed the native Alaskan breeds with each other and with dogs they brought in, to the point that the true Malamute was in danger of being lost through interbreeding.\nIn the 1920s, a New England dog racing enthusiast gathered up the best Malamute representatives he could find and began to promote the traditional Malamute.\nMalamutes were chosen to assist Admiral Byrd on his trek to the South Pole in 1933.\nThe AKC recognized the breed in 1935.\nIn World War II Malamutes were used to haul supplies and even act as search and rescue dogs. \nMalamutes are still valued as the exemplary breed for moving heavy loads in snow. They are strong, rather than swift, sled dogs.  Alaskan Malamute Behavior Concerns  Makes a loyal and bold companion.\nIt loves to run, pull, and roam, and must be confined in a secure yard.\nIt is sociable toward people, but can be aggressive toward strange dogs or animals.\nStrong willed and independent, so that it needs training with a firm hand from a young age.\nDoes best with reward-based training involving food or games. \nIt tends to dig and howl.  Alaskan Malamute Suggested Exercises  Makes a fairly quiet housedog as long as its high exercise needs are met.\nRequires a very long walk or jog, or a long run in an enclosed area, every day.\nParticularly enjoys pulling sleds or heavy loads.\nMost Malamutes should not be let off leash unless the area is securely fenced.\nGames and tricks provide needed mental exercise.\nIn cold weather it may prefer to stay outside. In warm weather it is usually happier inside.\nIts thick coat provides good protection against cold weather.  Alaskan Malamute Grooming  Coat is made up of a soft thick undercoat covered by a straight, harsh outer coat that stands off from the body.\nThe coat needs weekly brushing---more when shedding\nShedding is above average.  Suggested Alaskan Malamute Nutritional Needs  Malamutes tend to stay in good weight. The thick coat can obscure weight problems, so be sure to use your hands to feel.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nPuppies should be fed a large-breed growth food, which slows their growing rate but not final size. This may decrease the incidence or severity of hip dysplasia in adults. ","lifespan_lower_yr":10,"lifespan_upper_yr":12,"height_lower_in":23,"height_upper_in":25,"weight_lower_lb":75,"weight_upper_lb":85,"jogging_partner":4,"lap_dog":1,"good_with_children":2,"warm_weather":1,"cold_weather":5,"grooming_requirements":3,"shedding":5,"barking":2,"ease_of_training":1,"created_ts":"2024-02-27 20:20:03","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"american-cocker-spaniel","details":" American Cocker Spaniel  History  Spaniels were developed at least by the 1300s to flush birds into nets or to waiting falcons.\nLater, they were also used to find and point birds and were specialized by their size, terrain, and type of bird.\nThe Cocker Spaniel, which was used for woodcock, was first mentioned in 1790.\nCocker Spaniels were in America by the late 1800s.\nThe AKC recognized the Cocker Spaniel in 1878.\nThe Cocker Spaniel was the most popular breed in America from 1936 to 1952.\nAs the Cocker became known as a show dog, winning Cockers tended to be smaller, longer legged, and rounder headed than the original stock from England.\nIn 1946, the AKC split the breed into English Cocker Spaniels and Cocker Spaniels. Only in America are these names used; elsewhere they are known as Cocker Spaniels and American Cocker Spaniels, respectively.\nCockers were such a part of Americana that Cocker celebrities included Spot (of Dick and Jane \"See Spot Run\" fame), Cover Boy Butch (25 times a Saturday Evening Post cover model), Lady (Lady and the Tramp), and the Coppertone Cocker.\nCocker Spaniels were once again the top breed in America from 1983 to 1990.\nThe breed is divided into three varieties according to color: Black (solid black or black and tan); ASCOB (which stands for Any Solid Color Other than Black, and includes cream, red, brown, and brown and tan); and Particolor (spotted or roan).  American Cocker Spaniel Behavior Concerns  Makes an exuberant and entertaining companion.\nUsually very good with children.\nA happy dog, not easily bothered by things.\nEager to please and quick to learn, but can be so excitable that it has difficulty minding.\nDoes best with reward-based training involving food.\nOutgoing toward strangers.\nGets along well with other pets and dogs.\nEnjoys retrieving.\nUsually enjoys swimming.\nSome bark a lot.\nSome are overly submissive. Submissive urination is not uncommon.  American Cocker Spaniel Suggested Exercises  Makes a fairly calm housedog if given adequate exercise.\nRequires daily exercise in the form of a long walk, jog, or energetic games.\nA good candidate for dog parks.\nObedience training is essential not only for control, but for the mental exercise it provides.  American Cocker Spaniel Grooming  Coat is fairly long, silky, and either flat or wavy. \nThe coat needs brushing and combing two to three times a week to prevent mats. \nProfessional grooming and clipping is required once a month.\nSpecial attention should be paid to keeping the eyes clean and clear of stray hairs.\nThe ears must be checked weekly for problems.\nShedding is average.  Suggested American Cocker Spaniel Nutritional Needs  Cockers have a tendency to become overweight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nPuppies should be fed a balanced a puppy food. ","lifespan_lower_yr":12,"lifespan_upper_yr":15,"height_lower_in":14,"height_upper_in":16,"weight_lower_lb":24,"weight_upper_lb":28,"jogging_partner":3,"lap_dog":2,"good_with_children":4,"warm_weather":3,"cold_weather":3,"grooming_requirements":5,"shedding":3,"barking":3,"ease_of_training":4,"created_ts":"2024-02-27 20:20:04","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"american-eskimo","details":" American Eskimo  History  American Eskimo dogs descend from the ancient spitz family of dogs. In fact, this breed is the one many people think of when they think of a spitz. Typical of the spitz family, they have many features to combat cold weather, including a thick coat, small ears, and a bushy tail to warm the nose when curled up sleeping.\nThey probably were developed from spitz-type dogs in Germany, with input from other spitz breeds such as the Pomeranian, Volpino Italiano, and Keeshond. In fact, it was the exclusion of white Keeshonden and oversize Pomeranians in the early 1900s that produced a population of dogs that probably played a large role in establishing the American Eskimo dog.\nThese dogs were general farm dogs and watchdogs, and they often accompanied their owners to America.\nThe United Kennel Club recognized the breed in 1913 as the American spitz.\nIn the 1920s, the breed gained fame as a circus dog, and many circuses sold puppies on the side. Old pedigrees included information on what tricks each ancestor could do.\nAfter World War I, the breed's name was changed to the less Germanic-sounding American Eskimo.\nThe AKC did not recognize the breed in part because most people did not keep acceptable records attesting to their pure breeding. Once this was overcome, the AKC recognized them as the American Eskimo dog in 1994.  American Eskimo Behavior Concerns  Makes an amiable and energetic companion; an excellent watchdog.\nPlayful and generally good with children.\nTrue to its spitz heritage, it is independent, bold and adventurous.\nA one family dog, tending to be aloof toward strangers. Early socialization so that it willingly accepts new people is important.\nSome can be unfriendly toward other dogs and pets.\nLearns quickly, but can be stubborn.\nDoes best with reward-based training involving food or games.\nSome tend to bark a lot, which should be discouraged from an early age.  American Eskimo Suggested Exercises  Makes a lively and alert housedog.\nLarger Eskies require a good walk or run every day.\nAlthough many of the physical exercise needs of the toy variety can be met with indoor games, it still needs the mental stimulation of walking and sniffing outdoors.\nMost Eskies do well in dog parks.\nGames and tricks provide needed mental exercise.\nIts thick coat provides good protection against cold weather but may make it prone to overheating.  American Eskimo Grooming  Coat is made up of a soft thick undercoat covered by a longer harsh outer coat.\nBrushing and combing twice weekly-more when shedding heavily-is necessary to prevent matting.\nThe hair around the anus should be checked regularly for hygiene issues.\nShedding is above average.  Suggested American Eskimo Nutritional Needs  Eskies tend to stay in good weight or to be slightly overweight. The thick coat can obscure weight problems, so be sure to use your hands to feel.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nToy Eskie puppies should be fed often to prevent hypoglycemia, a serious condition to which very small puppies are prone. Meals of high protein, fat, and complex carbohydrates may also help guard against this condition. This should not be a concern in larger varieties. ","lifespan_lower_yr":12,"lifespan_upper_yr":16,"height_lower_in":0,"height_upper_in":0,"weight_lower_lb":0,"weight_upper_lb":0,"jogging_partner":3,"lap_dog":3,"good_with_children":4,"warm_weather":1,"cold_weather":4,"grooming_requirements":3,"shedding":5,"barking":4,"ease_of_training":3,"created_ts":"2024-02-27 20:20:05","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"american-staffordshire-terrier","details":" American Staffordshire Terrier  History  In ancient times, Romans developed several breeds for the purpose of gladiator sports. Later, a descendent of these dogs, the bullenbeisser, was valued by butchers for its ability to control unruly cattle by catching and gripping bulls on their way to market. Butchers began to hold contests to see who had the best bull dogs, and the contests evolved into cruel bull baiting events that often lasted for hours.\nThe practice of bull baiting and other blood sports was outlawed in England around 1835. Owners of dogs instead staged clandestine events inside, where they couldn't be caught, and pitted one dog against another. Dog fighting favored a smaller, more agile dog, and the bull dogs were crossed with terriers to create the bull and terrier for that purpose.\nThe dogs gradually became to be known as pit bulldogs, then pit bulls.\nPit bulls came to America by the mid-1800s, where they were used for fighting as well as all-purpose farm dogs.\nAKC would not register pit bulls because they felt to do so would be to endorse dog fighting.\nThe United Kennel Club was formed in 1898 to register pit bulls, which it continues to register now as American pit bull terriers. The UKC now registers many breeds.\nThe American Dog Breeder's Association was formed in 1909 to register only pit bulls.\nIn 1936, the AKC accepted pit bulls under the name Staffordshire terrier (changed to American Staffordshire terrier in 1972).\nIn the early 1900s, pit bulls became a symbol of American spirit. A pit bull named Stubby was a national war hero, and Petey of Our Gang was very popular.\nIn the 1980s pit bulls became popular as tough dogs, with people encouraging crosses to more aggressive breeds to create pit bull mixes for guarding and fighting. Pit bulls were associated with many dog attacks, some fatal, and have since then been the target of breed specific legislation.\nMost pit bulls continue to live as peaceful family members. They are the most popular breed registered by the UKC, and overall, one of the most popular breeds in America.  American Staffordshire Terrier Behavior Concerns  Makes a loyal and fun-loving companion.\nPlayful and generally good with children, but may be overly protective of them. As with any large dog, they should be supervised when around children.\nFairly friendly toward strangers. Early socialization is essential.\nNot friendly towards strange dogs, and may not be good with small pets.\nThe pit bull learns quickly, but can be stubborn. It tends to rebel against forceful methods.\nDoes best with a firm owner who can combine reward-based training with good control and leadership.\nTraining is essential to combat the negative image the public tends to have of the breed.  American Staffordshire Terrier Suggested Exercises  Makes a calm and alert housedog as long as it receives regular exercise.\nRequires daily exercise in the form of a long walk, short jog, or energetic games.\nIt is not a good candidate for dog parks because if it does become involved in a fight---which can break out at any gathering of dogs---it tends not to lose.\nThe pit bull enjoys cold weather outings but its short coat is not suited to living outside.\nObedience training is essential not only for control, but for the mental exercise it provides.\nWeight pulling is a favorite sport.  American Staffordshire Terrier Grooming  Coat is short, close and glossy.\nThe coat needs only occasional brushing, once every week or so, to remove dead hair.\nShedding is average.  Suggested American Staffordshire Terrier Nutritional Needs  Pit bulls tend to stay in good weight or tend to be slightly overweight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nPuppies should be fed a large-breed growth food, which slows their growing rate but not final size. This may decrease the incidence or severity of hip dysplasia in adults. ","lifespan_lower_yr":12,"lifespan_upper_yr":14,"height_lower_in":17,"height_upper_in":19,"weight_lower_lb":57,"weight_upper_lb":57,"jogging_partner":3,"lap_dog":1,"good_with_children":2,"warm_weather":3,"cold_weather":3,"grooming_requirements":1,"shedding":3,"barking":2,"ease_of_training":4,"created_ts":"2024-02-27 20:20:06","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"australian-shepherd","details":" Australian Shepherd  History  The Australian shepherd originated in the United States, not Australia, although it comes by way of Australia.\nIn the 1800s, the Basque people of Europe settled in Australia, bringing their sheep and sheepdogs with them. Sheepdogs needed to be tougher in Australia than they did in most parts of Europe. Through unknown crosses the Basque developed a hardy, tough sheep herding dog that they then took with them when some resettled in America.\nThe western parts of America placed many of the same demands on sheep and dogs as did the rugged lands of Australia, and the Basque sheepdogs excelled in this new land. It was in America that they evolved into the breed we know as the Australian shepherd.\nAustralian shepherds were equally adept at working with cattle as with sheep, which made them especially valuable in America.\nExcept for ranchers, few people were aware of the breed until the 1950s, when a group of Australian shepherds appeared in a rodeo trick-dog act. The act was featured in a movie, and the secret was out.\nIn the late 1950s, Australian shepherds began to be registered with the National Stock Dog Registry and later, the Australian Shepherd Club of America. Working Aussies are still primarily registered with these organizations rather than with the AKC.\nThe AKC recognized the Australian shepherd in 1993.  Australian Shepherd Behavior Concerns  Makes an enthusiastic and protective companion.\nPlayful and very good with children\nSomewhat reserved with strangers\nGood with other dogs and pets.\nDoes best with reward-based training involving games, food or praise.\nLearns quickly, but can become easily bored. Australian shepherds enjoy learning new things.\nCan become frustrated and destructive without adequate mental stimulation.\nAussies from working lines tend to be more energetic and need more things to do.\nAussies are extremely good at the sports of herding, obedience, agility, disk catching, and flyball.  Australian Shepherd Suggested Exercises  Makes an alert and well-mannered housedog, given adequate exercise.\nThis is an extremely active and playful dog that enjoys having a job to do. It needs a long walk, good run or energetic play session every day.\nDoes well in dog parks.\nGames and tricks provide needed mental exercise.\nHerding, agility, flyball and disk catching can provide both mental and physical exercise.\nAustralian Shepherds enjoy cold weather, but cannot live outside in it.  Australian Shepherd Grooming  Coat is of medium length and texture, straight to wavy.\nRequires brushing once or twice weekly.\nShedding is average.  Suggested Australian Shepherd Nutritional Needs  Australian Shepherds tend to stay in good weight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":12,"lifespan_upper_yr":15,"height_lower_in":18,"height_upper_in":23,"weight_lower_lb":40,"weight_upper_lb":65,"jogging_partner":5,"lap_dog":1,"good_with_children":4,"warm_weather":3,"cold_weather":3,"grooming_requirements":3,"shedding":3,"barking":2,"ease_of_training":5,"created_ts":"2024-02-27 20:20:07","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"basset-hound","details":" Basset Hound  History  The word Basset comes from the French \"bas,\" which means low thing or dwarf.\nBasset dogs were mentioned in the 1500s, but it's not known if these were the same dogs we know as basset hounds. That's because it's not known when the name began to refer to a breed, rather than to any dwarf dog. This makes tracing the basset hound's history difficult.\nShort-legged dogs were often used to hunt rabbits in situations where the hunter needed to follow on foot, such as through thick cover or if a horse was not available.\nAfter the French Revolution in the late 1700s, many commoners took up hunting. They needed a dog with a good nose and a slow pace because they often did not have a horse to ride. Not only could the hunter follow on foot, but it was easier to shoot game that wasn't fleeing at top speed.\nFour different versions of short-legged hounds emerged, with the basset artesien Normand the most like the basset hound.\nCrosses with bloodhounds were made in the late 1800s to increase size.\nThe first bassets came to England and America in the late 1800s. The AKC recognized the breed in 1911.\nIn 1928, a basset bound appeared on the cover of Time magazine, bringing the breed to the people's notice.\nThe breed's most well-known example is the Hush Puppy dog. Basset hounds have also been prominently featured in several cartoons such as Fred Basset and Droopy Dog.  Basset Hound Behavior Concerns  Makes an easygoing and amiable companion.\nGood with children, but its independent nature and low energy level may be frustrating for children at times.\nFriendly to indifferent toward strangers.\nGood with other dogs and pets.\nLikes to follow its nose, tends to wander, and does not come when called.\nLikes to hunt.\nOften barks and bays loudly.\nTends to be stubborn and methodical. Does best with reward-based training involving food.  Basset Hound Suggested Exercises  Makes a calm and reliable housedog.\nAlthough many of its physical exercise needs can be met with backyard games, it prefers to walk and sniff and explore.\nCare must be taken if allowed off leash because the basset hound tends to get caught up in following scent trails, and it's not overly obedient when it comes to returning.\nBassets tend to do well at dog parks.\nDoes best in moderate climates.  Basset Hound Grooming  Coat is short, thick and tight.\nBrushing once a week will remove dead hair.\nShedding is average.\nThe mouth and wrinkles should be examined, cleaned and dried regularly.  Suggested Basset Hound Nutritional Needs  Bassets have a tendency to become obese.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nPuppies should be fed a large-breed growth food, which slows their growing rate but not final size. This may decrease the incidence or severity of hip dysplasia in adults. ","lifespan_lower_yr":12,"lifespan_upper_yr":15,"height_lower_in":14,"height_upper_in":14,"weight_lower_lb":40,"weight_upper_lb":60,"jogging_partner":1,"lap_dog":1,"good_with_children":2,"warm_weather":3,"cold_weather":3,"grooming_requirements":2,"shedding":3,"barking":4,"ease_of_training":1,"created_ts":"2024-02-27 20:20:08","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"beagle","details":" Beagle  History  The Beagle originated in the Middle Ages, probably the result of crosses between the Harrier and other hounds. Its smaller size made it possible to follow it on foot as it trailed hare.\nThe first use of the word Beagle is found in 1475. The origin of the word is uncertain, but it may be derived the old French \"be'geule\", meaning \"gape throat\" in reference to the baying voice of the hounds. Alternatively, it may refer to the diminutive size of the hound, possibly deriving from the Old English \"begele,\" or the French \"beigh\" or the Celtic \"beag,\" all of which mean small.\nBeagles existed in several sizes, including the then popular pocket-sized Beagles that measured only about 9\" tall at the withers. The smaller Beagles could be followed by less athletic sporting enthusiasts.\nThe first mention of the Beagle in America was in 1642, but the modern Beagle did not emerge in America until the late 1800s, when more Beagles from England arrived.\nBeagles became popular hunting companions and field trial competitors, but these jobs were eclipsed by their popularity as family dogs.\nMore recently, they have gained recognition as contraband, termite and mold detection dogs. They also have a long history of use as research subjects.\nThe most famous Beagle of all is an animated one, Snoopy, of Peanuts fame.\nThe Beagle has been among the ten most popular breeds in America for decades.  Beagle Behavior Concerns  Makes both an exuberant playmate and adventurous companion.\nExcellent and playful with children, but its independent nature may be frustrating for children at times.\nGregarious toward strangers.\nVery good with other dogs and pets.\nLikes to follow its nose, tends to wander, and does not come when called.\nLikes to hunt.\nSome bark and bay loudly and frequently.\nLearns quickly, but is easily distracted. Does best with reward-based training involving food.  Beagle Suggested Exercises  Makes a fairly calm housedog if given adequate exercise.\nEnjoys jogging, but not running marathons.\nAlthough many of its physical exercise needs can be met with backyard games, it prefers to walk and sniff and explore.\nCare must be taken if allowed off leash because the Beagle tends to get caught up in following scent trails, and it's not overly obedient when it comes to returning.\nBeagles tend to do well at dog parks.\nBeagles do best in moderate climates.  Beagle Grooming  Coat is short, close and hard.\nBrushing once a week will remove dead hair.\nShedding is average.  Suggested Beagle Nutritional Needs  Beagles love to eat anything and have a tendency to become obese.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":12,"lifespan_upper_yr":15,"height_lower_in":13,"height_upper_in":15,"weight_lower_lb":18,"weight_upper_lb":30,"jogging_partner":3,"lap_dog":1,"good_with_children":3,"warm_weather":3,"cold_weather":3,"grooming_requirements":1,"shedding":3,"barking":4,"ease_of_training":1,"created_ts":"2024-02-27 20:20:09","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"bernese-mountain-dog","details":" Bernese Mountain Dog  History  The Bernese mountain dog is one of the family of Swiss mountain dogs, or Sennehunde.\nThe breed's origin is undocumented, but it may have descended from Roman mastiff-type dogs that were crossed with native Swiss flock-guarding dogs after the Roman invasion of Switzerland.\nThe cross produced a strong, cold-resistant dog that could work as a draft dog, guardian, drover and general farm dog.\nBecause no concerted effort was made to continue them as a breed, few remained by the late 1800s. These were found in the valleys of the lower Alps.\nProfessor Albert Heim promoted the dogs throughout Switzerland and encouraged their revival. The breed was dubbed the Bernese mountain dog.\nThe first Bernese came to America in 1926.\nThe AKC recognized the breed in 1937.  Bernese Mountain Dog Behavior Concerns  Makes a devoted and easygoing companion.\nGentle and good with children, but may not be playful enough for them. As with all large dogs, dogs and children should always be supervised.\nTends to be somewhat aloof toward strangers.\nFairly friendly toward strange dogs.\nGood with other pets.\nLearns quickly.\nSomewhat sensitive.\nDoes best with reward-based training using food rewards.  Bernese Mountain Dog Suggested Exercises  Makes a calm and well-mannered housedog.\nRequires daily exercise in the form of a moderate walk or short jog.\nThe Bernese mountain dog enjoys cold weather, but doesn't do well in warm weather.\nObedience training is essential not only for control, but for the mental exercise it provides.  Bernese Mountain Dog Grooming  Coat is moderately long, either slightly wavy or straight.\nThe coat needs only occasional brushing, once or twice every week, more often when shedding.\nShedding is above average.  Suggested Bernese Mountain Dog Nutritional Needs  Bernese mountain dogs tend to stay in good weight or be slightly overweight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nPuppies should be fed a large-breed growth food, which slows their growing rate but not final size. This may decrease the incidence or severity of hip dysplasia in adults. ","lifespan_lower_yr":6,"lifespan_upper_yr":9,"height_lower_in":23,"height_upper_in":28,"weight_lower_lb":70,"weight_upper_lb":120,"jogging_partner":1,"lap_dog":1,"good_with_children":3,"warm_weather":1,"cold_weather":5,"grooming_requirements":3,"shedding":4,"barking":1,"ease_of_training":4,"created_ts":"2024-02-27 20:20:10","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"bichon-frise","details":" Bichon Frise  History  The bichon is a descendent of the barbichon family of dogs, which in turn descends from the barbet, a large water dog.\nBichons were divided into four types: Maltaise, Bolognese, Havanese and Tenerife.\nThe Tenerife, developed on the Canary Island of Tenerife, was brought to Italy in the 14th century. They quickly became favored pets of the upper class.\nAfter a series of French invasions of Italy in the 1500s, the dogs were brought back to France where they once again became favored pets of the aristocracy.\nFor some unknown reason, the breed fell out of favor with the upper class. It survived as a street dog, performing tricks with organ grinders to entertain passersby for money.\nWorld War I nearly brought about the demise of the breed, but a few people tried to save it.\nIn 1933, a breed standard was drawn up and it became an official breed, the bichon frise.\nBichons came to America in the 1950s, and received AKC recognition in 1971.  Bichon Frise Behavior Concerns  Makes an affectionate and exuberant companion.\nPlayful, gentle and very good with children.\nVery friendly to strangers, other dogs and other pets.\nDoes best with reward-based training involving food or games.\nEager to please, bright and responsive.\nSome tend to bark a lot, which should be discouraged from an early age.\nSome can be difficult to housetrain.  Bichon Frise Suggested Exercises  Makes a lively and alert housedog.\nA walk around the block once or twice daily, plus a vigorous game, will meet its exercise needs, not counting bathroom breaks.\nMany bichons have been trained to use indoor potty systems.\nDog parks can work out well as long as bichons are not expected to mingle with much larger dogs.\nGames and tricks provide needed mental exercise.\nIts thick coat provides some protection against cold weather, but its fairly small body size nonetheless makes it vulnerable to the cold.  Bichon Frise Grooming  Coat is curly, coarse and dense.\nBrushing and combing every other day is necessary to prevent matting.\nMost people have their dogs professionally clipped every month.\nShedding is below average.\nNo breed is actually non-allergenic, but bichons may cause fewer allergies compared to most other breeds.  Suggested Bichon Frise Nutritional Needs  Bichons tend to stay in good weight. The thick coat can sometimes obscure weight problems, so be sure to use your hands to feel.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":12,"lifespan_upper_yr":15,"height_lower_in":10,"height_upper_in":12,"weight_lower_lb":10,"weight_upper_lb":16,"jogging_partner":2,"lap_dog":4,"good_with_children":5,"warm_weather":3,"cold_weather":3,"grooming_requirements":5,"shedding":1,"barking":4,"ease_of_training":4,"created_ts":"2024-02-27 20:20:12","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"bloodhound","details":" Bloodhound  History  The bloodhound is probably a direct descendent of the St. Hubert's hound, which was in Europe by the 700s.\nIn 1066, William the Conqueror is credited with bringing them to England.\nThese were some of the earliest pure-breeding strains of dogs, kept by Church dignitaries in carefully bred packs.\nThe name bloodhound comes from \"blooded hound,\" in reference to their pure blood.\nBy the 1800s, bloodhounds were in America.\nBloodhounds, along with other scenthounds, were sometimes used to trail escaped slaves. They continue to be used to trail humans. They do not attack people when they find them, as is sometimes alleged.\nThe AKC recognized the bloodhound in 1885.\nBloodhounds hold tracking records for length and staleness of trail.  Bloodhound Behavior Concerns  Makes a placid and amiable companion.\nGood with children, but its independent nature and low energy level may be frustrating for children at times.\nGenerally friendly toward strangers.\nGood with other dogs and pets.\nLikes to follow its nose, tends to wander, and does not come when called.\nLikes to hunt.\nOften barks and bays loudly when excited or on a trail.\nTends to be stubborn and methodical. Does best with reward-based training involving food.  Bloodhound Suggested Exercises  Makes a calm and reliable housedog.\nIts physical exercise needs can be met with a long walk or short run. It prefers to walk and sniff and explore.\nCare must be taken if allowed off leash because the bloodhound tends to get caught up in following scent trails, and it's not overly obedient or inclined to come when called.\nBloodhounds tend to do well at dog parks.\nThey do not like hot weather.  Bloodhound Grooming  Coat is short, thick and tight.\nBrushing once a week will remove dead hair.\nShedding is average.\nThe mouth and wrinkles should be examined, cleaned and dried regularly.\nBe prepared for drool.  Suggested Bloodhound Nutritional Needs  Bloodhounds have a tendency to become overweight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nPuppies should be fed a large-breed growth food, which slows their growing rate but not final size. This may decrease the incidence or severity of hip dysplasia in adults. ","lifespan_lower_yr":7,"lifespan_upper_yr":10,"height_lower_in":23,"height_upper_in":27,"weight_lower_lb":80,"weight_upper_lb":110,"jogging_partner":2,"lap_dog":1,"good_with_children":2,"warm_weather":2,"cold_weather":3,"grooming_requirements":3,"shedding":3,"barking":4,"ease_of_training":1,"created_ts":"2024-02-27 20:20:13","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"border-collie","details":" Border Collie  History  The border collie originated in Britain around the English and Scottish border during the 1800s.\nA defining event was the advent of the first competitive sheepdog trial in 1873, in which a dog named Hemp made such a good showing that he became sought after for stud. Hemp is considered to be the father of the border collie.\nHemp and his progeny herded not by nipping and barking, as was commonplace, but by staring and stalking (known as \"giving eye\"). This intimidated the sheep into moving.\nEarly border collies were selected only for working ability, and in fact, the first breed standard, drawn up in 1906, addressed only ability, not appearance.\nIn 1915 the dogs, formerly referred to as sheepdogs, were named border collies.\nMany border collie enthusiasts fought against recognition by the AKC, but the AKC recognized the border collie in 1995. The majority of border collies, especially working ones, are not registered with the AKC.  Border Collie Behavior Concerns  Makes an endlessly enthusiastic and energetic companion.\nPlayful and very good with children\nSomewhat reserved with strangers\nGood with other dogs and pets.\nDoes best with reward-based training involving games, food or praise.\nLearns quickly, but can become easily bored. Border collies enjoy learning new things.\nA border collie without a job to do or without mental stimulation can become frustrated and destructive. This is not a breed for a lazy person.\nBorder collies from working lines tend to be more active than those from companion or show lines.\nSome may bark a lot.\nThe border collie is a leading competitor in the sports of obedience, agility and herding.  Border Collie Suggested Exercises  Makes an alert housedog.\nThis is an extremely active and playful dog that enjoys having a job to do. It needs a long run or exercise period every day, plus some short play sessions.\nDoes well in dog parks.\nGames and tricks provide needed mental exercise.\nHerding is a favored activity.\nAgility, flyball and disk catching are also activities that exercise the mind and body, and that border collies enjoy.\nBorder collies tolerate cold weather, but cannot live outside in it.  Border Collie Grooming  Coat can be either smooth, where it is short all over the body; or rough, where it is medium to long in length; and flat to slightly wavy.\nCoat requires brushing once or twice weekly, depending on length.\nShedding is average.  Suggested Border Collie Nutritional Needs  Border collies tend to stay in good weight, or even be somewhat lean.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":10,"lifespan_upper_yr":14,"height_lower_in":0,"height_upper_in":0,"weight_lower_lb":0,"weight_upper_lb":0,"jogging_partner":5,"lap_dog":1,"good_with_children":4,"warm_weather":3,"cold_weather":3,"grooming_requirements":3,"shedding":3,"barking":3,"ease_of_training":5,"created_ts":"2024-02-27 20:20:14","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"boston-terrier","details":" Boston Terrier  History  The Boston Terrier originated, not surprisingly, in Boston, Massachusetts.\nThe coachmen of wealthy Bostonians interbred their employers' dogs to create dogs for themselves. Around 1865, a cross between an English Terrier and a Bulldog produced a dog named Hooper's Judge. Judge weighed in at 30 pounds, but in subsequent generations smaller dogs arose as his descendents were bred to smaller females, and probably to French Bulldogs as well.\nBy 1889, the breed was established to the extent that fanciers formed the American Bull Terrier Club. A new name had to be found, however, because a breed called the Bull Terrier already existed, and its fanciers complained. After several name suggestions, including \"Roundheads,\" the name Boston Terrier was agreed upon.\nThe AKC recognized the Boston Terrier in 1893. This may be the shortest period between the creation of an entirely new breed and AKC recognition.\nAt first, color and markings were immaterial, but by the early 1900s, the breed's distinctive coat pattern became essential.\nBetween 1905 and 1935, the Boston Terrier was consistently the first or second most popular breed in America.  Boston Terrier Behavior Concerns  Makes a devoted and lively companion.\nPlayful and affectionate.\nVery good with children.\nSomewhat reserved toward strangers.\nUsually good with strange dogs, although may initially challenge them.\nGood with other pets.\nClever, but can be stubborn. It tends to rebel against forceful methods.\nDoes best with reward-based training with good control and leadership.\nSome bark a lot.  Boston Terrier Suggested Exercises  Makes a calm and alert housedog.\nRequires daily exercise in the form of a walk, short jog, or energetic games.\nBall-chasing is a favored game.\nObedience provides needed mental exercise.\nDoes not tolerate cold well because of its small size and short coat.\nDoes not tolerate heat well because of its flat face.  Boston Terrier Grooming  Coat is short, flat and fine.\nThe coat needs only weekly brushing to remove dead hair.\nShedding is average.  Suggested Boston Terrier Nutritional Needs  Boston Terriers tend to stay in good weight or tend to be slightly overweight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":10,"lifespan_upper_yr":14,"height_lower_in":15,"height_upper_in":17,"weight_lower_lb":10,"weight_upper_lb":25,"jogging_partner":1,"lap_dog":4,"good_with_children":4,"warm_weather":1,"cold_weather":1,"grooming_requirements":1,"shedding":3,"barking":3,"ease_of_training":3,"created_ts":"2024-02-27 20:20:15","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"boxer","details":" Boxer  History  The Boxer descends from two types of German Bullenbeisers, or bull-biters.\nThe Bullenbeisers were originally used to chase large game, such as boar, deer, and bear, through the forests, grabbing and hanging on until the hunter could arrive to dispatch it.\nIn the early 1800s, German hunters tried to improve their hunting dogs by crossing their Bullenbeisers with mastiff-type dogs and with Bulldogs. The result was a strong, agile dog with strong jaws and a recessed nose to enable it to breathe while hanging on.\nBy the late 1800s, these dogs were popular as butcher's dogs, controlling cattle in slaughter yards.\nThe slaughter yard dogs were called Boxl, which may have been the origin of the name, Boxer. The Boxer was established by 1895.\nThe Boxer was one of the first breeds used as a police and military dog.\nIn 1904, the AKC recognized the Boxer.\nThe breed remained relatively obscure in America until the 1940s, when it began its slow but steady rise. It eventually peaked at number 4, and remains in the top 10.  Boxer Behavior Concerns  Makes a loyal and protective companion.\nPlayful and gentle with children.\nFairly outgoing toward strangers.\nGenerally good with other dogs, but some can be aggressive toward strange dogs.\nGenerally good with other pets.\nLearns quickly, but can be both sensitive and stubborn.\nDoes best with a firm owner who can combine reward-based training with good control and leadership.  Boxer Suggested Exercises  Makes a calm and alert housedog, but can be restless unless it receives adequate exercise.\nRequires daily exercise in the form of a long walk, jog or energetic games.\nThe Boxer's short muzzle makes it intolerant of heat.\nThe Boxer's short coat makes it intolerant of very cold weather.\nObedience training is essential not only for control, but for the mental exercise it provides.\nBoxers compete in obedience and agility successfully.  Boxer Grooming  Coat is short and shiny.\nIt needs only occasional brushing, once every week or so, to remove dead hair.\nShedding is average.  Suggested Boxer Nutritional Needs  Boxers tend to stay in good weight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nPuppies should be fed a large-breed growth food, which slows their growing rate but not final size. This may decrease the incidence or severity of hip dysplasia in adults. ","lifespan_lower_yr":8,"lifespan_upper_yr":10,"height_lower_in":21,"height_upper_in":25,"weight_lower_lb":50,"weight_upper_lb":85,"jogging_partner":4,"lap_dog":1,"good_with_children":4,"warm_weather":1,"cold_weather":2,"grooming_requirements":1,"shedding":3,"barking":2,"ease_of_training":3,"created_ts":"2024-02-27 20:20:17","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"brittany","details":" Brittany  History  In the mid 1800s, French sportsmen in the Bretagne region of France crossed spaniels with setters from England. These setters probably were related to, but not the same as, today's English Setters.\nThe resulting dogs were excellent woodcock dogs, both pointing and retrieving. Not only were they popular with the gentry, but poachers liked them because they were obedient and versatile.\nMany of these dogs were tailless or stub-tailed.\nThe Brittany came to North America around 1925. Initially, sportsmen had a hard time accepting them because of their short tails, but their field trial abilities soon put an end to any problems of acceptance. The dogs were so good at field trials that they became the most popular pointing dog at competitive events.\nThe AKC recognized them as the Brittany spaniel in 1934.\nIn 1982, the name was changed to simply Brittany, because the dog's hunting style is more setter-like than spaniel-like. It is a pointing dog, not a flushing dog.  Brittany Behavior Concerns  Makes an energetic and adventurous companion.\nVery good with children.\nEager to please and quick to learn, overall a biddable dog.\nSomewhat independent.\nDoes best with reward-based training involving food.\nVery outgoing toward strangers.\nGets along well with other pets and dogs.\nEnjoys retrieving and swimming.  Brittany Suggested Exercises  Makes a fairly calm housedog if given adequate exercise.\nRequires daily exercise in the form of a long walk, jog or energetic games.\nThis is not a breed for lazy people.\nHunting and retrieving are favored activities.\nA good candidate for dog parks.\nObedience training is essential not only for control, but for the mental exercise it provides.  Brittany Grooming  Coat is of medium length, either flat or wavy.\nThe coat needs brushing and combing one or two times a week.\nShedding is average.  Suggested Brittany Nutritional Needs  Brittanys tend to stay in good weight or to be slightly overweight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nPuppies should be fed a balanced a puppy food. ","lifespan_lower_yr":12,"lifespan_upper_yr":13,"height_lower_in":18,"height_upper_in":21,"weight_lower_lb":30,"weight_upper_lb":40,"jogging_partner":5,"lap_dog":2,"good_with_children":5,"warm_weather":3,"cold_weather":3,"grooming_requirements":3,"shedding":3,"barking":2,"ease_of_training":4,"created_ts":"2024-02-27 20:20:17","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"bull-terrier","details":" Bull Terrier  History  Gladiator sports were considered prime entertainment for centuries in many parts of the world. Several of those blood sports, including bull and bear baiting, involved dogs. When these blood sports were outlawed in England in 1835, dog fighting became more popular to fill the void.\nCompared to bull and bear baiting dogs, dogs bred for fighting needed to be smaller and more agile. This was achieved by crossing the bull baiting dogs with terriers to create the bull and terrier breed.\nWhen dog fighting was in turn outlawed, many patrons of the bull and terrier breed decided to clean up the dog's image. They bred for amiable personality and stylish good looks, and even began to compete in dogs shows successfully.\nAround 1860, James Hinks crossed the bull and terrier with the White English terrier and the Dalmatian, producing an all-white strain he called the bull terrier. These dogs became sought after as stylish companions for young gentlemen.\nThe bull terrier was nicknamed the \"white cavalier\" because of its chivalrous and brave nature.\nAround 1900, color was re-introduced into the breed by crossing them with Staffordshire bull terriers. In 1936 the breed was split into two varieties, the white and the colored bull terrier.\nFamous bull terriers include Spuds McKenzie and the Target dog.\nBull terriers have sometimes been included in breed specific legislation because of confusion with pit bulls.  Bull Terrier Behavior Concerns  Makes a loyal and fun-loving companion.\nExuberantly comical and often mischievous.\nPlayful and good with children.\nFairly friendly toward strangers.\nNot very friendly towards strange dogs.\nUsually good with other pets.\nThe bull terrier learns quickly, but can be stubborn. It tends to rebel against forceful methods.\nDoes best with a firm owner who can combine reward-based training with good control and leadership.\nCan sometimes exhibit compulsive behavior.  Bull Terrier Suggested Exercises  Makes a calm and alert housedog as long as it receives regular exercise.\nRequires daily exercise in the form of a long walk, short jog or energetic games.\nThe bull terrier enjoys cold weather outings but its short coat is not suited to living outside.\nObedience training is essential not only for control, but for the mental exercise it provides.  Bull Terrier Grooming  Coat is short, flat and harsh.\nThe coat needs only occasional brushing, once every week or so, to remove dead hair.\nShedding is average.  Suggested Bull Terrier Nutritional Needs  Bull terriers tend to stay in good weight or tend to be slightly overweight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":11,"lifespan_upper_yr":14,"height_lower_in":21,"height_upper_in":22,"weight_lower_lb":50,"weight_upper_lb":70,"jogging_partner":3,"lap_dog":1,"good_with_children":3,"warm_weather":3,"cold_weather":3,"grooming_requirements":1,"shedding":3,"barking":2,"ease_of_training":1,"created_ts":"2024-02-27 20:20:19","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"bulldog","details":" Bulldog  History  The Bulldog originated in England with the practice of bull baiting, in which a dog was set upon a bull to torment it before it was killed. This was done as entertainment and to make the bull's meat more tender. The ordeal might last for hours, during which the dog was expected to grab the bull, often by its muzzle, and hang on. Having jaws that protruded beyond the dog's muzzle helped it breathe while hanging there.\nBull baiting and other blood sports were outlawed in England around 1835. Efforts to use the Bulldog in dog fighting were unsuccessful, although when mixed with terriers, its descendents were good fighters. The Bulldog itself, however, was without a job.\nSome admirers set out to redefine the breed as a stylish companion, breeding with temperament as a priority. They also bred for accentuated features, so that today's Bulldog doesn't look much like the original.\nA breed club was formed in 1875 in England.\nThe AKC recognized the Bulldog in 1886.\nThe Bulldog is a national symbol of England as well as a popular team mascot.  Bulldog Behavior Concerns  Makes a loyal and fun-loving companion.\nPlayful and good with children.\nFriendly toward strangers.\nNot friendly toward strange dogs, but friendly toward other pets.\nWilling to please, but can be stubborn. May rebel against forceful methods.\nDoes best with reward-based training along with good control and leadership.  Bulldog Suggested Exercises  Makes a calm and trustworthy housedog.\nRequires daily exercise in the form of a leisurely walk or some backyard games.\nExtremely prone to overheating because of its flat face. Indoor games are preferable in warm weather.\nIts short coat does not protect it against the cold.\nObedience and trick training provide essential mental stimulation.\nMost Bulldogs cannot swim.  Bulldog Grooming  Coat is fine and glossy.\nThe coat needs only occasional brushing, once every week or so, to remove dead hair.\nShedding is average.\nFacial wrinkles, as well as any wrinkles around the tail, should be examined, cleaned and dried daily.  Suggested Bulldog Nutritional Needs  Has a tendency to be slightly overweight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nPuppies should be fed a large-breed growth food, which slows their growing rate but not final size. This may decrease the incidence or severity of hip dysplasia in adults. ","lifespan_lower_yr":8,"lifespan_upper_yr":12,"height_lower_in":12,"height_upper_in":15,"weight_lower_lb":40,"weight_upper_lb":50,"jogging_partner":1,"lap_dog":1,"good_with_children":4,"warm_weather":1,"cold_weather":1,"grooming_requirements":2,"shedding":3,"barking":1,"ease_of_training":2,"created_ts":"2024-02-27 20:20:20","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"bullmastiff","details":" Bullmastiff  History  Occasional references to crosses between mastiff-type dogs and bull-baiting dogs can be found as early as the late 1700s, but no evidence exists that these crosses were perpetuated.\nThe documented history of the bullmastiff traces to the late 1800s. Gamekeepers for large estates in England needed a courageous dog to catch and subdue poachers on their land. The dog was to creep up silently and subdue, but not maul, the trespasser. The cross between a mastiff and bulldog provided a dog that combined the speed and strength to do the job.\nThe breed was so adept at its work that it was dubbed the \"gamekeeper's night dog.\"\nDark brindle was preferred because it blended into the darkness at night.\nLighter fawns later became popular with estate owners who wanted a flashy looking guardian reminiscent of a mastiff.\nBreeders eventually aimed for a pure breeding strain that had the appearance of being 60 percent mastiff and 40 percent bulldog.\nThe Kennel Club in England recognized the breed in 1924; the AKC recognized it in 1933.  Bullmastiff Behavior Concerns  Makes a loyal and protective companion.\nGentle and generally good with children, but may be overly protective of them when around strangers. As with all large dogs, dogs and children should always be supervised.\nDevoted.\nNot easily roused, but fearless when the situation calls for it.\nTends to be suspicious of strangers. Early socialization is essential.\nNot very friendly toward strange dogs.\nGood with other pets.\nTends to be stubborn. Rebels against forceful methods.\nDoes best with a firm owner who can combine reward-based training with good control and leadership.  Bullmastiff Suggested Exercises  Makes a calm and well-mannered housedog.\nRequires daily exercise in the form of a moderate walk or short jog.\nThe bullmastiff prefers cold weather to warm.\nObedience training is essential not only for control, but for the mental exercise it provides.  Bullmastiff Grooming  Coat is short, straight, and coarse.\nThe coat needs only occasional brushing, once every week or so, to remove dead hair.\nDeep facial wrinkles may need cleaning and drying.\nShedding is average.\nBe prepared for drool.  Suggested Bullmastiff Nutritional Needs  Bullmastiffs tend to stay in good weight or be slightly overweight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nPuppies should be fed a large-breed growth food, which slows their growing rate but not final size. This may decrease the incidence or severity of hip dysplasia in adults. ","lifespan_lower_yr":8,"lifespan_upper_yr":10,"height_lower_in":24,"height_upper_in":27,"weight_lower_lb":100,"weight_upper_lb":130,"jogging_partner":1,"lap_dog":1,"good_with_children":2,"warm_weather":2,"cold_weather":3,"grooming_requirements":2,"shedding":3,"barking":1,"ease_of_training":1,"created_ts":"2024-02-27 20:20:21","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"cairn-terrier","details":" Cairn Terrier  History  The Cairn terrier is one of the oldest terriers, probably existing since the 1400s.\nThey were used on the Scottish Isle of Skye to hunt fox, badger and otter. Their name comes from their prowess at bolting otter from cairns, which were piles of stone that served as landmarks or memorials.\nAt one time all the terriers from that region were considered the same breed, so that when they began to be shown in dog shows in the 1870s, the Cairn and several others were grouped together as Scotch terriers.\nIn 1881 the Scotch terriers were divided into Dandie Dinmont and Skye terriers, with Cairns in the Skye terrier group. By the end of that year the Skye terrier group was subdivided into Skye and hard-haired terriers, with Cairns in the latter. Eventually the Hard-haired Terriers were again divided into three breeds, which would be come the Scottish, West Highland white and Cairn terriers.\nAround 1912 the breed became known as the Cairn terrier.\nThe AKC recognized the breed in 1913.\nThe most well-known Cairn was Toto, the dog in the Wizard of Oz movie.  Cairn Terrier Behavior Concerns  Makes a spirited and fun-loving companion.\nPlayful and good with children.\nBold, clever, curious, and often mischievous.\nOutgoing toward strangers.\nMost get along well with other dogs, but some can be scrappy.\nMay chase other household pets, but can learn to get along with cats. Rodents are a poor choice of housemate, however.\nIndependent and stubborn. Does best with reward-based training involving food or games.\nLearns quickly and is eager to please, but also bores quickly, and may come up with its own ideas.\nSome tend to bark a lot, which should be discouraged from an early age.\nMany like to dig.  Cairn Terrier Suggested Exercises  Makes a lively and alert housedog.\nIts exercise needs can be met with a long walk or short run, along with a vigorous game. They also need a chance to sniff and explore in a safe place or on leash.\nThey tend to go off hunting and may not come when called.\nCairns tend to enjoy and do well at dog parks, although care must be taken not to allow them to bully other dogs.\nGames and tricks provide needed mental exercise.  Cairn Terrier Grooming  Coat is profuse, harsh and straight.\nThe coat needs combing once or twice weekly.\nShaping of the coat by plucking out dead hairs every six months is required to keep it tidy looking.\nShedding is below average.  Suggested Cairn Terrier Nutritional Needs  Cairns tend to stay in good weight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":12,"lifespan_upper_yr":14,"height_lower_in":10,"height_upper_in":10,"weight_lower_lb":13,"weight_upper_lb":14,"jogging_partner":2,"lap_dog":2,"good_with_children":4,"warm_weather":3,"cold_weather":3,"grooming_requirements":3,"shedding":2,"barking":4,"ease_of_training":1,"created_ts":"2024-02-27 20:20:22","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"cavalier-king-charles","details":" Cavalier King Charles  History  The Cavalier's ancestors were spaniels that were developed at least by the 1300s to flush birds into nets or to waiting falcons.\nSome smaller spaniels were probably bred with Oriental toy dogs such as the Japanese chin to create a lapdog version of the spaniel.\nThese dogs were known as comforter spaniels and were used to serve as lap and foot warmers, surrogate hot water bottles, and for companionship.\nIn the 1700s, King Charles II became an ardent fan of the little dogs, to the point that he was accused of ignoring matters of state in favor of his dogs. The dogs were dubbed King Charles spaniels in recognition of his association.\nAfter King Charles' death, the Duke of Marlboro became an advocate of the breed. The red and white color, which he favored, is called Blenheim after his estate.\nThe King Charles spaniel remained a favorite with the upper class, but the look of the breed gradually changed until by the early 1900s, they had pushed in faces.\nIn 1926, a wealthy American traveled to England in search of the old type dogs with a longer nose. Unable to find any, he offered a large cash prize to the best old type pointy-nosed dogs at the next year's shows. The challenge set breeders to reviving the old type, which then became known as the Cavalier King Charles spaniel.\nAfter World War II, only a handful of Cavaliers remained. Six dogs became the foundation of the modern breed.\nThe Kennel Club in England recognized the Cavalier in 1945. But only when a Cavalier won Best in Show at the prestigious Crufts dog show did the breed capture the public's attention.\nCavaliers came to America in the 1940s. Fanciers disagreed, however, over whether they wanted AKC recognition.\nThe AKC recognized the Cavalier in 1996 amidst great controversy. To this day, there are two separate national Cavalier clubs, one AKC affiliated and one not.\nIn the past decade, Cavaliers have had a 735 per cent increase in AKC registrations, more than any other breed.  Cavalier King Charles Behavior Concerns  Makes a loving and entertaining companion.\nExtremely good with children.\nVery affectionate.\nMakes a good lapdog as well as fun playmate.\nA happy dog, not easily bothered by things.\nEager to please and quick to learn.\nDoes best with reward-based training involving food.\nOutgoing toward strangers.\nGets along well with other pets and dogs.\nEnjoys retrieving.\nUsually enjoys swimming.  Cavalier King Charles Suggested Exercises  Makes a calm housedog.\nRequires daily exercise in the form of a long walk or energetic games.\nA good candidate for dog parks, but should be kept separate from larger dogs.\nObedience training provides mental exercise.  Cavalier King Charles Grooming  Coat is moderately long, silky, and either flat or slightly wavy.\nThe coat needs brushing and combing two to three times a week to prevent matts.\nThe ears must be checked regularly for problems.\nShedding is average.  Suggested Cavalier King Charles Nutritional Needs  Cavaliers have a tendency to become overweight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nPuppies should be fed a balanced a puppy food. ","lifespan_lower_yr":9,"lifespan_upper_yr":14,"height_lower_in":12,"height_upper_in":13,"weight_lower_lb":13,"weight_upper_lb":18,"jogging_partner":2,"lap_dog":4,"good_with_children":5,"warm_weather":3,"cold_weather":2,"grooming_requirements":3,"shedding":3,"barking":2,"ease_of_training":4,"created_ts":"2024-02-27 20:20:22","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"chesapeake-bay-retriever","details":" Chesapeake Bay Retriever  History  In 1807, an English ship foundered off the coast of Maryland. Its crew and cargo were rescued, and in gratitude, the crew gave their rescuers two puppies that were presumably Newfoundlands of the time. These dogs grew to be talented water retrievers, and as such, their offspring were sought after.\nMany types of dogs were bred with them, and eventually a distinct type of dog emerged. They were a hardy retriever that could mark the fall of many ducks or geese and swim repeatedly through chilled rough water to retrieve all of them.\nBy the mid to late 1800s, the breed had developed a reputation for its retrieving skills. It was called by several names, including the Chesapeake Bay duck dog, Newfoundland duck dog, and brown Winchester.\nThe AKC recognized the breed in 1878.\nIn the 1930s, the Chessie was the most popular retriever in America.\nIn 1964, the Chesapeake Bay retriever became he official dog of Maryland.  Chesapeake Bay Retriever Behavior Concerns  Makes an adventurous and loyal companion.\nPlayful and generally good with children.\nEager to please, but can be oblivious to corrections.\nMore independent than other retrievers.\nMore protective than other retrievers.\nAloof toward strangers.\nGets along fairly well with other pets and dogs.\nLoves to retrieve, to the point of seeming compulsive.\nLoves to swim.\nQuick to learn, but can be stubborn.\nDoes best with reward-based training involving food or retrieving.  Chesapeake Bay Retriever Suggested Exercises  Can be a calm housedog if given adequate exercise.\nNeeds daily walks, jogs, hikes or play sessions.\nSwimming and retrieving are favored methods of exercise.\nAlso needs mental exercise in the form of training or games.\nChessies enjoy hunting, and many owners compete in field events with them.  Chesapeake Bay Retriever Grooming  Coat is made up of a dense wooly undercoat with a harsh, wavy and oily outer coat.\nThe oiliness makes the coat waterproof. Bathing removes the oil, so is not recommended before cold weather hunting that may require swimming.\nBrushing once a week is adequate; more during shedding seasons.\nShedding is average.  Suggested Chesapeake Bay Retriever Nutritional Needs  Chessies have a tendency to become overweight.\nAdult dogs should be fed a balanced diet that does not allow them to become overweight.\nPuppies should be fed a large-breed growth food, which slows their growing rate but not final size. This may decrease the incidence or severity of hip dysplasia in adults. ","lifespan_lower_yr":10,"lifespan_upper_yr":13,"height_lower_in":21,"height_upper_in":26,"weight_lower_lb":55,"weight_upper_lb":80,"jogging_partner":3,"lap_dog":1,"good_with_children":3,"warm_weather":3,"cold_weather":4,"grooming_requirements":2,"shedding":3,"barking":2,"ease_of_training":4,"created_ts":"2024-02-27 20:20:24","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"chihuahua-long","details":" Chihuahua Long  History  The Chihuahua very likely descends from a combination of an ancient Central and South American dog called the Techichi, and Chinese dogs brought to Central America by the Spanish Conquistadors in the 1600s.\nEvidence exists of tiny dogs in Central America at the time of the Conquistadors. Following that time, there is a 300 year gap before the next recorded mention of them, when three tiny dogs were discovered in Chihuahua, Mexico in 1850.\nOrigin of the two coat varieties is controversial, with some reports that the earliest discovered Chihuahuas were actually long coats. In fact, the Techichi may have had a moderately long coat.\nOther theories contend that the long coated variety came from crosses to the Papillon, Maltese, or Yorkshire Terrier once the breed came to the attention of American fanciers.\nThe AKC recognized the breed in 1904. The first registered Chihuahua was a smooth coat, and the smooth coat has remained the more well-known variety.\nThe Chihuahua is considered to be one breed with two varieties, which means that they compete in separate classes at dog shows but can be interbred with one another.\nThe long coat results when a dog has two recessive genes for long hair. Smooth Chihuahuas may have either one or two dominant genes for short hair.\nBy 1964, the Chihuahua had become the third most popular breed in America, but still, most of them were smooth coats.\nThe Chihuahua has consistently remained one of America's top breeds since then, currently ranking 11th in AKC popularity. The long coat seems to be increasing in popularity slightly, although no statistics are kept on this.  Chihuahua Long Behavior Concerns  Makes both a devoted lap dog and saucy playmate.\nFairly playful with family children, but children must be supervised because they could easily hurt such a small dog.\nTends to be a one-person, or at most, one-family dog.\nReserved toward strangers.\nEarly socialization so that it willingly accepts new people is important.\nGood with other dogs and pets, but can foolishly challenge larger strange dogs.\nSome can be overly bold, while others can be overly timid.\nLearns quickly, but tends to have a stubborn streak.\nDoes not do well with force-based training methods, but is very good with reward-based training involving food.\nHousetraining can be more challenging than with many other breeds.  Chihuahua Long Suggested Exercises  Makes a lively and alert housedog.\nAlthough many of its physical exercise needs can be met with indoor games, it still needs the mental stimulation of walking and sniffing outdoors.\nA walk around the block once or twice daily will meet its outdoor needs, not counting bathroom breaks.\nMany Chihuahuas can be trained to use indoor potty systems.\nDog parks are not generally a good idea unless only small dogs are allowed together.\nGames and tricks provide needed mental exercise.\nExcursions in a doggy purse can provide supplemental entertainment.\nChihuahuas can swim, but most aren't crazy about it. They can, however, use a kiddy pool as a swimming pool.\nChihuahuas, even long coated Chihuahuas, hate the cold. Because of their small size, they lose body heat rapidly. The coat has little undercoat, so it does not store heat well.  Chihuahua Long Grooming  Coat is soft and either straight or wavy, with fringed ears.\nBrushing two to three times a week will prevent tangles and mats.\nShedding is average.\nThe breed is prone to periodontal problems, which can be prevented in large part by regular tooth brushing.  Suggested Chihuahua Long Nutritional Needs  Chihuahuas have a tendency to become obese, which may go unnoticed under the long coat.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nRemember, it does not take much food to feed such a small dog, and small snacks can easily add too many calories.\nChihuahua puppies should be fed often to prevent hypoglycemia, a serious condition to which very small puppies are prone. Frequent small meals of high protein, fat, and complex carbohydrates may help guard against this condition. ","lifespan_lower_yr":14,"lifespan_upper_yr":18,"height_lower_in":6,"height_upper_in":9,"weight_lower_lb":6,"weight_upper_lb":6,"jogging_partner":0,"lap_dog":3,"good_with_children":2,"warm_weather":4,"cold_weather":1,"grooming_requirements":2,"shedding":3,"barking":3,"ease_of_training":2,"created_ts":"2024-02-27 20:20:25","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"chihuahua-smooth-coat","details":" Chihuahua Smooth Coat  History  The early origin of the Chihuahua is controversial. One theory holds that it originated in Central and South America, descending from a small dog, the Techichi, which was used as a religious sacrifice and even food. The other theory holds it descends from small Chinese dogs brought to Central America by Spanish traders.\nThe recorded history of the Chihuahua begins in 1850, when three tiny dogs were brought to the United States from Chihuahua, Mexico.\nMore dogs followed. They were called by many names, including Arizona Dogs, Texas Dogs, Mexican Dogs, or even Chihuahua terriers, but the simple name Chihuahua stuck.\nIn the late 1800s, a troupe of trick Chihuahuas made the rounds with performer Rosalina Casselli.\nThe AKC recognized the breed in 1904. The first registered Chihuahua was a smooth coat named Midget.\nThe dogs aroused only moderate interest until Xavier Cugat, the rumba king, made his smooth Chihuahuas his constant companions in public appearances, movies, and later, his weekly television show.\nBy 1964, the Chihuahua had become the third most popular breed in America.\nThe Chihuahua has consistently remained one of America's top breeds since then, currently ranking 11th in AKC popularity.  Chihuahua Smooth Coat Behavior Concerns  Makes both a devoted lap dog and saucy playmate.\nFairly playful with family children, but children must be supervised because they could easily hurt such a small dog.\nTends to be a one-person, or at most, one-family dog.\nReserved toward strangers. Early socialization so that it willingly accepts new people is important.\nGood with other dogs and pets, but can foolishly challenge larger strange dogs.\nSome can be overly bold, while others can be overly timid.\nLearns quickly, but tends to have a stubborn streak.\nDoes not do well with force-based training methods, but is very good with reward-based training involving food.\nHousetraining can be more challenging than with many other breeds.  Chihuahua Smooth Coat Suggested Exercises  Makes a lively and alert housedog.\nAlthough many of its physical exercise needs can be met with indoor games, it still needs the mental stimulation of walking and sniffing outdoors.\nA walk around the block once or twice daily will meet its outdoor needs, not counting bathroom breaks. Many Chihuahuas can be trained to use indoor potty systems.\nDog parks are not generally a good idea unless only small dogs are allowed together.\nGames and tricks provide needed mental exercise.\nExcursions in a doggy purse can provide supplemental entertainment.\nChihuahuas can swim, but most aren't crazy about it. They can, however, use a kiddy pool as a swimming pool.\nChihuahuas hate the cold. Because of their small size, they lose body heat rapidly.  Chihuahua Smooth Coat Grooming  Coat is short, soft, and glossy.\nBrushing once a week will remove dead hair.\nShedding is average.\nThe breed is prone to periodontal problems, which can be prevented in large part by regular tooth brushing.  Suggested Chihuahua Smooth Coat Nutritional Needs  Chihuahuas have a tendency to become obese.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nRemember, it does not take much food to feed such a small dog, and small snacks can easily add too many calories.\nChihuahua puppies should be fed often to prevent hypoglycemia, a serious condition to which very small puppies are prone. Frequent small meals of high protein, fat, and complex carbohydrates may help guard against this condition. ","lifespan_lower_yr":14,"lifespan_upper_yr":18,"height_lower_in":6,"height_upper_in":9,"weight_lower_lb":6,"weight_upper_lb":6,"jogging_partner":0,"lap_dog":3,"good_with_children":2,"warm_weather":4,"cold_weather":1,"grooming_requirements":1,"shedding":3,"barking":3,"ease_of_training":2,"created_ts":"2024-02-27 20:20:26","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"chinese-shar-pei","details":" Chinese Shar-Pei  History  Recent DNA studies indicate that the shar-pei is among the 14 most ancient breeds recognized by the AKC.\nBecause it and the chow chow share a country of origin, are both ancient breeds and both have blue or black tongues, the two breeds probably share a similar origin.\nSome records indicate it was present in the southern provinces of China by 200 B.C., and even stronger evidence indicates that it was known by the 1200s.\nMuch of the history of the breed has been lost. However, by the early 1900s the dogs were used by farmers as guard dogs, wild boar hunters, and for dog fighting.\nIn 1968, the Hong Kong Kennel Club recognized them as a breed.\nIn 1973, an article appearing in the American press named the shar-pei as the world's rarest dog. This sparked a flood of interest as western fanciers began efforts to save the breed.\nThe AKC recognized the Chinese shar-pei in 1991.\nIt is one of the most recognizable breeds in the world because of its abundant loose skin.  Chinese Shar-Pei Behavior Concerns  Makes a devoted and protective family member.\nGenerally tolerant of children, but may not be playful enough for them.\nNot overly demonstrative.\nReserved toward, and even wary of, strangers.\nNot friendly towards strange dogs.\nUsually good with small family pets, but may chase livestock and other animals.\nTends to be independent and stubborn. Rebels against forceful methods.\nDoes best with a firm owner who can combine reward-based training with good control and leadership.  Chinese Shar-Pei Suggested Exercises  Makes a calm and alert housedog.\nRequires daily exercise in the form of a leisurely walk, short jog, or quick game. It is not physically suited to overly vigorous exercise.\nEnjoys cold weather.\nBecomes overheated fairly easily.\nObedience training is essential not only for control, but for the mental exercise it provides.  Chinese Shar-Pei Grooming  The shar-pei comes in two acceptable two coat types (horse and brush), and an additional coat type (bear) that is not acceptable. The horse coat is made up of short bristly hair, while the brush coat is slightly longer and softer. Both types should be harsh and stand off the skin. The bear coat is longer still.\nThe wrinkles the breed is known for are most apparent in puppyhood. Some adult dogs continue to have loose skin all over their body into adulthood, whereas others retain it only on their head.\nThe coat needs brushing every week to remove dead hair.\nWrinkles should be examined regularly and if needed, cleaned, to prevent irritation.\nShedding is average.  Suggested Chinese Shar-Pei Nutritional Needs  Shar-peis tend to stay in good weight or to be slightly overweight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nPuppies should be fed a large-breed growth food, which slows their growing rate but not final size. This may decrease the incidence or severity of hip dysplasia in adults. ","lifespan_lower_yr":8,"lifespan_upper_yr":10,"height_lower_in":18,"height_upper_in":20,"weight_lower_lb":45,"weight_upper_lb":60,"jogging_partner":2,"lap_dog":1,"good_with_children":1,"warm_weather":2,"cold_weather":3,"grooming_requirements":3,"shedding":4,"barking":1,"ease_of_training":1,"created_ts":"2024-02-27 20:20:27","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"chow-chow","details":" Chow Chow  History  Recent DNA studies indicate that the chow chow is among the 14 most ancient breeds recognized by the AKC.\nIts origin is unclear except that it has been known in China for hundreds or even thousands of years.\nThey may have been used as hunting dogs for the Chinese nobility, and later kept in monasteries. Other accounts claim they were used for food in Mongolia and Manchuria.\nThe dogs were brought to England in the late 1700s, and were dubbed chow chows by the English. The name is probably derived from a term meaning Oriental knick knack.\nOnly in the late 1800s, with the sudden interest in exotic breeds aroused by the advent of dog shows, were chows earnestly brought to the western world.\nQueen Victoria was a proponent of the breed.\nThe AKC recognized the chow chow in 1903.\nIn the 1980s, the breed soared in popularity in America, peaking when it was the 6th most popular breed.\nSince then they have plummeted in popularity, their numbers falling by 91% in the last decade.\nThe black or blue tongue is a breed characteristic, as is the somewhat stilted gait.  Chow Chow Behavior Concerns  Makes a devoted and protective family member.\nGenerally tolerant of children, but may not be playful enough for them. As with any large dog, they should be supervised when around children.\nNot overly demonstrative.\nReserved toward, and even wary of, strangers.\nNot friendly towards strange dogs.\nUsually good with small pets.\nTends to be independent and stubborn. Rebels against forceful methods.\nDoes best with a firm owner who can combine reward-based training with good control and leadership.  Chow Chow Suggested Exercises  Makes a calm and alert housedog.\nRequires daily exercise in the form of a leisurely walk, short jog, or quick game. It is not physically suited to overly vigorous exercise.\nEnjoys cold weather.\nBecomes overheated easily.\nObedience training is essential not only for control, but for the mental exercise it provides.  Chow Chow Grooming  The chow chow comes in two coat types. The rough coat is straight and off-standing. The smooth coat is hard and smooth. Both coat types have wooly undercoats.\nThe rough coat needs brushing every other day to remove dead coat and prevent serious matting. The smooth coat needs brushing once or twice a week.\nShedding is above average.  Suggested Chow Chow Nutritional Needs  Cow chows tend to stay in good weight or to be slightly overweight. You must use your hands to feel beneath the thick coat.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nPuppies should be fed a large-breed growth food, which slows their growing rate but not final size. This may decrease the incidence or severity of hip dysplasia in adults. ","lifespan_lower_yr":8,"lifespan_upper_yr":12,"height_lower_in":17,"height_upper_in":20,"weight_lower_lb":45,"weight_upper_lb":70,"jogging_partner":1,"lap_dog":1,"good_with_children":1,"warm_weather":1,"cold_weather":5,"grooming_requirements":4,"shedding":5,"barking":2,"ease_of_training":1,"created_ts":"2024-02-27 20:20:28","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"cockapoo","details":" Cockapoo  History  In the 1940s, both Cocker spaniels and poodles were among the most popular breeds in America. It was inevitable that individuals from the two breeds mate. As the progeny from these litters proved themselves to be attractive and amiable companions, more people decided to purposefully mate Cocker spaniels and poodles. The first record of Cockapoos dates to the 1950s.\nBy the 1960s, Cockapoos had developed a following and many people went out of their way to add a Cockapoo to their family in preference to a purebred dog.\nMost Cockapoos are the result of breeding an American Cocker spaniel to a poodle. Those from English Cocker spaniels are called English Cockapoos.\nThe Poodle parent is usually a miniature or toy variety, seldom standard.\nThe Cockapoo Club of America was founded in 1998. Another club, the American Cockapoo Club, also registers Cockapoos. With the popularity of designer hybrid dogs in the 2000s, the Cockapoo has found a new group of admirers.\nThe Cockapoo does not meet the AKC's criteria for recognition because they are not a pure breed. However, they are more popular than many of AKC's rarer breeds.  Cockapoo Behavior Concerns  Makes an exuberant and entertaining companion.\nUsually very good with children.\nA happy dog, not easily bothered by things.\nEager to please and quick to learn, but can be overly excitable and easily distracted.\nDoes best with reward-based training involving food and games.\nOutgoing toward strangers.\nGets along well with other pets and dogs.\nEnjoys retrieving.\nUsually enjoys swimming.\nSome bark a lot.  Cockapoo Suggested Exercises  Makes a fairly calm housedog if given adequate exercise.\nRequires daily exercise in the form of a long walk, jog, or energetic games.\nA good candidate for dog parks.\nObedience training is essential not only for control, but for the mental exercise it provides.  Cockapoo Grooming  Coat is fairly long and wavy; silkier than a poodle's coat.\nThe coat needs brushing and combing two to three times a week to prevent mats.\nProfessional grooming and clipping is required about every six weeks.\nSpecial attention should be paid to keeping the eyes clean and clear of stray hairs.\nThe ears must be checked weekly for problems.\nShedding is below average.\nAlthough no breed is non-allergenic, the Cockapoo may cause fewer allergies in people compared to other breeds.  Suggested Cockapoo Nutritional Needs  Cockapoos have a tendency to become overweight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nPuppies should be fed a balanced a puppy food. ","lifespan_lower_yr":12,"lifespan_upper_yr":15,"height_lower_in":10,"height_upper_in":18,"weight_lower_lb":15,"weight_upper_lb":22,"jogging_partner":2,"lap_dog":3,"good_with_children":5,"warm_weather":3,"cold_weather":3,"grooming_requirements":5,"shedding":2,"barking":2,"ease_of_training":5,"created_ts":"2024-02-27 20:20:29","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"collie","details":" Collie  History  The collie originated in Scotland in the 1800s. Its rootstock is unknown but it may have been derived from the same ancestors as the border collie.\nAt that time both rough and smooth coated versions of the breed, first called Scotch collies, existed. The smooth coated dogs drove the sheep and the rough coated dogs stayed out with the flocks.\nQueen Victoria, a purebred dog enthusiast, became enamored of the collie and added her first to her kennel in 1860. Her involvement with the breed caught the interest of other dog fanciers and of upper society people who wanted the same breed as the Queen's favorite.\nIn 1886, an official breed standard was drawn up.\nCollies came to America both as working sheep dogs and elite pets.\nAuthor Albert Payson Terhune attracted more pet owners to the breed through his stories of his Sunnybank collies in the 1920s and 30s.\nLassie movies and television shows cemented the breed's reputation as a family dog.\nThe smooth collie has never shared the popularity of the rough collie.  Collie Behavior Concerns  Makes a gentle and devoted companion.\nPlayful and very good with children\nGood with other dogs and pets.\nDoes best with reward-based training involving games, food or praise.\nLearns quickly, and is eager to please.\nOverly enthusiastic barking can be a problem.  Collie Suggested Exercises  Makes a well-mannered housedog, given adequate exercise.\nIt needs a long walk, good run or energetic play session every day.\nDoes well in dog parks.\nGames and tricks provide needed mental exercise.\nCollies enjoy cold weather, but cannot live outside in it.  Collie Grooming  Coat of the rough variety is long, thick and harsh. It requires a good brushing session once or twice a week.\nCoat of the smooth variety is short, hard and flat. It requires a brief brushing once a week.\nShedding is average to above average.  Suggested Collie Nutritional Needs  Collies tend to stay in good weight.You must feel under the coat to make sure the dog is neither too thin nor too fat.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":8,"lifespan_upper_yr":12,"height_lower_in":22,"height_upper_in":26,"weight_lower_lb":50,"weight_upper_lb":75,"jogging_partner":3,"lap_dog":1,"good_with_children":5,"warm_weather":3,"cold_weather":3,"grooming_requirements":3,"shedding":3,"barking":4,"ease_of_training":5,"created_ts":"2024-02-27 20:20:30","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"dachshund","details":" Dachshund  History  Short-legged dogs have been known since ancient times, but the beginnings of the Dachshund aren't clear. The first recorded history of them was in the 1700s, in Germany, where they were used mostly for hunting badgers underground.\nBy the early 1800s smooth, wire, and longhaired Dachshunds were recorded.\nIn 1839, Prince Albert married Queen Victoria, bringing Dachshunds to England with him.\nIn 1870, the first recorded Dachshunds arrived in America.\nIn 1885, the AKC registered its first Dachshund, named Dash.\nWhen World War I broke out, Dachshunds became unpopular in America because of their association with Germany. In 1919, the AKC changed the breed's name to Badger Dog in an attempt to distance it from Germany. They changed it back in 1923.\nOnly 23 Dachshunds were registered in 1923. By 1930, they had moved up to become the 28th most popular breed, and by 1940, the 6th most popular. They have remained among the most popular breeds in America since.\nThe Dachshund comes in three varieties: smooth, long, and wire coats, of which the smooth is the most popular. The varieties are shown separately but may be interbred.\nThe breed also comes in standard and miniature sizes. In most countries they are also shown as separate varieties, but the AKC does not divide them by size.  Dachshund Behavior Concerns  Makes both a devoted lap dog and saucy playmate.\nFairly playful with family children, but children must be supervised because they could easily hurt a miniature Dachshund.\nTends to be a one-person, or at most, one-family dog.\nReserved, even suspicious, toward strangers.\nFairly good with other dogs and pets.\nTends to be independent, curious and bold, so care must be taken to prevent wandering and exploring.\nLikes to hunt and dig.\nSome bark a lot.\nLearns quickly, but tends to have a stubborn streak.\nDoes not do well with force-based training methods, but is very good with reward-based training involving food.  Dachshund Suggested Exercises  Makes a lively and alert housedog.\nAlthough many of its physical exercise needs can be met with indoor or backyard games, it still needs the mental stimulation of walking and sniffing on walks.\nA walk around the block once or twice daily will meet its outdoor needs, not counting bathroom breaks. Many Dachshunds can be trained to use indoor potty systems.\nDog parks are not generally a good idea unless only small dogs are allowed together.\nGames and tricks provide needed mental exercise.\nSmooth Dachshunds hate the cold. Because of their small size and short coat, they lose body heat rapidly.  Dachshund Grooming  Coat is short, soft, and glossy.\nBrushing once a week will remove dead hair.\nShedding is below average.  Suggested Dachshund Nutritional Needs  Dachshunds have a tendency to become obese.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nRemember, it does not take much food to feed a small dog, and small snacks can easily add too many calories. ","lifespan_lower_yr":12,"lifespan_upper_yr":14,"height_lower_in":5,"height_upper_in":9,"weight_lower_lb":11,"weight_upper_lb":32,"jogging_partner":1,"lap_dog":2,"good_with_children":2,"warm_weather":3,"cold_weather":1,"grooming_requirements":2,"shedding":2,"barking":3,"ease_of_training":2,"created_ts":"2024-02-27 20:20:31","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"dalmatian","details":" Dalmatian  History  Although named for Dalmatia, in western Yugoslavia, the Dalmatian probably did not originate there.\nThe breed's ancestry, place and time of origin, and original function are unknown.\nDistinctly spotted dogs have been depicted in art from ancient times, but it's not known if they were related to Dalmatians.\nEarly jobs probably included war dog, sentinel, draft dog, herding dog, ratter, retriever, bird dog, and trick dog. The breed found its niche as a coach dog in Victorian England. Coach dogs trotted alongside, in front of, or beneath the coach, protecting the horses from marauding dogs, and looking good in the process.\nIts role as a coach dog for horse-drawn fire engines led to its adoption as a firehouse dog.\nThe AKC recognized the Dalmatian in 1888.\nThe popular Disney movie, 101 Dalmatians, fueled a surge in popularity, followed by a subsequent plunge. When the movie's sequel came out, it included disclaimers asking viewers not to get a Dalmatian on impulse. The second movie caused a much smaller surge.\nDalmatians have experienced a 97 per cent drop in registrations over the past decade.  Dalmatian Behavior Concerns  Makes a playful and adventurous family member.\nGood and playful with children, although may be too energetic for small children.\nAffectionate and demonstrative.\nLoves to run, and may roam if the opportunity arises.\nOutgoing toward strangers.\nMay be aggressive toward strange dogs, but is good with family dogs.\nUsually good with household pets.\nDoes best with a firm owner who can combine reward-based training with good control and leadership.\nDeaf dogs can be trained with hand signals and vibrating collars.  Dalmatian Suggested Exercises  Makes a fairly calm and alert housedog if given adequate exercise. If not given enough exercise, can be overactive and destructive.\nRequires daily exercise in the form of a long walk, or preferably, long jog.\nA well-fenced yard is essential.\nGames can also help provide exercise.\nEnjoys cold weather, but its short coat doesn't protect it against prolonged exposure.\nObedience training is essential not only for control, but for the mental exercise it provides.  Dalmatian Grooming  Coat is short and glossy.\nIt requires brushing once a week to remove dead hair.\nShedding is average.\nDalmatians are born white; the dots come later.  Suggested Dalmatian Nutritional Needs  Dalmatians tend to stay in good weight or to be slightly overweight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nMany Dalmatians form urinary stones, most commonly urate stones. These stones may be managed in part by feeding certain prescription dog foods that are low in certain types of protein that yield purine. Liver and other organ meats are high in purine and should be avoided in these dogs. Eggs and vegetables are low in purine. A diet low in purines, moderate in high-quality protein, high in complex carbohydrates, and low in fat and salt is suggested for urate-forming Dalmatians. Your veterinarian is the best source of information for your Dalmatian's special dietary needs.\nHigh water intake may also help prevent stones ","lifespan_lower_yr":12,"lifespan_upper_yr":14,"height_lower_in":19,"height_upper_in":23,"weight_lower_lb":40,"weight_upper_lb":60,"jogging_partner":5,"lap_dog":1,"good_with_children":3,"warm_weather":3,"cold_weather":2,"grooming_requirements":1,"shedding":3,"barking":2,"ease_of_training":3,"created_ts":"2024-02-27 20:20:32","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"doberman-pinscher","details":" Doberman Pinscher  History  Louis Dobermann was a door-to-door tax collector in Germany who needed a good guard dog to accompany him on his rounds. In the late 1800s he set about to create the ideal dog for his needs, combining a shepherd-type dog with a German pinscher, with later crosses to the black and tan Manchester terrier, greyhound, and weimaraner.\nBy 1899 the breed had developed to the point that a breed club was formed.\nThe first Doberman pinscher arrived in America in 1908.\nDobermans gained favor as police, guard and military dogs, and their popularity grew following both World Wars.\nDobermans were the second most popular breed in America in 1977.\nIn some communities they have been the target of breed specific legislation.  Doberman Pinscher Behavior Concerns  Makes a loyal and protective companion, an excellent guardian and watchdog.\nPlayful and generally gentle with children.\nTends to be reserved with strangers.\nNot very friendly towards strange dogs, and may not be good with small pets.\nLearns quickly, and enjoys mental challenges.\nIt is actually quite sensitive, and does best with a firm but gentle owner who can combine reward-based training with good control and leadership.\nSome owners train their dogs in Schutzhund, a sport that combines obedience, tracking, and protection.\nDobermans are among the top obedience dogs in competition.  Doberman Pinscher Suggested Exercises  Makes a calm yet alert housedog given adequate exercise. Otherwise it can be overactive and destructive.\nRequires daily exercise in the form of a long walk, or preferably, long jog. Games and sprints can also help burn off energy.\nThe Doberman enjoys cool weather for exercising but cannot live outside in it because of its short coat.\nObedience training is essential not only for control, but for the mental exercise it provides.\nAgility training is an excellent way to challenge its mind and body.  Doberman Pinscher Grooming  Coat is short, smooth and hard.\nThe coat needs only occasional brushing, once every week or so, to remove dead hair.\nShedding is average.  Suggested Doberman Pinscher Nutritional Needs  Dobermans tend to stay in good weight or be slightly overweight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nPuppies should be fed a large-breed growth food, which slows their growing rate but not final size. This may decrease the incidence or severity of hip dysplasia in adults. ","lifespan_lower_yr":10,"lifespan_upper_yr":12,"height_lower_in":24,"height_upper_in":28,"weight_lower_lb":65,"weight_upper_lb":90,"jogging_partner":5,"lap_dog":1,"good_with_children":3,"warm_weather":3,"cold_weather":3,"grooming_requirements":1,"shedding":3,"barking":2,"ease_of_training":5,"created_ts":"2024-02-27 20:20:33","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"english-cocker-spaniel","details":" English Cocker Spaniel  History  One of the largest families of dogs, spaniels were developed at least by the 1300s to flush birds into nets or to waiting falcons. Later in their development they also found and pointed birds.\nSpaniels became specialized by their size, the terrain they hunted over, and the type of birds they hunted.\nIn 1892 the smaller land spaniels that specialized in hunting woodcock were designated as Cocker Spaniels.\nIn 1878, the AKC recognized the Cocker Spaniel.\nAs the Cocker became the most popular breed in America in the 1930s and 40s, and also a successful show dog, the type diverged such that the show dogs winning in American rings tended to be smaller, longer legged, and rounder headed than the original stock from England.\nIn 1936, the AKC split the breed into two varieties: the traditional English Cocker Spaniels and Cocker Spaniels. In 1946, they split them into two breeds (Varieties can be interbred; breeds cannot). Only in America are these names used; elsewhere they are known as Cocker Spaniels and American Cocker Spaniels, respectively.\nThe English Cocker Spaniel remains the breed more true to the type of the original Cockers, but in America they are not as popular as American Cockers.  English Cocker Spaniel Behavior Concerns  Makes a cheerful and devoted companion.\nUsually very good with children.\nEager to please and quick to learn.\nDoes best with reward-based training involving food.\nOutgoing toward strangers.\nGets along well with other pets and dogs.\nEnjoys retrieving and hunting.  English Cocker Spaniel Suggested Exercises  Makes a calm housedog if given adequate exercise.\nRequires daily exercise in the form of a long walk, jog, or energetic games.\nA good candidate for dog parks.\nObedience training is essential not only for control, but for the mental exercise it provides.  English Cocker Spaniel Grooming  Coat is fairly long, silky, and either flat or wavy.\nThe coat needs brushing and combing two to three times a week to prevent mats.\nHair on the head and ears should be clipped every month, and hair on the feet and tail should be cut every two months.\nSpecial attention should be paid to keeping the eyes clean and clear of stray hairs.\nThe ears must be checked weekly for problems.\nShedding is average.  Suggested English Cocker Spaniel Nutritional Needs  Adult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nPuppies should be fed a balanced a puppy food. ","lifespan_lower_yr":12,"lifespan_upper_yr":14,"height_lower_in":15,"height_upper_in":17,"weight_lower_lb":26,"weight_upper_lb":34,"jogging_partner":3,"lap_dog":2,"good_with_children":4,"warm_weather":3,"cold_weather":3,"grooming_requirements":5,"shedding":3,"barking":3,"ease_of_training":4,"created_ts":"2024-02-27 20:20:34","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"english-setter","details":" English Setter  History  Setters originated before the advent of hunting birds with game, when dogs that spotted birds were expected to crouch so that hunters could throw a net over the birds without it getting snagged on the dog.\nThe oldest known setter dates back to the 1300s from the English moors.\nAround 1825, Edward Lavarack undertook a 35-year program of concerted breeding to form the basis of today's English Setter. He began with two dogs named \"Ponto\" and \"Old Moll.\"\nPurcell Llewellin founded his dogs on Laverack's stock, crossed with some other dogs, but concentrated on field ability. One of Llewellin's dogs, \"Count Noble,\" became a field trial sensation in America. Count Noble's body was mounted after his death and put on display at the Carnegie Museum in Pittsburgh.\nToday, show English setters descend principally from Lavarack's stock, and field English setters from Llewellin's stock. Field setters are smaller, with less hair and a greater tendency to have patches, rather than flecks, of color.  English Setter Behavior Concerns  Makes a cheerful and active companion.\nUsually very good with children.\nMakes a good watchdog but poor protection dog.\nEager to please but easily distracted.\nDoes best with reward-based training involving food.\nOutgoing toward strangers.\nGets along well with other pets and dogs.\nEnjoys retrieving and hunting.  English Setter Suggested Exercises  Makes a calm housedog if given adequate exercise.\nRequires daily exercise in the form of a long walk, jog, or energetic games.\nField lines tend to be more energetic.\nA good candidate for dog parks.\nObedience training is essential not only for control, but for the mental exercise it provides.  English Setter Grooming  Coat is fairly long, silky, and either flat or slightly wavy.\nThe coat needs brushing and combing two to three times a week to prevent mats.\nIt needs monthly bathing.\nSome clipping and trimming is needed every month to maintain optimal looks.\nShedding is average.  Suggested English Setter Nutritional Needs  English setters tend to be eager eaters, and some may put on too much weight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nPuppies should be fed a balanced a puppy food. ","lifespan_lower_yr":10,"lifespan_upper_yr":12,"height_lower_in":0,"height_upper_in":0,"weight_lower_lb":0,"weight_upper_lb":0,"jogging_partner":4,"lap_dog":1,"good_with_children":4,"warm_weather":3,"cold_weather":3,"grooming_requirements":3,"shedding":3,"barking":2,"ease_of_training":3,"created_ts":"2024-02-27 20:20:35","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"english-springer-spaniel","details":" English Springer Spaniel  History  Spaniels were developed at least by the 1300s to flush birds into nets or to waiting falcons. Later, with the advent of shotguns, they were also used to find and point birds.\nSpaniels became specialized by their size, the terrain they hunted over, and the type of birds they hunted. The first record of land spaniels that may have been Springers was in the 1500s.\nBy 1800, distinct strains of springer-type spaniels were bred in England. One prominent strain became known as Norfolk spaniels after the dogs bred by the Duke of Norfolk. These dogs heavily influenced the larger land spaniels.\nThe American Spaniel Club was form in 1880, and began to separate the larger springer spaniels from the smaller Cocker spaniels. Until then, they were considered size variants of a single land spaniel breed.\nThe larger land spaniel became known as the springer spaniel in 1900.\nThe breed remained a popular and adept hunting spaniel, and also a formidable show dog.\nSpringer spaniels have won Best in Show at the Westminster Kennel Club dog show six times between the first time in 1963 and the latest time in 2007.\nBoth U.S. Presidents Bush have owned springer spaniels.\nThe breed is the second most popular spaniel.  English Springer Spaniel Behavior Concerns  Makes an exuberant and energetic companion.\nUsually good with children.\nA happy dog, not easily bothered by things.\nEager to please and quick to learn, but can be excitable and easily distracted.\nDoes best with reward-based training involving food.\nOutgoing toward strangers.\nGets along well with other pets and dogs.\nEnjoys retrieving.\nEnjoys swimming.\nSome bark a lot.\nA few have been implicated in sudden aggressive episodes that appear to have little warning.  English Springer Spaniel Suggested Exercises  Makes a fairly calm housedog if given adequate exercise.\nRequires daily exercise in the form of a long walk, jog or energetic games.\nField-bred dogs tend to be more energetic and require more exercise.\nA good candidate for dog parks.\nObedience training is essential not only for control, but for the mental exercise it provides.\nTolerates both warm and cool weather well.  English Springer Spaniel Grooming  Coat is of medium length; silky, and either flat or wavy.\nThe coat needs brushing and combing one to two times a week to prevent mats.\nProfessional grooming and clipping is required every few months to keep up appearances.\nThe ears must be checked weekly for problems.\nShedding is average.  Suggested English Springer Spaniel Nutritional Needs  Springers have a tendency to become overweight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nPuppies should be fed a balanced a puppy food. ","lifespan_lower_yr":10,"lifespan_upper_yr":14,"height_lower_in":18,"height_upper_in":21,"weight_lower_lb":40,"weight_upper_lb":50,"jogging_partner":3,"lap_dog":2,"good_with_children":3,"warm_weather":3,"cold_weather":3,"grooming_requirements":4,"shedding":3,"barking":2,"ease_of_training":5,"created_ts":"2024-02-27 20:20:36","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"french-bulldog","details":" French Bulldog  History  In the mid 1800s, many lace workers from England went to France for work, taking their dogs with them. Bulldogs were fairly popular in England at the time, including undersized \"toy\" bulldogs.\nThe toy bulldogs were a hit with French women. The ones with erect ears were especially sought after, despite this being considered a most undesirable trait in England. Dog dealers were quick to fill their orders, and the little Bulldogs became very popular in Paris-especially with French street walkers!\nThe dogs became known as bouledogue Francais.\nBy the late 1800s, French ladies also became enamored with the breed.\nIn 1893, the dogs came full circle when they were taken back to England. Bulldog breeders in England were unhappy because they feared the French dogs would be bred back to their English bulldogs, introducing bat ears and other undesirable traits. Bouledogue Francais breeders were equally unhappy, fearing their dogs would be assimilated into the bulldog breed and lost. They formed their own club in 1902, breaking away from the English bulldog.\nIn 1905, The Kennel Club in England recognized the bouledogue Francais as a separate breed. In 1912 they changed the name to French bulldog.\nIn America, the little dogs were also a hit among society ladies. They fetched fabulous prices, and only the very wealthy could afford them. The Rockefellers and the J.P. Morgans petitioned for the AKC to recognize the breed, which the AKC did in near record time, in 1898.\nBy 1913, French bulldogs were among the most popular show dogs in America.\nIn recent years, the Frenchie has experienced another upsurge in popularity.  French Bulldog Behavior Concerns  Makes a clownish and fun-loving companion.\nPlayful and very good with children. However, children can hurt the Frenchie's back with rough play.\nAffectionate and amiable.\nFriendly toward strangers.\nFairly friendly toward strange dogs.\nGood with other pets.\nWilling to please, but can be stubborn. May rebel against forceful methods.\nDoes best with reward-based training using food or games as reward.  French Bulldog Suggested Exercises  Makes a calm and trustworthy housedog.\nRequires daily exercise in the form of a leisurely walk or some backyard games.\nExtremely prone to overheating because of its flat face. Indoor games are preferable in warm weather.\nIts short coat does not protect it against the cold.\nObedience and trick training provide essential mental stimulation.\nFrench bulldogs cannot swim!  French Bulldog Grooming  The coat needs only occasional brushing, once every week or so, to remove dead hair.\nShedding is average.\nFacial wrinkles, as well as any wrinkles around the tail, should be examined, cleaned and dried daily.  Suggested French Bulldog Nutritional Needs  Has a decided tendency to be overweight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":9,"lifespan_upper_yr":11,"height_lower_in":10,"height_upper_in":13,"weight_lower_lb":28,"weight_upper_lb":28,"jogging_partner":1,"lap_dog":4,"good_with_children":5,"warm_weather":1,"cold_weather":1,"grooming_requirements":2,"shedding":3,"barking":1,"ease_of_training":2,"created_ts":"2024-02-27 20:20:36","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"german-shepherd","details":" German Shepherd  History  In late 1800s Germany, herdsmen needed a dog that could take command of large flocks of sheep, preventing the sheep from wandering into fields, driving them from one area to another, protecting them from marauders, and acting as a sort of moving fence by constantly patrolling along the flock's perimeter.\nCaptain Max von Stephanitz determined to create a sheepherding strain of dog that consistently combined the assets needed to perform all of these functions.\nIn 1899, Captain von Stephanitz found such a dog, which he named Horand van Grafrath. The Captain founded a club devoted to the new breed, and registered Horand as the first Deutsche Schaferhunde.\nUnder the Captain's guidance, the breed quickly became unrivaled at herding large flocks, but at the same time, large flocks were becoming less common. So Captain von Stephanitz reinvented the breed, focusing on obedience and protectiveness. He then promoted them as police and military dogs. When World War I broke out, the German Shepherd's feats eclipsed those of any other military dogs ever used.\nThe breed was recognized by the AKC in 1908, but failed to make much of an impact until after World War I. During the war, their name had been shortened in America from German Sheepdog to simply Shepherd Dog in order to distance them from Germany.\nSoldiers returning to their homelands after the war often did so with tales of these astounding dogs. Some even brought dogs back as well. Rin Tin Tin was one such dog.\nHollywood stars Strongheart and Rin Tin Tin cemented the breed in the hearts of movie goers. Such was his popularity, Rin Tin Tin is credited as the actor that saved Warner Brothers.\nIn 1925, the German Shepherd became the most popular dog in America, a position it held until 1936.\nIt has been one of the most popular breeds in America since then, and remains a popular service and military dog.  German Shepherd Behavior Concerns  Makes a devoted and protective companion.\nGenerally gentle with children, but may be overly protective.\nA one family dog, tending to be aloof toward and suspicious of strangers. It needs early socialization so that it willingly accepts new people.\nDoes best with reward-based training involving food or games.\nIts aptitude for learning and its serious attitude about any job have made it a dependable breed for a variety of jobs.\nDoes not tend to make dog friends easily, but is pretty good with other household pets.\nEnjoys mental and physical challenges.\nSome owners train their dogs in Schutzhund, a sport that combines obedience, tracking, and protection.  German Shepherd Suggested Exercises  Makes a calm but alert housedog given daily outings.\nNeeds daily walks, jogs, hikes or play sessions.\nRunning, jogging and retrieving are favored methods of exercise.\nObedience training, agility training or other mental exercise is also vital.  German Shepherd Grooming    Suggested German Shepherd Nutritional Needs  German Shepherds tend to stay in good weight. Young dogs can be thin, but they will generally gain weight without any special diet as they mature.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nPuppies should be fed a large-breed growth food, which slows their growing rate, but not final size. This has been shown to decrease the incidence or severity of hip dysplasia in adults. ","lifespan_lower_yr":10,"lifespan_upper_yr":12,"height_lower_in":22,"height_upper_in":26,"weight_lower_lb":75,"weight_upper_lb":95,"jogging_partner":4,"lap_dog":1,"good_with_children":3,"warm_weather":3,"cold_weather":3,"grooming_requirements":2,"shedding":5,"barking":2,"ease_of_training":5,"created_ts":"2024-02-27 20:20:38","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"german-shorthaired-pointer","details":" German Shorthaired Pointer  History  In the 1600s, a heavy type of pointer called the Spanish Pointer was crossed with a scent trailing hound called the Hannover Hound to produce a dog that could both trail and point mammals and birds. The dog could even dispatch wounded game, including fox.\nLater crosses to English Pointers gave the dogs a more stylish look and a hunting style that was less scenthound like; that is, a nose-up style of locating game.\nThe dogs became known as Deutsch Kurzhaars.\nIn the early 1800s two of the dogs, named Nero and Treff, so distinguished themselves at the German Derby that their progeny became sought after. They are considered the foundation of the modern breed.\nThe first Shorthair came to America in the 1920s.\nThe AKC recognized the breed in 1930.\nAlthough the German Wirehaired Pointer tends to be more popular in Germany, the German Shorthaired Pointer quickly became more favored in America as both a hunting dog and companion.  German Shorthaired Pointer Behavior Concerns  Makes an energetic and protective family member.\nGentle and playful with children, although may be too boisterous for small children.\nDemanding of attention.\nLoves to run and hunt.\nModerately outgoing toward strangers.\nUsually good with other dogs.\nCan be somewhat aggressive toward other pets.\nLearns quickly.\nDoes best with a firm owner who can combine reward-based training with good control and leadership.\nSome can whine or bark a lot.  German Shorthaired Pointer Suggested Exercises  Makes a fairly calm and alert housedog if given adequate exercise. If not given enough exercise, can be overactive and destructive.\nRequires daily exercise in the form of a long walk, or preferably, long jog. Vigorous games are also helpful.\nA well-fenced yard is essential.\nHunting is the favored exercise. Swimming and retrieving are also favorites.\nThis is not a breed for an inactive owner.\nObedience training is essential not only for control, but for the mental exercise it provides.  German Shorthaired Pointer Grooming  Coat is short and tough.\nIt requires brushing once a week to remove dead hair.\nShedding is average.  Suggested German Shorthaired Pointer Nutritional Needs  GSPs tend to stay in good weight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":12,"lifespan_upper_yr":14,"height_lower_in":0,"height_upper_in":0,"weight_lower_lb":0,"weight_upper_lb":0,"jogging_partner":5,"lap_dog":1,"good_with_children":3,"warm_weather":3,"cold_weather":3,"grooming_requirements":1,"shedding":3,"barking":3,"ease_of_training":3,"created_ts":"2024-02-27 20:20:38","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"golden-retriever","details":" Golden Retriever  History  Developed in England along the Tweed River in the middle 1800s.\nLord Tweedmouth wanted to create a dog with the strength to push through heavy cover, stamina to swim tirelessly, toughness to brave cold water, and gentleness to retrieve game unharmed.\nThe original Goldens, then considered to be a yellow variety of Flat-Coated Retrievers, were a mixture of Wavy-Coated Retriever, Tweed Water Spaniel, setters, black retrievers, and even a Bloodhound.\nIn England, the breed was originally recognized in 1903 as Flat Coats-Golden. In 1912 the name was changed to the Yellow or Golden Retriever.\nAlthough they were in America by 1900, the AKC did not recognize them until 1927.\nGoldens are among the most successful guide and assistance dogs. They also work in search and rescue.\nU.S. President Gerald Ford owned a Golden named Liberty.\nA Golden Retriever starred in the two Homeward Bound movies.\nThe Golden Retriever has been one of the most popular breeds in America for decades.  Golden Retriever Behavior Concerns  Makes a playful and trustworthy child's companion.\nEager to please, but can be overly exuberant.\nA happy dog, not easily bothered by things.\nDoes best with reward-based training involving food or retrieving.\nIts aptitude for learning, combined with its happy attitude and quick responses, make it one of the top breeds for obedience competition.\nOutgoing toward strangers.\nGets along well with other pets and dogs.\nLoves to retrieve, to the point of seeming compulsive.\nLoves to swim.  Golden Retriever Suggested Exercises  Makes a calm housedog, but only if given adequate exercise.\nNeeds daily walks, jogs, hikes or play sessions.\nSwimming and retrieving are favored methods of exercise.\nObedience training or other mental games are also important.\nGoldens enjoy hunting, and many owners compete in field events with them.  Golden Retriever Grooming  Coat is straight or wavy, and dense. It is of medium to long length. Neutered or spayed individuals tend to have longer coats.\nColor varies from very light cream to dark mahogany.\nBrushing twice a week is adequate; more frequent brushing is necessary during shedding seasons.\nShedding is average to above average.  Suggested Golden Retriever Nutritional Needs  Goldens have a tendency to become overweight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nPuppies should be fed a large-breed growth food, which slows their growing rate, but not final size. This may decrease the incidence or severity of hip dysplasia in adults. ","lifespan_lower_yr":10,"lifespan_upper_yr":13,"height_lower_in":22,"height_upper_in":24,"weight_lower_lb":55,"weight_upper_lb":75,"jogging_partner":3,"lap_dog":1,"good_with_children":5,"warm_weather":3,"cold_weather":3,"grooming_requirements":3,"shedding":3,"barking":2,"ease_of_training":5,"created_ts":"2024-02-27 20:20:39","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"great-dane","details":" Great Dane  History  The Great Dane probably originated in the Middle Ages as a combination of strong mastiff-like war dogs and swift greyhound-like dogs. The combination made for a big-game hunter of great speed and strength.\nBy the 1300s, they were popular with nobility in Germany as unrivaled hunting dogs and imposing estate guardians.\nIt's not clear when the breed made its way to England, where it was initially called the German boarhound, and later, Great Dane.\nNobody knows the origin of the name, Great Dane, especially because the dog is not Danish. In 1880, German dog authorities declared the name should only be Deutsche dogge, the name by which it still goes in Germany.\nThe Great Dane came to America in the late 1800s, where it immediately attracted attention.\nThe AKC recognized the Great Dane in 1887.\nThe most famous Great Danes are cartoon characters Marmaduke and Scooby-Doo.  Great Dane Behavior Concerns  Makes a loyal and protective companion.\nPlayful and gentle with children, but its sheer size can make it not the best choice as a child's playmate.\nOutgoing toward strangers.\nGenerally good with other dogs, but some can be aggressive toward strange dogs.\nGenerally good with other pets.\nLearns quickly, but can be both sensitive and stubborn.\nDoes best with a firm owner who can combine reward-based training with good control and leadership.  Great Dane Suggested Exercises  Makes a calm and alert housedog, as long as it receives adequate exercise.\nRequires daily exercise in the form of a long walk or short jog.\nThe Dane's short coat makes it intolerant of very cold weather.\nObedience training is essential not only for control, but for the mental exercise it provides.  Great Dane Grooming  Coat is short and shiny.\nIt needs only occasional brushing, once every week or so, to remove dead hair.\nShedding is average.  Suggested Great Dane Nutritional Needs  Great Danes tend to stay in good weight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nPuppies should be fed a large-breed growth food, which slows their growing rate but not final size. This may decrease the incidence or severity of hip dysplasia in adults. ","lifespan_lower_yr":7,"lifespan_upper_yr":10,"height_lower_in":28,"height_upper_in":30,"weight_lower_lb":110,"weight_upper_lb":180,"jogging_partner":2,"lap_dog":1,"good_with_children":2,"warm_weather":2,"cold_weather":2,"grooming_requirements":1,"shedding":3,"barking":1,"ease_of_training":3,"created_ts":"2024-02-27 20:20:41","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"greyhound","details":" Greyhound  History  Greyhound-like dogs have been depicted in hunting scenes since the days of the ancient Egyptians and Greeks.\nBy Saxon times, the greyhound was well established in Britain.\nIn 1014 the Forest Laws prohibited anyone but nobility from keeping greyhounds near royal forests unless they had been lamed so they couldn't hunt. The Forest Laws helped establish greyhounds as dogs of the nobility, who were more interested in using greyhounds for sport rather than for catching dinner.\nDuring the 1800s, coursing stag and hare with greyhounds became a favored sport of the upper class.\nBy the 1800s, greyhounds were brought to America, where they were used to course game in the Midwestern plains.\nHare coursing became a spectator sport by holding coursing contests in enclosed parks.\nIn 1926, greyhound racing using a mechanical lure was introduced. This began the selection of greyhounds for short bursts of speed, soon establishing them as the fastest breed of dog.\nToday, greyhounds in America are of two divergent types: the more well-known racing, or NGA (National Greyhound Association) greyhound and the less popular AKC greyhound. Retired NGA racing greyhounds make up most of the pet greyhound population.  Greyhound Behavior Concerns  Makes a loyal and gentle companion.\nCan be clownish at times, but its independent nature may make play frustrating for children. It is not a retriever at heart.\nIt is not very good at coming when called, and may tend to run off to chase things, particularly small fast animals.\nIf raised with cats, can be good with house cats. Retired racers may or may not be good with cats.\nGood with other dogs and with children.\nLearns quickly, but is easily bored.\nDoes best with reward-based training involving food.  Greyhound Suggested Exercises  Makes a very quiet housedog as long as its exercise needs are met.\nRequires a moderate walk or jog, or a sprint in an enclosed area, every day.\nMost greyhounds should not be let off leash unless the area is securely fenced.\nA few games and tricks provide needed mental exercise.\nIts short hair provides little protection against cold weather. A coatmay bebeneficialin cold weather.  Greyhound Grooming  Coat is short and thin. Some NGA greyhounds have a slightly thicker coat.\nThe coat needs weekly brushing and occasional bathing.\nShedding is below average.  Suggested Greyhound Nutritional Needs  Greyhound conformation is for a naturally lean build, but owners often overfeed them. You should be able to feel the ribs, but they should not be too noticeable.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":10,"lifespan_upper_yr":13,"height_lower_in":26,"height_upper_in":29,"weight_lower_lb":60,"weight_upper_lb":70,"jogging_partner":4,"lap_dog":2,"good_with_children":3,"warm_weather":2,"cold_weather":2,"grooming_requirements":1,"shedding":2,"barking":1,"ease_of_training":3,"created_ts":"2024-02-27 20:20:42","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"havanese","details":" Havanese  History  The Havanese is a descendent of the barbichon family of dogs, which in turn descend from the barbet, a large water dog behind the Poodle. The barbichon family was centered around the Mediterranean.\nSpanish traders brought some of these dogs with them when they traveled, giving them to Cuban women.\nThe dogs became pampered pets in Cuba, especially favored with the upper class. They became known as the Habenero.\nEventually some of these dogs were brought back to Europe, where they were called white Cubans. Here they became popular both as pets and as performing dogs.\nTheir popularity as pets waned, and their numbers dwindled, but they remained popular as trick performers in the circus.\nIn the 1950s and 60s, three families left Cuba for the United States, bringing their dogs with them. Most present-day Havanese descend from these dogs, with some input from later imports.\nThe AKC recognized the Havanese in 1999.  Havanese Behavior Concerns  Makes an affectionate and exuberant companion.\nPlayful, gentle and very good with children.\nVery friendly to strangers, other dogs and other pets.\nDoes best with reward-based training involving food or games.\nEager to please, bright and responsive.  Havanese Suggested Exercises  Makes a lively and alert housedog.\nA walk around the block once or twice daily, plus a vigorous game, will meet its exercise needs, not counting bathroom breaks.\nMany Havanese have been trained to use indoor potty systems.\nDog parks can work out well as long as Havanese are not expected to mingle with much larger dogs.\nGames and tricks provide needed mental exercise.\nIts thick coat provides some protection against cold weather, but its fairly small body size nonetheless makes it vulnerable to the cold.  Havanese Grooming  Coat is long, and ranges from straight to curly, with wavy preferred.\nBrushing and combing two to four times a week is necessary to prevent matting.\nShedding is below average.\nNo breed is actually non-allergenic, but Havanese may cause fewer allergies compared to most other breeds.  Suggested Havanese Nutritional Needs  Havanese tend to stay in good weight. The thick coat can sometimes obscure weight problems, so be sure to use your hands to feel.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":12,"lifespan_upper_yr":14,"height_lower_in":9,"height_upper_in":12,"weight_lower_lb":7,"weight_upper_lb":13,"jogging_partner":2,"lap_dog":5,"good_with_children":5,"warm_weather":3,"cold_weather":2,"grooming_requirements":4,"shedding":1,"barking":3,"ease_of_training":4,"created_ts":"2024-02-27 20:20:43","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"irish-setter","details":" Irish Setter  History  Setters originated before the advent of hunting birds with game, when dogs that spotted birds were expected to crouch so that hunters could throw a net over the birds without it getting snagged on the dog.\nThe oldest known setter dates back to the 1300s, but the Irish setter is more recent, probably from the 1700s. The breed is thought to be the result of crosses between English setters (and to a lesser extent, Gordon setters) and spaniels and pointers.\nThese crosses produced red and white setters that were fast working and could be seen from a distance, qualities desired by Irish bird hunters.\nAround 1800, the first kennel of solid red setters was established. These dogs gained a reputation for both their hunting ability and striking color. Solid red setters and red and white setters diverged into different lines, now known as Irish setters and Irish red and white setters.\nIn 1862, a dog named Palmerston changed the look of the Irish Ssetter because of his unusually long head and slender build. Most modern Irish setters can be traced back to him.\nThe breed gained more popularity as a show dog compared to field dog, although it can still perform in both venues.\nIn the 1970s, the Irish setter rose to rank among the most popular breeds in America. Its popularity has since declined dramatically.  Irish Setter Behavior Concerns  Makes a tirelessly enthusiastic and active companion.\nUsually very good with children, but can be too boisterous for small children.\nEager to please but easily distracted.\nDoes best with reward-based training involving food.\nOutgoing toward strangers.\nGets along well with other pets and dogs.\nEnjoys retrieving and hunting.  Irish Setter Suggested Exercises  Makes a good housedog if given adequate exercise.\nRequires daily exercise in the form of a very long walk, jog, or energetic games. Field lines tend to be more energetic.\nA good candidate for dog parks.\nObedience training is essential not only for control, but for the mental exercise it provides.  Irish Setter Grooming  Coat is fairly long, silky, and either flat or slightly wavy.\nThe coat needs brushing and combing two to three times a week to prevent mats. It should be bathed once a month.\nSome clipping and trimming is needed every month to maintain optimal looks.\nShedding is average.  Suggested Irish Setter Nutritional Needs  Adult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nPuppies should be fed a balanced a puppy food. ","lifespan_lower_yr":12,"lifespan_upper_yr":14,"height_lower_in":25,"height_upper_in":27,"weight_lower_lb":60,"weight_upper_lb":70,"jogging_partner":5,"lap_dog":1,"good_with_children":4,"warm_weather":3,"cold_weather":3,"grooming_requirements":3,"shedding":3,"barking":2,"ease_of_training":3,"created_ts":"2024-02-27 20:20:43","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"irish-wolfhound","details":" Irish Wolfhound  History  The first mention of an Irish wolfhound is from Rome in 391 A.D. The breed gained fame as a gladiator of wild animals in the arena and as a hunter of large game.\nThe combination of speed and strength made the dog the subject of many stories.\nThe Irish name for the breed is Cu Faoil. Cu is a term implying bravery, and was once given to all large hounds.\nIrish chieftains favored the dogs for hunting the wolf and Irish elk. They also gave groups of them as traditional gifts to foreign nobility.\nThe breed declined in number so that they were almost extinct in Ireland by 1800. The famine of 1845 almost ended the breed.\nIn 1869, Captain G.A. Graham set about to reconstitute the breed by crossing the few remaining Irish Wolfhounds with other breeds such as the Scottish deerhound, Borzoi and Great Dane.\nThe breed regained its numbers and became famous as the world's tallest dog.  Irish Wolfhound Behavior Concerns  Makes a loyal and gentle companion.\nIts laidback nature may make play frustrating for children. It is not a retriever.\nGood with children, strangers, and other pets and dogs.\nIt is unhurried when it comes to minding.\nIt is not particularly good as either a watchdog or protection dog.\nIt enjoys hunting and chasing wild animals.\nObedience training is a must because of its size and strength.\nDoes best with reward-based training involving food.  Irish Wolfhound Suggested Exercises  Makes a very quiet housedog as long as its exercise needs are met.\nRequires a moderate walk or short jog, or a run in an enclosed area, every day.\nA few games and tricks provide needed mental exercise.\nIts harsh coat provides some protection against cold and wet weather.  Irish Wolfhound Grooming  Coat is rough and harsh.\nThe coat needs weekly brushing and occasional bathing.\nDead hairs should be stripped from the coat twice a year.\nShedding is below average.\nCalluses can form on the elbows and other pressure points, and can be difficult to cure.  Suggested Irish Wolfhound Nutritional Needs  Irish wolfhound conformation is for a moderate build.\nYou should be able to feel the ribs, but they should not be too noticeable.\nPuppies should be fed a large breed growth food so that they do not grow too fast.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":6,"lifespan_upper_yr":8,"height_lower_in":30,"height_upper_in":32,"weight_lower_lb":105,"weight_upper_lb":120,"jogging_partner":2,"lap_dog":1,"good_with_children":2,"warm_weather":1,"cold_weather":4,"grooming_requirements":1,"shedding":1,"barking":1,"ease_of_training":2,"created_ts":"2024-02-27 20:20:45","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"italian-greyhound","details":" Italian Greyhound  $ History  As early as 2000 years ago, artwork dating from Turkey, Greece and other areas around the Mediterranean depicts small greyhound-like dogs that may be Italian reyhounds.\nBy the Middle Ages, miniature greyhounds could be found throughout southern Europe. Italian courtiers especially favored the little dogs.\nThey came to England in the 1600s, where they also became favorites of the upper class. Their popularity in England was at its peak during the reign of dog enthusiast Queen Victoria, but by the early 1900s the Italian greyhound's popularity was on the decline.\nAfter World War II, the breed almost disappeared in England. The few specimens that remained were not very good quality because the emphasis on breeding had for so long been on diminutive size rather than type or soundness. The breed, though small in numbers, was high in quality in America, and these American dogs formed the basis of the Italian greyhound revival.\nThe Italian greyhound is now one of the more popular of the greyhound-like breeds.  Italian Greyhound Behavior Concerns  Makes a loyal and loving companion.\nIt is one of the most demonstrative and obedient of the greyhound-like breeds.\nOften described as \"clingy.\"\nSociable with children, strangers, and other dogs and animals.\nExtremely gentle.\nCan be easily intimidated.\nLearns quickly, but is easily bored.\nDoes best with reward-based training involving food or play. Very sensitive.\nTends to be difficult to housetrain.  Italian Greyhound Suggested Exercises  Makes a very quiet housedog as long as its exercise needs are met.\nRequires a moderate walk or a sprint in an enclosed area every day.\nGames and tricks provide needed mental exercise.\nIts short coat provides virtually no protection against cold weather.Acoat or sweater may be beneficial for Italian greyhounds exposed to colder temperatures.\nThe Italiangreyhoundis extremely swift. When raised with access to free running its bones are strong, but when raised without a chance to run and jump, it may be susceptible to broken bones when finally allowed to jump off things.  Italian Greyhound Grooming  Coat is short and thin. Italian greyhounds do not do well in cold weather.\nThe coat needs weekly brushing.\nShedding is below average.  Suggested Italian Greyhound Nutritional Needs  Italian greyhound conformation is for a naturally thin build, but owners often overfeed them. You should be able to feel the ribs, but they should not be too noticeable.\nVery young or small puppies should be fed frequently to avoid low blood sugar (hypoglycemia).\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":12,"lifespan_upper_yr":15,"height_lower_in":13,"height_upper_in":15,"weight_lower_lb":7,"weight_upper_lb":14,"jogging_partner":2,"lap_dog":5,"good_with_children":4,"warm_weather":4,"cold_weather":1,"grooming_requirements":1,"shedding":2,"barking":2,"ease_of_training":3,"created_ts":"2024-02-27 20:20:45","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"jack-russell-terrier","details":" Jack Russell Terrier  History  Also known as Parson Russell terrier.\nThe Parson John Russell developed the breed that bears his name. He was a foxhunting enthusiast who wanted a good terrier to run with the hound pack and to dispatch the fox at the end of the hunt. A milkman gave him a dog named Trump, which suited his purpose and became the dog the breed was modeled after.\nAside from Trump, nobody knows what dogs he used to create his breed. In fact, Jack Russell terrier proponents long considered the dogs a strain, rather than a breed, meaning they could mix in another dog for effect occasionally.\nThe Parson devoted his life to his dogs and to foxhunting. Although he judged other breeds at dog shows, he never once exhibited his own dogs. This is one reason Jack Russell terriers were not shown in dog shows until fairly recently.\nIn the early 1900s, some Jack Russell terriers began to appear with very short legs. This eventually caused a heated debate between fanciers who preferred the traditional long legged terriers and those who preferred the shorter legged ones. In England, the longer legged ones were known as Parson Jack Russell terriers.\nShorter legged Jack Russell terriers are extremely popular among many of the horse set.\nIn America, many breed fanciers fought against AKC recognition, but the AKC recognized the Jack Russell terrier in 2000. To this day, many Jack Russell terriers are registered with the Jack Russell Terrier Club of America (JRTCA) rather then the AKC.\nThe AKC later changed the breed name to Parson Russell terrier, emphasizing that these are the longer legged dogs. Most people still know them as Jack Russell terriers, however.\nFamous media Jack Russells include Moose - the dog who played Eddie on Frasier, and Wishbone.  Jack Russell Terrier Behavior Concerns  Makes an entertaining and adventurous companion, as well as an excellent watchdog.\nPlayful and good with children.\nNeeds a lot of interaction.\nBold, watchful, busy, independent and mischievous.\nFriendly toward strangers.\nCan be scrappy with other dogs.\nMay not be good with small pets, especially rodents.\nMay not come when call.\nTends to run off in search of adventure or animals. May go into underground dens in search of game.\nDoes best with reward-based training involving food or games.\nLearns quickly, but also bores quickly, and may come up with its own ideas.\nSome tend to bark a lot, which should be discouraged from an early age.\nSome tend to dig a lot.\nObedience training is essential.  Jack Russell Terrier Suggested Exercises  Makes a lively and alert housedog.\nIts exercise needs can be met with a long walk or run, along with several vigorous games. They also need a chance to sniff and explore in a safe place or on leash.\nWithout sufficient mental and physical exercise, this breed can be destructive and disobedient.\nJack Russells tend to enjoy dog parks, and most do well in them as long as they are not allowed to bully other dogs.\nGames and tricks provide needed mental exercise. Agility is a favored sport.  Jack Russell Terrier Grooming  Coat can be either smooth or broken. The smooth coat is flat and hard. The broken coat is harsh, straight and close-lying.\nBoth coat types need weekly brushing to remove dead hair.\nThe broken coat may need stripping of long dead hair.\nShedding is average.  Suggested Jack Russell Terrier Nutritional Needs  Jack Russell terriers tend to stay in good weight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":13,"lifespan_upper_yr":15,"height_lower_in":12,"height_upper_in":14,"weight_lower_lb":13,"weight_upper_lb":17,"jogging_partner":4,"lap_dog":1,"good_with_children":4,"warm_weather":3,"cold_weather":3,"grooming_requirements":1,"shedding":3,"barking":4,"ease_of_training":3,"created_ts":"2024-02-27 20:20:46","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"keeshond","details":" Keeshond  History  The Keeshond is a member of the ancient Spitz family of dogs. It is actually most closely related the Pomeranian and American Eskimo.\nThe exact origin is unknown, but the breed was established in Holland as a watchdog and companion at least by the 18th century.\nThe breed later became known as the barge dog because it was used as a watchdog on barges that travelled the Rhine.\nIn the years before the French Revolution, the leader of the Patriot faction, a man named Kees de Gyselaer, appeared in many political cartoons along with his barge dog. The dog became a symbol of the movement, and known as a dog of the people. It also began being referred to as a Keeshond. When the Patriot party did not prevail, many Keeshond owners disposed of their dogs.\nWith larger barges, the Keeshond became less favored as a barge dog, and by the 1900s the breed was rare.\nIn 1920,a concerted effort, led by the Baroness van Hardenbroek, was made to revive the breed. Progress was rapid because several good-quality Keeshonden were found.\nThe breed received AKC recognition in 1930.\nThe Keeshond is the national dog of Holland.\nThe breed is often called \"the smiling Dutchman.\"\nThe plural of Keeshond is Keeshonden.  Keeshond Behavior Concerns  Makes a loyal and loving companion.\nPlayful and careful with children.\nLess independent than most Spitz breeds.\nGood with other dogs and pets.\nSociable with children.\nLearns quickly.\nDoes best with reward-based training involving food or games.  Keeshond Suggested Exercises  Makes a trustworthy and quiet housedog as long as its exercise needs are met.\nRequires a moderate walk or jog every day.\nMost Keeshonden do well in dog parks.\nGames and tricks provide needed mental exercise.\nIts thick coat provides good protection against cold weather but may make it prone to overheating.  Keeshond Grooming  Coat is made up of a soft thick undercoat covered by a straight, harsh outer coat that stands off from the body.\nThe coat needs brushing once or twice weekly-more when shedding heavily.\nIt needs bathing every month or so.\nShedding is above average.  Suggested Keeshond Nutritional Needs  Keeshonden have a tendency to put on weight. The thick coat can obscure weight problems, so be sure to use your hands to feel the ribs to identify obesity.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":12,"lifespan_upper_yr":14,"height_lower_in":17,"height_upper_in":18,"weight_lower_lb":35,"weight_upper_lb":45,"jogging_partner":3,"lap_dog":2,"good_with_children":5,"warm_weather":1,"cold_weather":4,"grooming_requirements":3,"shedding":4,"barking":2,"ease_of_training":3,"created_ts":"2024-02-27 20:20:47","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"labrador-retriever","details":" Labrador Retriever  History  Despite their name, they originated in Newfoundland, not Labrador.\nDeveloped from the \"Lesser\" Newfoundland-a medium-sized black dog that retrieved game and fish from cold waters, and even pulled small boats.\nAlthough they died out in Newfoundland, the Labs we see today are descended from those that were taken to England in the early 1800s.\nIn England, they gained favor as upland game retrievers; by 1870, the name Labrador Retriever was common in England.\nTwo Labs of the 1880s, Buccleuch Avon and Ned, are widely considered to be the ancestors of all modern Labs.\nIn 1892, the first liver Labs were officially recorded, and in 1899, the first yellow Lab. However, yellow and chocolate dogs did exist before then.\nLabs came to America as Scottish-style shooting and gamekeeping became prestigious among upper class sportsmen.\nThe breed was recognized by the English Kennel Club in 1903, and the AKC in 1917.\nIn 1938, a Lab became the first dog to appear on the cover of Life magazine, bringing the breed national attention. The Lab was also the first dog to be featured on a U.S. stamp, in 1959.\nLabs gradually replaced other breeds as the most popular guide dogs. They are also popular search and rescue dogs, assistance dogs and contraband detection dogs.\nSince 1991, the Labrador Retriever has been the most popular breed in America. It is also the most popular breed in the United Kingdom, Canada, Australia, and New Zealand.\nU.S. President Bill Clinton owned a Labrador named Buddy, and Russian President Vladimir Putin owned a Labrador named Koni.  Labrador Retriever Behavior Concerns  Makes a playful and trustworthy child's companion.\nEager to please, but can be oblivious to corrections.\nA happy dog, with a good old boy attitude; not easily bothered.\nOutgoing toward strangers.\nGets along well with other pets and dogs.\nLoves to retrieve, to the point of seeming compulsive.\nLoves to swim.\nQuick to learn, but tends to pull when on leash.\nDoes best with reward-based training involving food or retrieving.  Labrador Retriever Suggested Exercises  Can be a calm housedog if given adequate exercise.\nNeeds daily walks, jogs, hikes or play sessions.\nSwimming and retrieving are favored methods of exercise.\nAlso needs mental exercise in the form of training or games.\nField-bred Labs are lighter built and more active than show-bred Labs, and will usually require more exercise.\nLabs enjoy hunting, and many owners compete in field events with them.  Labrador Retriever Grooming  Coat is straight and thick, but fairly short.\nColors are black, yellow and chocolate. No other colors are considered acceptable.\nBrushing once a week is adequate; more during shedding seasons.\nShedding is average to above average.  Suggested Labrador Retriever Nutritional Needs  Labradors have a tendency to become obese.\nAdult dogs should be fed a balanced diet that does not allow them to become overweight.\nPuppies should be fed a large-breed growth food, which slows their growing rate but not final size. This has been shown to decrease the incidence or severity of hip dysplasia in adults. ","lifespan_lower_yr":10,"lifespan_upper_yr":12,"height_lower_in":22,"height_upper_in":25,"weight_lower_lb":55,"weight_upper_lb":80,"jogging_partner":3,"lap_dog":1,"good_with_children":4,"warm_weather":3,"cold_weather":4,"grooming_requirements":2,"shedding":4,"barking":2,"ease_of_training":5,"created_ts":"2024-02-27 20:20:48","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"lhasa-apso","details":" Lhasa Apso  History  Recent DNA studies indicate that the Lhasa Apso is among the 14 most ancient breeds recognized by the AKC.\nThe Lhasa apso is an ancient breed from Tibet, where it was revered in the villages and monasteries.\nThe dogs acted as monastery lookouts, sounding the alarm at the arrival of visitors. This gave rise to their native name of Abso Seng Kye, which means bark lion sentinel dog. The name Lhasa apso may be derived from this.\nThe souls of llamas were believed to enter the dogs' bodies after the llamas died, which added to the reverence given these dogs.\nWhen the breed first came to England in the early 1900s, it was called the Lhassa terrier.\nThe breed came to America around 1930. It was recognized by the AKC in 1935. At that time it was assigned to the terrier group, but it was reassigned to the Non-sporting group in 1959.\nThe Lhasa's popularity has risen slowly but steadily in the last two decades  Lhasa Apso Behavior Concerns  Makes a loyal and entertaining companion.\nPlayful and good with children.\nA one family dog, tending to be aloof toward strangers. Early socialization so that it willingly accepts new people is important.\nGenerally friendly toward other dogs and pets.\nTends to be bold, stubborn and independent, which makes training using force methods extremely unproductive.\nDoes best with reward-based training involving food or games.\nSome tend to bark a lot.\nHousetraining can be more challenging than with many other breeds.  Lhasa Apso Suggested Exercises  Makes an active and alert housedog.\nAlthough many of its physical exercise needs can be met with indoor games, it still needs the mental stimulation of walking and sniffing outdoors.\nA walk around the block once or twice daily will meet its outdoor needs, not counting bathroom breaks.\nMany Lhasas have been trained to use indoor potty systems.\nDoes well at dog parks as well as it is separated from large dogs.\nDoes not tend to enjoy hot weather.\nSwimming is not recommended unless constantly supervised.\nGames and tricks provide needed mental exercise.  Lhasa Apso Grooming  Coat is long, hard and straight.\nBrushing and combing every other day is necessary to prevent mats.\nMany pet owners elect to have their dogs professionally groomed, or clipped into a trim that is more easily cared for.\nHair must be kept out of eyes to avoid irritation.\nThe hair around the anus must be checked daily for hygiene issues.\nShedding is below average.  Suggested Lhasa Apso Nutritional Needs  Lhasa apsos tend to stay in good weight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":12,"lifespan_upper_yr":14,"height_lower_in":10,"height_upper_in":11,"weight_lower_lb":13,"weight_upper_lb":15,"jogging_partner":1,"lap_dog":4,"good_with_children":3,"warm_weather":2,"cold_weather":3,"grooming_requirements":4,"shedding":2,"barking":3,"ease_of_training":1,"created_ts":"2024-02-27 20:20:49","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"maltese","details":" Maltese  History  Maltese probably originated in Asia in ancient times, and eventually made their way to Europe and then to the Isle of Malta, perhaps used as exotic items of barter by traders.\nAristotle mentioned a tiny dog he referred to as a Canis Melitae (the name for Malta in those times), and drawings on Greek and Roman pottery show small long-haired dogs of general Maltese type.\nEarly Maltese came in a variety of colors.\nThe first Maltese came to England during the reign of Henry VIII.\nBy the mid 1800s they were favorite lap dogs of the upper class, and they were one of the earliest breeds exhibited in dog shows. They were called Maltese Terriers at the time.\nThe first Maltese came to America in the late 1800s. They were initially exhibited in America as Maltese Lion Dogs. AKC recognized them as Maltese in 1888.\nThe Maltese remained fairly unknown until its numbers started rising slowly in the 1950s. It reached the list of 15 most popular breeds in the 1990s. It remains in the top 20.  Maltese Behavior Concerns  Makes both an affectionate lap dog and exuberant playmate.\nPlayful and good with children, but children must be supervised because they could easily hurt such a small dog.\nReserved toward strangers.\nGood with other dogs and pets, although it may foolishly challenge larger dogs.\nTends to be bold and curious.\nSome bark a lot.\nLearns quickly, but tends to have a stubborn streak.\nDoes best with reward-based training involving food or games.  Maltese Suggested Exercises  Makes a lively and alert housedog.\nAlthough many of its physical exercise needs can be met with indoor or backyard games, it still needs the mental stimulation of going for walks.\nA walk around the block once or twice daily will meet its outdoor needs, not counting bathroom breaks.\nMany Maltese can be trained to use indoor potty systems.\nDog parks are not generally a good idea unless only small dogs are allowed together.\nGames and tricks provide needed mental exercise.\nDespite their long coat, most Maltese do not tolerate cold weather well because of their lack of undercoat and small size.  Maltese Grooming  Coat is long, flat and silky.\nCombing every day or two is needed to prevent matts.\nMany owners elect to have their dogs professionally groomed, often clipping them in easily maintained styles.\nHair must be kept out of eyes to avoid irritation.\nThe hair around the anus must be checked daily for hygiene issues.\nShedding is below average.\nThe breed is prone to periodontal problems, which can be prevented in large part by regular tooth brushing.  Suggested Maltese Nutritional Needs  Maltese tend to stay in good weight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nRemember, it does not take much food to feed a small dog, and small snacks can easily add too many calories.\nMaltese puppies should be fed often to prevent hypoglycemia, a serious condition to which very small puppies are prone. Frequent small meals of high protein, fat, and complex carbohydrates may help guard against this condition. ","lifespan_lower_yr":12,"lifespan_upper_yr":14,"height_lower_in":9,"height_upper_in":10,"weight_lower_lb":4,"weight_upper_lb":6,"jogging_partner":0,"lap_dog":4,"good_with_children":2,"warm_weather":3,"cold_weather":2,"grooming_requirements":3,"shedding":2,"barking":3,"ease_of_training":3,"created_ts":"2024-02-27 20:20:50","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"mastiff","details":" Mastiff  History  The mastiff breed is the namesake of the larger mastiff family of dogs. The mastiff family is an ancient group of dogs that was used in hunting, battle and in gladiator sports.\nBy medieval times mastiff-type dogs were almost commonplace. They continued to be used for large game hunting, bear and bull baiting, dog fighting, and guarding.\nMastiffs were favorites among many of the nobility. The mastiff of Sir Peers Legh was famous for standing over his master after Sir Legh fell in battle, protecting him for hours. The dog became the foundation of the Lyme Hill mastiffs, which figured prominently in founding the modern mastiff some 500 years later.\nAlthough a mastiff is said to have been aboard the Mayflower, the earliest documented mastiff in America was not until the 1800s.\nThe AKC recognized the mastiff in 1885.\nWorld War II decimated the breed in England. American mastiffs were used after the war to reconstitute the breed.  Mastiff Behavior Concerns  Makes a loyal and protective companion.\nGentle and generally good with children, but may be overly protective of them when around strangers. As with all large dogs, dogs and children should always be supervised.\nTends to be aloof toward strangers. Early socialization is essential.\nFairly friendly toward strange dogs.\nGood with other pets.\nLearns quickly, but can be stubborn. It tends to rebel against forceful methods.\nDoes best with a firm owner who can combine reward-based training with good control and leadership.  Mastiff Suggested Exercises  Makes a calm and well-mannered housedog.\nRequires daily exercise in the form of a moderate walk or short jog.\nThe mastiff prefers cold weather to warm.\nObedience training is essential not only for control, but for the mental exercise it provides.  Mastiff Grooming  Coat is short, straight, and coarse.\nThe coat needs only occasional brushing, once every week or so, to remove dead hair.\nShedding is average.\nBe prepared for drool.  Suggested Mastiff Nutritional Needs  Mastiffs tend to stay in good weight or be slightly overweight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nPuppies should be fed a large-breed growth food, which slows their growing rate but not final size. This may decrease the incidence or severity of hip dysplasia in adults. ","lifespan_lower_yr":9,"lifespan_upper_yr":11,"height_lower_in":28,"height_upper_in":30,"weight_lower_lb":175,"weight_upper_lb":190,"jogging_partner":1,"lap_dog":1,"good_with_children":2,"warm_weather":2,"cold_weather":3,"grooming_requirements":2,"shedding":3,"barking":1,"ease_of_training":3,"created_ts":"2024-02-27 20:20:51","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"miniature-bull-terrier","details":" Miniature Bull Terrier  History  When bull baiting and dog fighting were outlawed in England, many patrons of the bull and terrier breed, which was a popular gladiator, decided to clean up the dog's image. They bred for personality and appearance, and began to compete in dogs shows successfully.\nAround 1860, James Hinks crossed the bull and terrier with the white English terrier and the Dalmatian, producing an all-white strain he called the bull terrier. These dogs became sought after as stylish companions for young gentlemen.\nIn the early days, the breed had a great range in acceptable sizes. In fact, tiny bull terriers as small as 4 pounds were recorded early on. These toy bull terriers were not very good specimens and eventually faded from the scene, but the slightly larger miniature bull terriers caught on.\nThe English Kennel Club recognized the miniature bull terrier in 1939.\nThe AKC recognized the miniature bull terrier in 1991.  Miniature Bull Terrier Behavior Concerns  Makes a loyal and lively companion.\nPlayful, comical and often mischievous.\nVery good with children.\nFairly friendly toward strangers.\nNot very friendly towards strange dogs.\nUsually good with other pets.\nThe bull terrier learns quickly, but can be stubborn and independent. It tends to rebel against forceful methods.\nDoes best with a firm owner who can combine reward-based training with good control and leadership.\nSome like to dig a lot.  Miniature Bull Terrier Suggested Exercises  Makes a calm and alert housedog as long as it receives regular exercise.\nRequires daily exercise in the form of a walk, short jog, or energetic games.\nThe miniature bull terrier enjoys cold weather outings but its short coat is not suited to living outside.\nObedience training is essential not only for control, but for the mental exercise it provides.  Miniature Bull Terrier Grooming  Coat is short, flat and harsh.\nThe coat needs only occasional brushing, once every week or so, to remove dead hair.\nShedding is average.  Suggested Miniature Bull Terrier Nutritional Needs  Miniature bull terriers tend to stay in good weight or tend to be slightly overweight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":11,"lifespan_upper_yr":14,"height_lower_in":10,"height_upper_in":14,"weight_lower_lb":25,"weight_upper_lb":33,"jogging_partner":2,"lap_dog":1,"good_with_children":4,"warm_weather":3,"cold_weather":3,"grooming_requirements":1,"shedding":3,"barking":2,"ease_of_training":1,"created_ts":"2024-02-27 20:20:52","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"miniature-pinscher","details":" Miniature Pinscher  History  The miniature pinscher is a miniature version of the German pinscher (not the Doberman pinscher, which was developed after the min pin).\nIt probably arose from crossing German pinschers with Dachshunds and Italian greyhounds.\nIn the early 1800s they were developed as a distinct breed called the \"reh pinscher,\" so named because of their resemblance to the German roe (reh) deer. Pinscher simply means terrier.\nIn the late 1800s, breeders tried to produce tiny size at the expense of other features. In the early 1900s, the trend was reversed and the breed became a slightly taller but more elegant dog, gaining popularity quickly.\nTheir popularity plummeted around the world after World War I, but slowly regained momentum in America.\nThe AKC recognized them in 1929.\nThe min pin is known as the \"king of toys.\"  Miniature Pinscher Behavior Concerns  Makes an endlessly enthusiastic and energetic companion.\nPlayful and very good with children, although very young or unruly children may hurt it with rough play.\nReserved with strangers.\nMay be cocky and even scrappy with other dogs.\nMay not be good with small pets.\nDoes best with reward-based training involving food or games.\nLearns quickly, but is easily bored and distracted.\nSome may bark a lot.  Miniature Pinscher Suggested Exercises  Makes an alert housedog.\nThis is an extremely active and playful dog. A daily walk around the block, coupled with several play sessions, will help meet its exercise needs.\nMay not do well in dog parks unless large dogs are segregated from small dogs. Even so, some min pins may bully other small dogs.\nGames and tricks provide needed mental exercise.\nIts thin coat and small size makes it vulnerable to chilling.  Miniature Pinscher Grooming  Coat is smooth, hard and short.\nBrushing once a week will remove dead hair.\nShedding is average.  Suggested Miniature Pinscher Nutritional Needs  Min pins have a tendency to be overweight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nSmall snacks can cause weight problems in tiny dogs.\nTiny min pin puppies should be fed often to prevent hypoglycemia, a serious condition to which very small puppies are prone. Frequent small meals of high protein, fat, and complex carbohydrates may help guard against this condition. ","lifespan_lower_yr":12,"lifespan_upper_yr":14,"height_lower_in":10,"height_upper_in":13,"weight_lower_lb":8,"weight_upper_lb":10,"jogging_partner":2,"lap_dog":3,"good_with_children":3,"warm_weather":3,"cold_weather":1,"grooming_requirements":1,"shedding":1,"barking":3,"ease_of_training":1,"created_ts":"2024-02-27 20:20:53","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"miniature-poodle","details":" Miniature Poodle  History  The earliest version of the poodle may have been the barbet, a curly-coated dog found in France, Russia, Hungary, Germany and elsewhere in Europe. The barbet may have descended from Asian herding dogs and water dogs.\nThe German version of the barbet became the dog we now know as the poodle.\nThe word \"poodle\" comes from the German word \"pfudel,\" which means \"puddle\" or \"to splash,\" a reference to the poodle's ability as a water retriever. \r\n\r\n    The poodle later worked as a circus performer, military dog, guard dog and guide dog.\nThe poodle's hair cut originated as a working clip for retrieving in cold water. The hair was cropped close to cut down on its weight and drag, but left longer over the head and chest for warmth. Although it's often claimed the hair was left longer on the joints and tail tip for warmth and protection, evidence suggest that the style arose later, as decoration when the poodle became a performing circus dog. Regardless, the clip became more accentuated over time.\nThe French aristocracy became enamored with the poodle and adopted it as its own. It eventually became the national dog of France, and to this day many people refer to it as the French poodle, even though it is a German breed.\nSmaller versions were bred in France, and by the late 1800s had been perfected. One of these became the miniature poodle.\nThe AKC recognized the poodle in 1887. Only later did they split the breed into three varieties according to size.\nIn the 1920s, poodles were so unpopular they all but died out in America. They staged a comeback in the 1930s. They were the most popular breed in America from 1960 to 1982, the longest continuous run of any breed.\nThe miniature is the most popular variety.  Miniature Poodle Behavior Concerns  Makes an affectionate and fun-loving companion.\nPlayful and very good with children.\nFriendly to strangers, other dogs and other pets.\nDoes best with reward-based training involving food or games.\nEager to please, bright and responsive, poodles are among the easiest of dogs to train.\nExcels at obedience and agility competitions, therapy dog work, and even contraband detection.\nSome tend to bark a lot, which should be discouraged from an early age.  Miniature Poodle Suggested Exercises  Makes a lively and alert housedog.\nA walk around the block once or twice daily, plus a vigorous game in the yard, will meet its exercise needs, not counting bathroom breaks.\nMany miniature poodles have been trained to use indoor potty systems.\nDog parks can work out well as long as Miniature Poodles are not expected to mingle with much larger dogs.\nGames and tricks provide needed mental exercise.\nSwimming is a favored exercise, but a full coat can weigh down a dog.\nIts thick coat provides some protection against cold weather, but its fairly small body size nonetheless makes it vulnerable to the cold.  Miniature Poodle Grooming  Coat is curly, harsh and dense.\nBrushing and combing every other day is necessary to prevent matting.\nMost people have their dogs professionally clipped every six weeks.\nMost people opt for a sporting clip where the hair is fairly short all over.\nOriginally, the poodle's coats were corded, so they hung in long dreadlocks. This takes a lot of work and is difficult to wash, so the style has fallen out of favor.\nShedding is below average.\nNo breed is actually hypoallergenic, but poodles may cause allergies in fewer people compared to other breeds.\nThe eyes should be checked regularly for hair or lashes that may irritate their surface.\nHair growing inside the ears may need to be plucked out or clipped.  Suggested Miniature Poodle Nutritional Needs  Poodles tend to stay in good weight. The thick coat can sometimes obscure weight problems, so be sure to use your hands to feel.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight ","lifespan_lower_yr":13,"lifespan_upper_yr":15,"height_lower_in":10,"height_upper_in":15,"weight_lower_lb":12,"weight_upper_lb":18,"jogging_partner":2,"lap_dog":4,"good_with_children":5,"warm_weather":3,"cold_weather":3,"grooming_requirements":5,"shedding":1,"barking":3,"ease_of_training":5,"created_ts":"2024-02-27 20:20:54","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"miniature-schnauzer","details":" Miniature Schnauzer  History  The miniature schnauzer was developed from crossing standard schnauzers with affenpinschers, miniature pinschers, poodles and possibly fox terriers and Scottish terriers. Some accounts even include the Pomeranian. They were developed in Germany in the late 1800s.\nThe breed was developed as a small farm dog and ratter.\nThe schnauzer is the only terrier not originating from European Isle stock.\nThe earliest record of a miniature schnauzer is from 1888. The earliest record of one being exhibited in a dog show is from 1899.\nThe name schnauzer comes from the German word, schnauze, meaning snout, possibly because of the heavy whiskers.\nThe first miniature schnauzers came to America in 1924.\nThe standard and miniature schnauzer were at first considered variants of the same breed, and were shown together at early dog shows. They were divided into separate breeds in 1899 in Germany, and in 1926 in America.\nAfter World War II, miniature schnauzers began to grow in popularity, eventually peaking as America's 3rd most popular breed.  Miniature Schnauzer Behavior Concerns  Makes a loyal and fun companion, as well as an excellent watchdog.\nPlayful and good with children.\nBold, watchful, busy, and often mischievous.\nTakes a second to get to know strangers, but is then quite friendly.\nMost get along well with other dogs.\nGets along with other pets.\nDoes best with reward-based training involving food or games.\nLearns quickly, but also bores quickly, and may come up with its own ideas.\nSome tend to bark a lot, which should be discouraged from an early age.  Miniature Schnauzer Suggested Exercises  Makes a lively and alert housedog.\nIts exercise needs can be met with a long walk or short run, along with a vigorous game. They also need a chance to sniff and explore in a safe place or on leash.\nMiniature schnauzers tend to enjoy and do well at dog parks.\nGames and tricks provide needed mental exercise.  Miniature Schnauzer Grooming  Coat is hard and wiry, longer on the legs, muzzle, and eyebrows.\nThe coat needs combing once or twice weekly.\nMany pet owners elect to have their dogs professionally groomed, or clipped into a trim that is more easily cared for. This must be repeated every other month.\nShow dogs must have their coat plucked and stripped.\nShedding is below average.  Suggested Miniature Schnauzer Nutritional Needs  Miniature schnauzers tend to stay in good weight or to be slightly overweight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":12,"lifespan_upper_yr":14,"height_lower_in":12,"height_upper_in":14,"weight_lower_lb":13,"weight_upper_lb":15,"jogging_partner":2,"lap_dog":1,"good_with_children":4,"warm_weather":3,"cold_weather":3,"grooming_requirements":3,"shedding":2,"barking":4,"ease_of_training":3,"created_ts":"2024-02-27 20:20:54","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"mixed-breed","details":" Mixed Breed  History  Mixed breeds can be divided into cross-breeds, which are the product of two pure breeds; mutts, which are the product of many breeds over generations; or indigenous dogs, which are not properly mixed breeds, but are dogs that have no purebred ancestors.\nIndigenous dogs include native strains that have never been subject to human selection.\nAlmost all current pure breeds are derived from indigenous dogs initially, and then from subsequent mixes.\nThroughout the history of the world, various types of mixed breeds have fulfilled the roles of hunter, guardian, herder, draft animal and companion. Only in the mid 1800s did the fashion for pure breeds begin, and even then, mixes remained the dog of choice for most people.\nEarly American settlers brought their mixed breed dogs with them when they moved westward, and early Native Americans had indigenous dogs.\nIn the mid 1900s, more families were able to afford purebred dogs, which were a status symbol of sorts. By the late 1900s, owning a mixed breed, especially of shelter origin, became more in vogue.\nSeveral mixed breeds have been celebrities, including Benji, the movie star.\nMore recently, hybrid dogs, also called designer dogs, have become popular. These dogs are purposely bred crosses between two pure breeds.\nMixed breeds continue to be the most popular dog in the world.\nSome companies now claim they can determine what breeds are behind a cross-bred or mutt by means of DNA testing using a cheek swab or blood sample.  Mixed Breed Behavior Concerns  Indigenous dogs tend to be independent and clever. They are often a challenge to live with.\nThe behavior of cross-breds and mutts depends on what breeds are behind them.\nThose with hound or terrier breeds tend to be more independent.\nThose with retriever or herding breeds tend to be more obedient.\nThose with terrier breeds tend to be feistier around other dogs.\nLike most breeds, they do best with reward-based training involving food.  Mixed Breed Suggested Exercises  Indigenous dogs tend to need a lot of exercise.\nThe exercise needs of cross-breds and mutts depends on what breeds are behind them and how large and athletic they are.\nThose with sporting or terrier breeds tend to be most active.\nThose with sighthound, flock guarding or giant breeds tend to be less active.\nAlthough the physical exercise needs of many small dogs can be met with backyard games, they also need to walk and explore outside the home.\nSmall, lean, short-haired dogs tend to become chilled easily.\nLarge, round, thick-coated, short-muzzled dogs tend to become overheated easily.  Mixed Breed Grooming  All dogs should be brushed at least once a week, with long hair requiring more frequent brushing.\nDogs with hair that grows continuously tend not to have defined shedding periods. As a result, they shed less than other breeds, but also usually require more grooming or even clipping.\nDogs with long hair around the eyes should be checked regularly for eye irritations.\nDogs with long hair around the anus must be checked regularly for hygiene issues.  Suggested Mixed Breed Nutritional Needs  Most dogs love to eat, and obesity is one of the most common problems seen among both mixed and pure breeds.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nTiny puppies that will likely be toy-sized as adults should be fed often to prevent hypoglycemia, a serious condition to which very small puppies are prone. Meals of high protein, fat, and complex carbohydrates may also help guard against this condition.\nPuppies that will likely be large or giant-sized as adults should be fed a large-breed growth food, which slows their growing rate but not final size. This may decrease the incidence or severity of hip dysplasia in adults. ","lifespan_lower_yr":10,"lifespan_upper_yr":15,"height_lower_in":8,"height_upper_in":28,"weight_lower_lb":10,"weight_upper_lb":120,"jogging_partner":3,"lap_dog":3,"good_with_children":3,"warm_weather":3,"cold_weather":3,"grooming_requirements":3,"shedding":3,"barking":3,"ease_of_training":3,"created_ts":"2024-02-27 20:20:55","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"newfoundland","details":" Newfoundland  History  The Newfoundland was developed on the coast of Newfoundland in the1700s. The breed's origins are unknown, but they seem to trace back to the 1662 settlement of the Roougnoust colony. The settlers are said to have included Great Pyrenees dogs. These dogs were bred with black English retrievers and possibly some husky-type dogs.\nThe result was a large water-loving dog that was resilient to freezing weather and water. The dogs were all-purpose water dogs, hauling nets through the water, and even saving people who fell in. On land, they served as draft dogs and pack animals.\nBy the late 1700s, they were called Newfoundlands. They came in solid black and in black and white; the latter were dubbed Landseers in 1779, named after the prominent artist who painted them.\nEuropean visitors took specimens back to England, where they entered the show ring. At the same time, numbers dropped in Newfoundland. Eventually, Canadian and American breeders had to replenish their stock with Newfoundlands brought back from England.\nThe AKC recognized the Newfoundland in 1886.\nWorld War II decimated the breed in England. This time, the American dogs had to replenish the European stock.\nThe Newfoundland quickly regained numbers. It remains one of the more popular giant breeds.  Newfoundland Behavior Concerns  Makes a devoted and sweet companion.\nPatient and good with children. As with all large dogs, dogs and children should always be supervised.\nVery affectionate.\nVery friendly toward strangers.\nFriendly toward strange dogs.\nGood with other pets.\nLearns quickly and is willing to please.\nSensitive.\nDoes best with reward-based training with food rewards.  Newfoundland Suggested Exercises  Makes a calm and well-mannered housedog.\nRequires daily exercise in the form of a moderate walk or short jog.\nThe Newfoundland enjoys cold weather, but doesn't do well in warm weather.\nSwimming is a favorite exercise.\nObedience training is essential not only for control, but for the mental exercise it provides.  Newfoundland Grooming  Coat consists of a soft dense undercoat and a coarse, moderately long, straight outer coat.\nThe coat needs only occasional brushing, once or twice every week, more often when shedding.\nShedding is above average.\nBe prepared for drool.  Suggested Newfoundland Nutritional Needs  Newfoundlands tend to stay in good weight or be slightly overweight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nPuppies should be fed a large-breed growth food, which slows their growing rate but not final size. This may decrease the incidence or severity of hip dysplasia in adults. ","lifespan_lower_yr":8,"lifespan_upper_yr":10,"height_lower_in":26,"height_upper_in":28,"weight_lower_lb":100,"weight_upper_lb":150,"jogging_partner":1,"lap_dog":1,"good_with_children":4,"warm_weather":1,"cold_weather":5,"grooming_requirements":3,"shedding":4,"barking":1,"ease_of_training":4,"created_ts":"2024-02-27 20:20:56","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"old-english-sheepdog","details":" Old English Sheepdog  History  The first picture that may be of an Old English sheepdog dates from 1771, although whether it is actually an OES is unknown. More evidence exists that the breed originated in the west of England in the 1800s. It was developed to fill the need for a strong dog that could both defend flocks and herds, and to drive them to market. It may have been derived from the bearded collie or Russian owtcharka.\nAt that time there was a tax on many dogs. Working dogs, evidenced by their docked tails, were exempt. As a drover's dog, the OES had its tail docked, or \"bobbed,\" to avoid taxes. The tradition of tail docking persisted after the taxes were lifted. The OES is sometimes called the bobtail.\nBy the early 1900s the breed was as popular, or more so, in the show ring as in the pasture.\nThe AKC recognized the OES in 1905.\nIn the 1970s, the OES became a popular media dog, appearing in movies and television. This helped spur its popularity as a pet for many years. Since that time its popularity has decreased gradually.  Old English Sheepdog Behavior Concerns  Makes a gentle and entertaining companion.\nDevoted to and protective of its family.\nGood with children.\nGood with other dogs and pets.\nDoes best with reward-based training involving games or food.\nLearns quickly, but can be headstrong.  Old English Sheepdog Suggested Exercises  Makes a well-mannered housedog, given adequate exercise.\nIt needs a moderate to long walk, or a good run or play session every day.\nGames and tricks provide needed mental exercise.\nEnjoys cold weather, but cannot live permanently outside in it.  Old English Sheepdog Grooming  Coat is long, hard and shaggy, with a thick waterproof undercoat.\nIt needs brushing and combing every other day or thick mats will form.\nShedding is average to below average.\nThe long hair around the eyes is usually tied back for everyday life so that it doesn't interfere with vision.  Suggested Old English Sheepdog Nutritional Needs  OESs tend to stay in good weight.\nChanges in weight can be difficult to notice under the thick coat, so you must feel at least weekly.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":10,"lifespan_upper_yr":12,"height_lower_in":21,"height_upper_in":22,"weight_lower_lb":60,"weight_upper_lb":80,"jogging_partner":2,"lap_dog":1,"good_with_children":3,"warm_weather":2,"cold_weather":4,"grooming_requirements":5,"shedding":3,"barking":3,"ease_of_training":2,"created_ts":"2024-02-27 20:20:57","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"papillon","details":" Papillon  History  The papillon's ancestors were spaniels that were developed at least by the 1300s to flush birds into nets or to waiting falcons.\nSome smaller spaniels were probably bred with Oriental toy dogs such as the Japanese chin to create a lapdog version of the spaniel.\nThese dwarf spaniels were used to serve as lap and foot warmers, surrogate hot water bottles, and for companionship. They became extremely popular throughout Europe by the 1500s.\nThe Court of Louis XIV of France was especially fond of dwarf spaniels, and played a role in developing the French version.\nMost of these dogs had drop ears, but the erect ears appeared soon after. Even today, both types can be found in the same litter.\nPapillon means butterfly in French, referring to the general outline of the face and ears. The drop-eared type is known as the phalene, which means moth, again referring to the look of its face and ears.\nIn Europe the phalene is known as a separate breed, the continental toy spaniel.\nBy 1900, papillons were popular show dogs in Europe and had made their way to America.\nThe AKC recognized the papillon in 1915.  Papillon Behavior Concerns  Makes a loving and entertaining companion.\nExtremely good with children. Children must be careful around such a small dog, however.\nVery affectionate.\nMakes a good lapdog as well as fun playmate.\nSensitive; some can be timid.\nEager to please and quick to learn.\nDoes best with reward-based training involving food and games.\nOutgoing toward strangers.\nGets along well with other pets and dogs.\nEnjoys retrieving.\nOne of the best toy dogs in the sports of obedience and agility. Also excel as therapy dogs.  Papillon Suggested Exercises  Makes a calm but alert housedog.\nRequires daily exercise in the form of a short walk or energetic games.\nIts exercise needs can be met by indoor games, but it needs the chance to get outside and sniff new smells and see new sights every day.\nMany papillons have been trained to use indoor potty systems.\nA good candidate for dog parks, but should be kept separate from larger dogs.\nObedience training provides mental exercise.  Papillon Grooming  Coat is long, silky, and straight.\nThe coat needs brushing and combing twice a week.\nShedding is average.  Suggested Papillon Nutritional Needs  Papillons tend to stay in good weight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. Remember, it does not take much food to feed such a small dog, and small snacks can easily add too many calories.\nPapillon puppies should be fed often to prevent hypoglycemia, a serious condition to which very small puppies are prone. Frequent small meals of high protein, fat, and complex carbohydrates may help guard against this condition. ","lifespan_lower_yr":12,"lifespan_upper_yr":15,"height_lower_in":8,"height_upper_in":11,"weight_lower_lb":4,"weight_upper_lb":9,"jogging_partner":1,"lap_dog":5,"good_with_children":5,"warm_weather":3,"cold_weather":1,"grooming_requirements":3,"shedding":3,"barking":4,"ease_of_training":5,"created_ts":"2024-02-27 20:20:58","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"pekingese","details":" Pekingese  History  Recent DNA studies indicate that the Pekingese is among the 14 most ancient breeds recognized by the AKC.\nIt has been known in China since ancient times. Its earliest version was the ha pa dog, and then later the foo dog that was bred to resemble the lion.\nPalace eunuchs headed extensive breeding programs and pampered the dogs.\nSmaller Pekingese were known as sleeve dogs because they could be carried in the large sleeves of the Chinese robes.\nThe British looted the Chinese palace in 1860, taking five of the royal lion dogs back to England. They presented one, named Lootie, to Queen Victoria. These dogs caused a stir among dog fanciers, and others were brought from China.\nThe AKC recognized the breed in 1906.\nIn 1912, a Pekingese was one of three to dogs to survive the sinking of the Titanic.\nFor many years, only the wealthiest westerners could afford to own a Pekingese.\nOver the years it has become one of the most consistently popular toy breeds with pet owners, and one of the most successful of all breeds at dog shows.  Pekingese Behavior Concerns  Makes a devoted and aristocratic family member.\nGood with children, but may not be playful enough for them.\nNot overly demonstrative.\nReserved toward strangers.\nNot overly friendly towards strange dogs.\nUsually good with small pets.\nTends to be independent and very stubborn. Rebels against forceful methods.\nDoes best with reward based training using food.  Pekingese Suggested Exercises  Makes a calm and trustworthy housedog.\nRequires daily exercise in the form of a leisurely walk or quick game. It is not physically suited to overly vigorous exercise.\nMany Pekingese have been taught to use indoor potties.\nEnjoys cold weather.\nBecomes overheated very easily. It is essential to keep them in a cool place.  Pekingese Grooming  Outer coat is long, coarse and off-standing, forming a mane around the shoulders. The undercoat is thick.\nNeeds brushing twice weekly to prevent matting.\nThe wrinkle over the nose should be cleaned and dried daily to prevent infection.\nThe hair around the anus should be inspected for hygiene issues daily.\nShedding is average.\nThe breed is prone to periodontal problems, which can be prevented in large part by regular tooth brushing.  Suggested Pekingese Nutritional Needs  Pekingese tend to stay in good weight or to be slightly overweight. You must use your hands to feel beneath the thick coat.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":13,"lifespan_upper_yr":15,"height_lower_in":6,"height_upper_in":9,"weight_lower_lb":14,"weight_upper_lb":14,"jogging_partner":0,"lap_dog":5,"good_with_children":2,"warm_weather":1,"cold_weather":3,"grooming_requirements":5,"shedding":3,"barking":1,"ease_of_training":1,"created_ts":"2024-02-27 20:20:59","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"pembroke-welsh-corgi","details":" Pembroke Welsh Corgi  History  It may not look like it at first glance, but breed historians contend the corgi descends from the spitz family of dogs. This family is characterized by small pointed ears, pointed muzzle, thick fur, and a bushy tail. The corgi is a dwarfed version, likely related to the Swedish valhund or Norwegian buhund.\nThe name Corgi may be derived from the Welsh \"cor\" (dwarf, or sometimes, to gather) and \"ci\" (dog), although it could also be derived from the word for cur.\nA Welsh cattle dog was mentioned as early as the 1100s, although it's not know if that was a type of corgi. They were well-documented by the 1800s.\nCorgis were used to drive cattle, gather flocks of geese and chickens, herd sheep and ponies, and to guard the farm.\nTheir short stature and nimble action enabled them to duck beneath the kicking hooves of cattle.\nAs a working dog, they were passed over in the early days of dog showing. Only in 1926 did they enter the show ring in England. At first, Pembroke and Cardigan Welsh corgis were shown as the same breed, despite the fact that the two were almost certainly derived from different stock.\nIn 1933, Princess Elizabeth acquired her first Pembroke corgi, drawing attention to the breed. Her Corgis remain the most well-known Corgis in the world.\nThe first corgis came to America in the early 1930s.\nThe AKC recognized the Pembroke in 1934.\nBy the 1960s, the Pembroke was one of the most popular dogs around the world, and especially in Britain. Its popularity has since waned somewhat, but it still has many followers.  Pembroke Welsh Corgi Behavior Concerns  Makes a biddable and fun-loving family member.\nGentle and playful with children.\nWhen excited, many tend to nip at heels in play.\nModerately outgoing toward strangers.\nGood with other dogs and pets.\nWilling to please, learns quickly.\nDoes best with reward-based training using food or play.\nSome can bark a lot.  Pembroke Welsh Corgi Suggested Exercises  Makes a fairly calm and alert housedog if given adequate exercise.\nRequires daily exercise in the form of a long walk or short run. Vigorous games are also helpful.\nA well-fenced yard is essential.\nHerding is the favored exercise.\nThis is not a breed for an inactive owner.\nObedience training is essential for the mental exercise it provides.  Pembroke Welsh Corgi Grooming  Coat is medium length and somewhat coarse.\nIt requires brushing once a week to remove dead hair.\nShedding is average.  Suggested Pembroke Welsh Corgi Nutritional Needs  Pembrokes have a tendency to be overweight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":11,"lifespan_upper_yr":13,"height_lower_in":10,"height_upper_in":12,"weight_lower_lb":25,"weight_upper_lb":27,"jogging_partner":2,"lap_dog":2,"good_with_children":5,"warm_weather":3,"cold_weather":3,"grooming_requirements":2,"shedding":4,"barking":4,"ease_of_training":4,"created_ts":"2024-02-27 20:21:00","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"pomeranian","details":" Pomeranian  History  Pomeranians descend from the ancient Spitz family of dogs. Like their Spitz ancestors, they have many features to combat cold weather, including a thick coat, small ears, and a bushy tail to warm the nose when curled up sleeping.\nNot much is known about how the Pomeranian evolved from the Spitz, except that the early Pomeranians were much larger than today's, weighing around 30 pounds.\nThe Pomeranian comes from Pomerania, in what is now part of northern Poland and Germany.\nThey were eventually prized as pets through out Europe. Some Pomeranian owners included Michelangelo, Mozart, and Isaac Newton.\nPomeranians were the first dogs to live in the then-new Buckingham Palace, moving in with Queen Charlotte in 1761.\nIn 1888, Queen Victoria, a Pom fancier, changed the size of the breed by importing what was then a tiny Pomeranian that weighed only 12 pounds. The dog, Marco, set the trend for smaller Poms.\nThe Pom was not as popular in America as it was in Europe, but it was AKC recognized by 1900. By the 1930s, it was one of the ten most popular breeds in America. Since that time it has come in and out of the top 10.  Pomeranian Behavior Concerns  Makes a fun-loving and energetic companion.\nPlayful and good with children, but children must be supervised because they could easily hurt such a small dog.\nTrue to its Spitz heritage, it is spunky, bold and adventurous.\nA one family dog, tending to be aloof toward strangers. Early socialization so that it willingly accepts new people is important.\nSome can be cocky and even aggressive toward other dogs.\nLearns quickly, but can be stubborn.\nDoes best with reward-based training involving food or games.\nSome tend to bark a lot, which should be discouraged from an early age.\nHousetraining can be more challenging than with many other breeds.  Pomeranian Suggested Exercises  Makes a lively and alert housedog.\nAlthough many of its physical exercise needs can be met with indoor games, it still needs the mental stimulation of walking and sniffing outdoors.\nA walk around the block once or twice daily will meet its outdoor needs, not counting bathroom breaks.\nMany Poms have been trained to use indoor potty systems.\nDog parks are not generally a good idea unless only small dogs are allowed together.\nGames and tricks provide needed mental exercise.\nExcursions in doggy purses can also provide entertainment.\nIts thick coat provides some protection against cold weather, but its small body size nonetheless makes it vulnerable to the cold.  Pomeranian Grooming  Coat is made up of a soft thick undercoat covered by a longer harsh outer coat.\nBrushing and combing twice weekly-more when shedding heavily-is necessary to prevent matting.\nThe hair around the anus must be checked daily for hygiene issues.\nShedding is above average.\nRegular tooth brushing may prevent periodontal disease, which is common in Poms.  Suggested Pomeranian Nutritional Needs  Pomeranians tend to stay in good weight. The thick coat can sometimes obscure weight problems, so be sure to use your hands to feel.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nBecause of their small size, it takes only a little overfeeding or a few snacks to create an overweight dog.\nPom puppies should be fed often to prevent hypoglycemia, a serious condition to which very small puppies are prone. Meals of high protein, fat, and complex carbohydrates may also help guard against this condition. ","lifespan_lower_yr":12,"lifespan_upper_yr":16,"height_lower_in":8,"height_upper_in":11,"weight_lower_lb":3,"weight_upper_lb":7,"jogging_partner":0,"lap_dog":3,"good_with_children":3,"warm_weather":3,"cold_weather":3,"grooming_requirements":3,"shedding":4,"barking":4,"ease_of_training":1,"created_ts":"2024-02-27 20:21:01","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"pug","details":" Pug  History  Pugs originated in China in ancient times. They were developed as lap dogs rather than as any sort of working dog.\nThe facial wrinkles were an essential breed feature. The vertical forehead wrinkles were thought to resemble the Chinese mark for \"Prince.\"\nDutch traders brought pugs back from China with them, and Holland subsequently became the pug's adopted homeland.\nThe pug became the official dog of the House of Orange because they sounded the alarm at the approach of invading soldiers in 1572.\nNapoleon's wife, Josephine, used her pug to carry messages back and forth when she was imprisoned.\nThe pug became the most popular royal dog in England during Victorian times.\nThe pug was known as Mopshond in Holland, as Mops in Germany, and as Dutch or Chinese pug in England.\nThe AKC recognized the pug in 1885.\nThe pug took a while to catch on in America, but it has a steady following and has been among the top 20 breeds for years.  Pug Behavior Concerns  Makes a devoted and entertaining family member.\nPlayful, affectionate and gentle with children, pugs make excellent companions for them.\nKnown for its clownish behavior and sense of humor.\nAffectionate and demonstrative.\nReserved toward strangers.\nUsually good with other dogs and pets.\nWilling to please but doesn't like to be forced, which brings out its stubborn streak.\nDoes best with reward-based training with good control and leadership.  Pug Suggested Exercises  Makes a calm and alert housedog.\nRequires daily exercise in the form of a leisurely walk, very short jog, or quick game. It is not physically suited to overly vigorous exercise.\nOverheats easily.\nSwimming is not recommended, as many pugs cannot stay afloat.\nObedience and trick training provides essential mental exercise.  Pug Grooming  The pug's coat is fine, smooth and short. The skin is overly abundant, and wrinkled on the face.\nThe coat needs weekly brushing to remove dead hair.\nWrinkles need regular cleaning and drying to prevent skin infections.\nShedding is above average.  Suggested Pug Nutritional Needs  Pugs have a tendency to become obese.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":12,"lifespan_upper_yr":15,"height_lower_in":10,"height_upper_in":11,"weight_lower_lb":14,"weight_upper_lb":18,"jogging_partner":1,"lap_dog":3,"good_with_children":5,"warm_weather":1,"cold_weather":3,"grooming_requirements":2,"shedding":4,"barking":2,"ease_of_training":3,"created_ts":"2024-02-27 20:21:02","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"rat-terrier","details":" Rat Terrier  History  The rat terrier's ancestors may have included Manchester terriers, smooth fox terriers, and perhaps whippets. Later breeds that may have played a role included the beagle, Italian greyhound, miniature pinscher and Chihuahua.\nMixes of these breeds came from dogs brought to America by working class immigrants from Britain in the late 1800s.\nRat terriers were used for both vermin control and for rat pit contests, where men bet on how many rats in a pit a dog could kill in a certain time period. A rat terrier holds the rat killing record of 2501 rats in a seven hour period in an infested barn.\nPresident Theodore Roosevelt hunted with these dogs and even kept some in the White House. He is credited with naming them rat terriers.\nThe Rat terrier has traditionally been viewed as a strain, rather than a breed, of dog, which means that crossing to other breeds and mixes has been permissible throughout most of its history. The modern incarnation of this practice is probably the feist, a strain of small terrier-like hunting dogs used to catch squirrels and other rodents.\nBecause it has been bred as a strain with used to hunt game of varied size, the rat terrier comes in a great range of sizes.\nRat terriers were popular farm dogs by the early 1900s; in fact, although no statistics are available, they were probably among the most popular dogs in America.\nWith the advent of pesticides in the 1950s, the rat terrier's popularity as a working vermin hunter declined. By that time, however, the breed had a following because of it attributes as a companion.\nSeveral breed clubs now exist, but they disagree about what the best course is for the future of the breed.\nThe National Rat Terrier Association has maintained breeding records for decades and is opposed to recognition by major kennel clubs.\nThe United Kennel Club recognized the rat terrier in 1999.\nThe Rat Terrier Club of America is working toward AKC recognition. It is recognized by the AKC Foundation Stock Service, which makes it eligible to compete in many AKC performance events.  Rat Terrier Behavior Concerns  Makes a loyal and energetic companion.\nPlayful and very good with children.\nSomewhat reserved with strangers\nMay be cocky and even scrappy with other dogs.\nMay not be good with small pets, and is especially ill-advised around rodents.\nDoes best with reward-based training involving food or games.\nEager to please, and learns quickly, but is easily bored and distracted.\nSome may bark a lot.  Rat Terrier Suggested Exercises  Makes an alert housedog.\nThis is a very active and playful dog. A daily walk around the block, coupled with several play sessions, will help meet its exercise needs.\nMay not do well in dog parks unless large dogs are segregated from small dogs. Even so, some rat terriers may bully other small dogs.\nGames and tricks provide needed mental exercise.\nIts thin coat and small size makes it vulnerable to chilling.  Rat Terrier Grooming  Coat is smooth, hard and short.\nBrushing once a week will remove dead hair.\nShedding is average.  Suggested Rat Terrier Nutritional Needs  Rat terriers tend to stay in good weight or be slightly overweight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nSmall snacks can cause weight problems in very small dogs.\nTiny rat terrier puppies should be fed often to prevent hypoglycemia, a serious condition to which very small puppies are prone. Frequent small meals of high protein, fat, and complex carbohydrates may help guard against this condition. ","lifespan_lower_yr":12,"lifespan_upper_yr":16,"height_lower_in":0,"height_upper_in":0,"weight_lower_lb":0,"weight_upper_lb":0,"jogging_partner":3,"lap_dog":3,"good_with_children":5,"warm_weather":3,"cold_weather":1,"grooming_requirements":1,"shedding":2,"barking":3,"ease_of_training":4,"created_ts":"2024-02-27 20:21:03","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"rhodesian-ridgeback","details":" Rhodesian Ridgeback  History  South African Hottentot tribes hunted with dogs that often had a ridge of hair running the opposite direction along their back.\nIn the 1500s and 1600s, Boer settlers arriving in South Africa brought with them mastiffs, Great Danes, greyhounds and other breeds that then interbred with native Hottentot dogs. \nIn 1875, Dr. David Livingston published one of the earliest engravings of a ridged dog in his memoirs, Missionary Travels in South Africa.\nAlso in 1875, missionary Charles Helm traveled to Rhodesia, bringing two dogs from his home in South Africa. A big game hunter, Cornelius von Rooyen, borrowed the dogs to try them at hunting. He was so impressed with their hunting ability that he worked for the next 35 years to have them breed true.\nThe dogs were especially adept at holding lions at bay, and were dubbed lion dogs.\nIn the 1920s, the name was changed to Rhodesian ridgeback and a standard of perfection was produced.\nIn the 1930s and 40s the breed came to Europe and America.\nToday it is among the most popular of AKC registered hounds in America.  Rhodesian Ridgeback Behavior Concerns  Makes a loyal and protective companion.\nGood with children, but can be overly boisterous for small children.\nMakes an excellent watchdog and good protection dog.\nIt is strong-willed, powerful and somewhat independent.\nReserved with strangers.\nGenerally good with other dogs and pets.\nObedience training is a necessity.\nDoes best with reward-based training involving food plus a firm hand.  Rhodesian Ridgeback Suggested Exercises  Makes a well-mannered housedog as long as its exercise needs are met.\nRequires a good walk or jog, or a run in an enclosed area, every day.\nNot generally a good dog for dog parks, but varies with individuals.\nIts short coat provides little protection against cold weather.  Rhodesian Ridgeback Grooming  Coat is short and close.\nThe coat needs weekly brushing and occasional bathing.\nShedding is below average.\nThe ridge of hair growing in the opposite direction along the midline of the back is distinctive and leaves no doubt as to whether it is a ridge or raised hackles. A few ridgebacks are born without ridges.  Suggested Rhodesian Ridgeback Nutritional Needs  Ridgebacks have a moderate build, lean yet muscular. You should be able to feel the ribs, but they should not be too noticeable.\nSome ridgebacks tend to put on too much weight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":10,"lifespan_upper_yr":12,"height_lower_in":24,"height_upper_in":27,"weight_lower_lb":70,"weight_upper_lb":85,"jogging_partner":4,"lap_dog":1,"good_with_children":2,"warm_weather":3,"cold_weather":3,"grooming_requirements":1,"shedding":2,"barking":1,"ease_of_training":3,"created_ts":"2024-02-27 20:21:04","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"rottweiler","details":" Rottweiler  History  In ancient times, Roman drover dogs guarded and drove the cattle that accompanied Roman troops on long marches. Some of these dogs were left behind in southern Germany, where they remained valued as cattle drovers.\nThe town of Rottweil became a center of cattle commerce, and the drover dogs played a vital role driving the cattle to town, protecting them along the way, guarding the money earned from their sale, and even pulling carts of supplies back from town. Some dogs lived in town as butcher's helpers, a job at which they especially excelled. They became known as Rottweiler metzgerhunds (butcher dogs).\nIn the mid 1800s, cattle driving was outlawed and dog carts were replaced by donkey carts and railroads, forcing the Rottweiler into near unemployment.\nRealizing the breed was on the brink of extinction, fanciers set about to revive it in 1901. Little by little the Rottweiler regained its footing, and by 1931 the AKC recognized the breed.\nIn the early 1990s, the Rottweiler rose to become the second most popular breed in America. It has since fallen dramatically in popularity.\nThe Rottweiler has been a target of breed specific legislation in some communities.  Rottweiler Behavior Concerns  Makes a loyal and protective companion.\nPlayful and generally good with children, but may be overly protective of them when around strangers.\nTends to be aloof toward and even suspicious of strangers. Early socialization is essential.\nNot friendly toward strange dogs, and may not be good with small pets.\nThe Rottie learns quickly, but can be stubborn. It tends to rebel against forceful methods.\nDoes best with a firm owner who can combine reward-based training with good control and leadership.\nSome owners train their dogs in Schutzhund, a sport that combines obedience, tracking, and protection.  Rottweiler Suggested Exercises  Makes a calm and alert housedog.\nRequires daily exercise in the form of a long walk, jog, or energetic games.\nThe Rottweiler enjoys cold weather and may overheat easily in warm weather.\nObedience training is essential not only for control, but for the mental exercise it provides.  Rottweiler Grooming  Coat is short, straight, and dense. Rarely, a long coated Rottweiler occurs.\nThe coat needs only occasional brushing, once every week or so, to remove dead hair.\nShedding is average.  Suggested Rottweiler Nutritional Needs  Rottweilers tend to stay in good weight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nPuppies should be fed a large-breed growth food, which slows their growing rate but not final size. This has been shown to decrease the incidence or severity of hip dysplasia in adults. ","lifespan_lower_yr":8,"lifespan_upper_yr":11,"height_lower_in":22,"height_upper_in":27,"weight_lower_lb":80,"weight_upper_lb":135,"jogging_partner":3,"lap_dog":1,"good_with_children":2,"warm_weather":2,"cold_weather":3,"grooming_requirements":1,"shedding":3,"barking":2,"ease_of_training":3,"created_ts":"2024-02-27 20:21:05","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"saint-bernard","details":" Saint Bernard  History  The Saint Bernard is the original search and rescue dog.\nIn the mid 1600s the monks of the St. Bernard Hospice, which was a refuge for travelers journeying between Italy and Switzerland, brought in large dogs to pull carts and turn spits. Inevitably the dogs also became valued as companions and watchdogs. They found their fame, however, as pathfinders in deep snow and especially, as locators of lost travelers.\nWhen a dog found somebody, the dog would lick at the person and lie beside him, warming him with body heat.\nThe dogs are credited with finding more than 2000 people over the course of 300 years. The most famous of these dogs was Barry, who was credited with saving 40 lives.\nThe dogs were known by several names, including hospice dogs and Barryhunds.\nIn the early 1800s many of the dogs were lost to severe weather, disease and inbreeding, so that crosses were made with Newfoundlands. This introduced the longer coat to the breed. The longer coats weren't used for rescue work because the ice tended to clump in their hair.\nThe first Saints came to England around 1810. They were called \"sacred dogs\" at the time.\nBy 1865, the name Saint Bernard was in common use.\nThe AKC recognized the breed in 1885.  Saint Bernard Behavior Concerns  Makes a loyal and protective companion.\nGentle and generally good with children, but may be overly protective of them when around strangers. It also may not be playful enough for children. As with all large dogs, dogs and children should always be supervised.\nTends to be somewhat aloof toward strangers.\nFairly friendly toward strange dogs.\nGood with other pets.\nLearns quickly, but can be stubborn.\nDoes best with a firm owner who can combine reward-based training with good control and leadership.  Saint Bernard Suggested Exercises  Makes a calm and well-mannered housedog.\nRequires daily exercise in the form of a moderate walk or short jog.\nThe Saint Bernard enjoys cold weather, but doesn't do well in warm weather.\nObedience training is essential not only for control, but for the mental exercise it provides.  Saint Bernard Grooming  Coat can be either smooth, in which the hair is dense and tough; or long, in which the hair is of medium length, and straight to slightly wavy.\nThe coat needs only occasional brushing, once every week or so, to remove dead hair.\nShedding is average.\nBe prepared for drool.  Suggested Saint Bernard Nutritional Needs  Saint Bernards tend to stay in good weight or be slightly overweight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nPuppies should be fed a large-breed growth food, which slows their growing rate but not final size. This may decrease the incidence or severity of hip dysplasia in adults. ","lifespan_lower_yr":8,"lifespan_upper_yr":10,"height_lower_in":25,"height_upper_in":28,"weight_lower_lb":120,"weight_upper_lb":200,"jogging_partner":1,"lap_dog":1,"good_with_children":2,"warm_weather":1,"cold_weather":5,"grooming_requirements":3,"shedding":3,"barking":1,"ease_of_training":3,"created_ts":"2024-02-27 20:21:06","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"samoyed","details":" Samoyed  History  The nomadic Samoyed people of Siberia relied on their herds of reindeer for food, and their dogs to keep the reindeer under control and to guard them against predators. The dogs also occasionally hunted large game and pulled sledges. They lived in the tents and slept with the children to help keep the children warm.\nEarly samoyeds, including the first imports to England in the late 1800s, were not always white.\nQueen Alexandra received one of the early imports and became a proponent of the breed. Many of today's dogs can be traced back to dogs she bred.\nThe first samoyed came to America in 1906 as a gift from Russia's Grand Duke Nicholas.\nSamoyeds became popular as sled dogs because of their tractable nature. They were part of polar expeditions conducted by Shackleton, Scott, and Amundsen.Samoyeds were on the team that first reached the South Pole.\nThey gained much popularity following World War II.  Samoyed Behavior Concerns  Makes a gentle yet bold companion.\nIt is playful and clever.\nSociable with strangers, children, dogs and other pets.\nIt is a fast learner, but can be independent and stubborn.\nDoes best with reward-based training involving food or games. \nIf bored, it tends to dig and howl and may get into mischief.  Samoyed Suggested Exercises  Makes a quiet housedog as long as its exercise needs are met.\nRequires a moderate walk or jog, or a good run in an enclosed area, every day.\nGames and tricks provide needed mental exercise.\nIt especially loves to pull sleds.\nIn cold weather it may prefer to stay outside. In warm weather it is usually happier in air-conditioning.\nIts thick coat provides good protection against cold weather.  Samoyed Grooming  Coat is made up of a soft thick undercoat covered by a straight, harsh outer coat that stands off from the body.\nThe coat needs weekly brushing---more when shedding\nShedding is above average.  Suggested Samoyed Nutritional Needs  Samoyeds tend to stay in good weight, although some are inclined to be overweight. The thick coat can obscure weight problems, so be sure to use your hands to feel.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":10,"lifespan_upper_yr":12,"height_lower_in":19,"height_upper_in":24,"weight_lower_lb":35,"weight_upper_lb":65,"jogging_partner":3,"lap_dog":1,"good_with_children":4,"warm_weather":1,"cold_weather":5,"grooming_requirements":4,"shedding":5,"barking":2,"ease_of_training":2,"created_ts":"2024-02-27 20:21:07","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"scottish-terrier","details":" Scottish Terrier  History  Scottish terriers were used by highland farmers to catch vermin.\nThe history of the Scottish terrier is confused by the use of the term Scotch terrier to refer to any terrier from Scotland. Even with the advent of dog shows, the different terriers were shown together as Scotch terriers.\nIn 1881 the Scotch terriers were divided into Dandie Dinmont and Skye terriers, with the present-day Scottish terriers in the Skye terrier group. By the end of that year the Skye terrier group was subdivided into Skye and hard-haired terriers, with Scotties in the latter. Eventually the hard-haired terriers were again divided into three breeds, which would be come the Scottish, West Highland white and Cairn terriers.\nFor a time the breed was called the Aberdeen terrier, because of its popularity in that region.\nThe first documented Scotty came to America in 1883.\nPresident Franklin Roosevelt had a Scotty named Fala, and Fala was largely responsible for the breed's soaring popularity after World War II. Fala was Roosevelt's constant companion, and is buried at his side.\nScotties were a favorite image in advertising and fashion for many years.\nThe breed remains one of the more popular and recognizable terriers.  Scottish Terrier Behavior Concerns  Makes a spirited and fun-loving companion.\nPlayful and good with children.\nFearless, clever, curious, and often mischievous.\nFairly outgoing toward strangers.\nFeisty and sometimes argumentative around other dogs.\nMay chase other household pets, but can learn to get along with cats. Rodents are a poor choice of housemate, however.\nSurprisingly sensitive.\nIndependent and stubborn. Does best with reward-based training involving food or games.\nLearns quickly and is eager to please, but also bores quickly, and may come up with its own ideas.\nMany like to dig.  Scottish Terrier Suggested Exercises  Makes a lively and alert housedog.\nIts exercise needs can be met with a long walk or short run, along with a vigorous game. They also need a chance to sniff and explore in a safe place or on leash.\nThey tend to go off hunting and may not come when called.\nSome Scotties do well at dog parks, while others don't. It depends on the individual dog's feistiness.\nGames and tricks provide needed mental exercise.  Scottish Terrier Grooming  Coat is harsh and straight.\nThe coat needs combing once or twice weekly.\nShaping of the coat by plucking out dead hairs every three months is required to keep it tidy looking. Professional clipping makes coat maintenance easier.\nShedding is below averag  Suggested Scottish Terrier Nutritional Needs  Scottish terriers tend to stay in good weight or be slightly overweight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":11,"lifespan_upper_yr":13,"height_lower_in":10,"height_upper_in":10,"weight_lower_lb":18,"weight_upper_lb":22,"jogging_partner":2,"lap_dog":2,"good_with_children":4,"warm_weather":2,"cold_weather":3,"grooming_requirements":3,"shedding":2,"barking":4,"ease_of_training":1,"created_ts":"2024-02-27 20:21:08","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"shetland-sheepdog","details":" Shetland Sheepdog  History  The Shetland sheepdog originated on the Shetland Islands of Scotland in the 1800s.\nThey almost certainly were derived from early collie-type dogs that also provided root stock for collies and border collies.\nThe terrain and sparse vegetation of the islands favored smaller livestock, which in turn only needed smaller herding dogs.\nThe Shetland sheepdog herded sheep, ponies and chickens, keeping them away from cultivated fields in a land with few fences.\nShetland sheepdogs were first exhibited as Shetland collies in England, but when collie fanciers objected, the name was changed to Shetland sheepdog.\nThe breed's popularity followed that of the collie, with many families opting for what they thought of as a miniature collie.\nThe Shetland sheepdog remains a steady favorite as a family dog throughout the world.  Shetland Sheepdog Behavior Concerns  Makes a loyal and biddable companion.\nPlayful and gentle with children, an excellent child's companion.\nWhen excited, it can nip at heels in play.\nA one family dog, tending to be aloof, even shy, toward strangers. Early socialization so that it willingly accepts new people is important.\nVery good with other dogs and pets.\nSome can be timid.\nFast and eager learners that enjoy being directed.\nSensitive to correction. Does best with gentle, reward-based training involving food, games or praise.\nMost bark a lot.\nOne of the most accomplished breeds in the sports of agility and especially, obedience.  Shetland Sheepdog Suggested Exercises  Makes a calm yet alert housedog.\nIts exercise needs can be met with a long walk, short run or backyard games.\nHerding and agility are favorite physical and mental outlets.\nGames and tricks can provide needed mental exercise. Shelties very much enjoy learning.  Shetland Sheepdog Grooming  Coat is long, harsh and straight, with a short dense undercoat.\nBrushing and combing every other day is necessary to prevent mats.\nShedding is above average.  Suggested Shetland Sheepdog Nutritional Needs  Shelties tend to stay in good weight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":12,"lifespan_upper_yr":14,"height_lower_in":13,"height_upper_in":16,"weight_lower_lb":20,"weight_upper_lb":20,"jogging_partner":3,"lap_dog":2,"good_with_children":5,"warm_weather":3,"cold_weather":3,"grooming_requirements":4,"shedding":4,"barking":5,"ease_of_training":5,"created_ts":"2024-02-27 20:21:08","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"shih-tzu","details":" Shih Tzu  History  The first small Tibetan lion dogs probably came from Tibet to China during the Ch'ing Dynasty (1644-1662).\nIn the late 1800s, these dogs were interbred with Pekingese, pugs, and other Chinese dogs to create the Shih Tzu as we know it. This occurred in the kennels of the Dowager Empress T'zu Hsi.\nAfter the Communist revolution in China, the shih tzu became extinct in its native land.\nIn the 1940s and 50s, military personnel brought back many shih tzu to the United States.\nSeven males and seven females make up the foundation stock of all modern shih tzu. One of these dogs was actually a Pekingese brought into the gene pool in the 1950s.\nThe AKC recognized the breed in 1969. It soon grew to become one of most popular of all breeds in America.  Shih Tzu Behavior Concerns  Makes both an affectionate lap dog and fun-loving companion.\nPlayful and good with children, but children must be supervised because they could easily hurt such a small dog.\nOutgoing toward strangers.\nGood with other dogs and pets.\nLearns quickly, but tends to have a stubborn streak.\nDoes not do well with force-based training methods, but is very good with reward-based training involving food or games.\nHousetraining can be more challenging than with many other breeds.  Shih Tzu Suggested Exercises  Makes a lively and alert housedog.\nAlthough many of its physical exercise needs can be met with indoor games, it still needs the mental stimulation of walking and sniffing outdoors.\nA walk around the block once or twice daily will meet its outdoor needs, not counting bathroom breaks. Many shih tzu can be trained to use indoor potty systems.\nBecause of its short muzzle, the shih tzu is prone to overheating in warm weather.\nDog parks are not generally a good idea unless only small dogs are allowed together.\nSwimming is not recommended unless constantly supervised. Swimming with a full coat could be dangerous as the coat can become heavy when wet.\nGames and tricks provide needed mental exercise.\nExcursions in a doggy purse can provide supplemental entertainment.  Shih Tzu Grooming  Coat is long, dense and fairly straight.\nBrushing and combing every other day is necessary to prevent matts.\nMany pet owners elect to have their dogs professionally groomed, or clipped into a trim that is more easily cared for.\nTake care that stray hairs and lashes don't irritate the eyes.\nMonitor the hair around the anus for hygiene issues.\nBecause of poor air circulation, ears should be checked weekly for problems.\nShedding is below average.\nThe breed is prone to periodontal problems, which can be prevented in large part by regular tooth brushing.  Suggested Shih Tzu Nutritional Needs  Shih tzu tend to stay in good weight or be a bit heavy.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nShih tzu puppies should be fed often to prevent hypoglycemia, a serious condition to which very small puppies are prone. Meals of high protein, fat, and complex carbohydrates may also help guard against this condition. ","lifespan_lower_yr":11,"lifespan_upper_yr":14,"height_lower_in":8,"height_upper_in":11,"weight_lower_lb":9,"weight_upper_lb":16,"jogging_partner":0,"lap_dog":3,"good_with_children":3,"warm_weather":1,"cold_weather":2,"grooming_requirements":4,"shedding":2,"barking":3,"ease_of_training":2,"created_ts":"2024-02-27 20:21:09","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"siberian-husky","details":" Siberian Husky  History  Recent DNA studies indicate that the Siberian husky is among the 14 most ancient breeds recognized by the AKC.\nThe nomadic Chukchi people of northeast Asia developed them, probably from spitz stock, as sledge dogs.\nDuring the Alaskan gold rush, sled dog racing became a favorite sport. In 1909, a team of Chukchi huskies from Siberia competed in the All-Alaska Sweepstakes. These dogs were smaller than their competition, and didn't arouse much admiration except from one racer, who immediately imported 70 of them to train for the 1910 race. His three teams placed first, second and third in that race, bringing the breed into the spotlight.\nIn 1925 the Siberian husky gained worldwide fame for racing 340 miles in six days to deliver serum to diphtheria-stricken Nome. Lead dogs Balto and Togo became national heroes. A statue of Balto stands in central Park. The Iditarod dog sled race commemorates this feat.\nThe AKC recognized the breed in 1930.\nSiberian huskies served in the military as search and rescue teams during World War II.\nThe breed remains one of the most popular of the Arctic breeds.  Siberian Husky Behavior Concerns  Makes an exuberant and adventurous family member.\nGood and playful with children.\nLoves to run, and may roam for miles if the opportunity arises.\nMay not come when called.\nAffectionate and demonstrative.\nOutgoing toward strangers.\nMay be aggressive toward strange dogs, but is good with family dogs.\nUsually good with household pets, but not always good with strange ones.\nTends to be independent and stubborn.\nDoes best with a firm owner who can combine reward-based training with good control and leadership.  Siberian Husky Suggested Exercises  Makes a fairly calm and alert housedog if given adequate exercise. If not given enough exercise, can be overactive and destructive.\nRequires daily exercise in the form of a long walk, or preferably, long jog.\nA well-fenced yard is essential.\nGames can also help provide exercise.\nEnjoys very cold weather, and likes to spend time outside when it's cool.\nBecomes overheated fairly easily.\nObedience training is essential not only for control, but for the mental exercise it provides.  Siberian Husky Grooming  Coat is straight, somewhat flat-lying and of medium length, with a soft dense undercoat.\nIt requires brushing once or twice a week, more often when shedding.\nShedding is above average.  Suggested Siberian Husky Nutritional Needs  Siberianhuskiestend to stay in good weight. You must use your hands to feel beneath the thick coat.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":11,"lifespan_upper_yr":13,"height_lower_in":20,"height_upper_in":24,"weight_lower_lb":35,"weight_upper_lb":60,"jogging_partner":4,"lap_dog":1,"good_with_children":2,"warm_weather":1,"cold_weather":5,"grooming_requirements":3,"shedding":5,"barking":3,"ease_of_training":1,"created_ts":"2024-02-27 20:21:10","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"soft-coated-wheaten-terrier","details":" Soft Coated Wheaten Terrier  History  The soft coated wheaten terrier originated in Ireland as an all-around farm dog. It exterminated vermin, guarded the homestead and rounded up stock. Its date of origin is unknown, but it was established by the 1700s.\nLike many farm breeds, it early history is largely undocumented. It is likely to have been crossed with other dogs as various needs and circumstances arose.\nIn 1937 the SCWT was granted breed status in Ireland. This allowed it to compete in dog shows. An Irish Championship of the time required a SCWT to win not only in the show ring, but to prove itself as a hunter of badgers, rabbits and rats.\nThe first SCWT came to America in 1946.\nThe AKC recognized the SCWT in 1973. It is most popular today as a companion and show dog.  Soft Coated Wheaten Terrier Behavior Concerns  Makes a fun-loving and affectionate companion.\nIts gentle and playful nature makes it a good match for children.\nFriendly toward strangers.\nUsually good with other dogs and pets.\nMakes an attentive watchdog, and adequate protection dog.\nIt is eager to please but can be headstrong.\nDoes best with reward-based training involving food and games.  Soft Coated Wheaten Terrier Suggested Exercises  Makes a well-behaved housedog as long as its exercise needs are met.\nRequires a moderate walk or short jog, or a run in an enclosed area, every day.\nBecause it loves to run and hunt, it should only be let loose in a safely enclosed.\nGames and tricks provide needed mental exercise.\nIts thick soft coat provides some protection against cold and wet weather.  Soft Coated Wheaten Terrier Grooming  Coat is abundant and soft; it has no noticeable undercoat.\nThe coat needs brushing or combing every other day.\nBathing and trimming every other month is needed to maintain the correct look.\nThe coat is easier to maintain if it is clipped to about 3\".\nThe coat does not tend to shed.  Suggested Soft Coated Wheaten Terrier Nutritional Needs  SCWT conformation is for a moderate build.\nYou should be able to feel the ribs under the coat, but they should not be too noticeable.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":12,"lifespan_upper_yr":14,"height_lower_in":17,"height_upper_in":19,"weight_lower_lb":30,"weight_upper_lb":40,"jogging_partner":3,"lap_dog":1,"good_with_children":5,"warm_weather":1,"cold_weather":3,"grooming_requirements":4,"shedding":1,"barking":2,"ease_of_training":3,"created_ts":"2024-02-27 20:21:11","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"standard-poodle","details":" Standard Poodle  History  The standard poodle is the original version of the poodle. It probably descended from the Barbet, a curly-coated dog found in France, Russia, Hungary, Germany and elsewhere in Europe.\nThe German version of the Barbet became the dog we now know as the Poodle.\nThe original poodle was a water dog known for its retrieving abilities. In fact, the word \"poodle\" comes from the German word \"pfudel,\" which means \"puddle\" or \"to splash,\" a reference to the poodle's ability as a water retriever.\nIn France, the poodle was known as the caniche or chien canard, both names in reference to its duck-hunting ability.\nThe poodle later worked as a circus performer, military dog, guard dog and guide dog.\nThe poodle's hair cut originated as a working clip for retrieving in cold water. The hair was cropped close to cut down on its weight and drag, but left longer over the head and chest for warmth. Although it's often claimed the hair was left longer on the joints and tail tip for warmth and protection, evidence suggest that the style arose later, as decoration when the poodle became a performing circus dog. Regardless, the clip became more accentuated over time. \nThe French aristocracy became enamored with the poodle and adopted it as its own. It eventually became the national dog of France.\nThe AKC recognized the poodle in 1887. Only later did they split the breed into three varieties according to size.\nAfter a period in the 1920s during which they almost vanished from the American scene, poodles staged a comeback in the 1930s.\nPoodles were the most popular breed in America from 1960 to 1982, the longest continuous run of any breed, although standards were not as popular as the other sizes.  Standard Poodle Behavior Concerns  Makes a biddable and fun-loving companion.\nPlayful and very good with children.\nFriendly to strangers, other dogs and other pets.\nDoes best with reward-based training involving food, games or praise.\nEager to please, bright and responsive, poodles are among the easiest of dogs to train.\nExcels at obedience and agility competitions, therapy dog work, and even contraband detection.  Standard Poodle Suggested Exercises  Makes a calm yet alert housedog.\nA long walk or jog, or several vigorous games, every day will meet its exercise needs.\nPoodles have even been trained to pull a dog sled.\nEnjoys retrieving.\nStandard poodles do well in dog parks.\nGames and tricks provide needed mental exercise.\nSwimming is a favored exercise, but a full coat can weigh down a dog.\nIts thick coat provides some protection against cold weather, but it cannot withstand prolonged exposure unless exercising.  Standard Poodle Grooming  Coat is curly, harsh and dense.\nBrushing and combing every other day is necessary to prevent matting.\nMost people have their dogs professionally clipped every six weeks.\nMost people opt for a sporting clip where the hair is fairly short all over.\nOriginally, poodle's coats were corded, so they hung in long dreadlocks. This takes a lot of work and is difficult to wash, so the style has fallen out of favor.\nShedding is below average.\nThe eyes should be checked regularly for hair or lashes that may irritate their surface.\nHair growing inside the ears may need to be plucked out or clipped.\nWhile no dog is non-allergenic, poodles seem to cause allergic reactions in fewer people.  Suggested Standard Poodle Nutritional Needs  Poodles tend to stay in good weight. The thick coat can sometimes obscure weight problems, so be sure to use your hands to feel.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":10,"lifespan_upper_yr":13,"height_lower_in":15,"height_upper_in":21,"weight_lower_lb":45,"weight_upper_lb":65,"jogging_partner":5,"lap_dog":2,"good_with_children":5,"warm_weather":3,"cold_weather":3,"grooming_requirements":5,"shedding":1,"barking":2,"ease_of_training":5,"created_ts":"2024-02-27 20:21:12","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"standard-schnauzer","details":" Standard Schnauzer  History  The standard schnauzer originated in Germany in the Middle Ages. Even by the 1300s it was appreciated as a vermin hunter and all-around farm dog and guardian.\nIt was probably derived from crosses of wire-haired pinschers, German poodles and some sort of spitz breed. It is not related to the British terriers.\nThe first recorded reference to the dogs being called schnauzers was in 1842. The name is thought to be derived from the German words for nose or beard. \nThe breed was initially called a wire-haired pinscher when it was first exhibited at a dog show in 1879. By 1900, it was a popular dog show contender.\nMost standard schnauzers continued to be used for work, however. By the early 1900s, they were the most popular dogs for guarding farmers' carts when they took them to market.\nThe first records of schnauzers in America come from around 1900.\nThe AKC recognized the standard schnauzer in 1904. At that time the breed was classified as a terrier. The standard schnauzer is the original of the three Schnauzer breeds that the AKC recognizes. The miniature was recognized separately in 1926, and the giant in 1930.\nDuring World War I, standard schnauzers were used as guard dogs. They have been used by both German and American police departments for use as police dogs and contraband detection dogs.\nDespite being the original schnauzer, the standard is the least popular of the three schnauzer breeds in America.  Standard Schnauzer Behavior Concerns  Makes a loyal and fun companion, as well as an excellent guardian.\nPlayful and good with children.\nBold, watchful, busy and often mischievous.\nTends to be aloof toward strangers.\nCan be aggressive toward strange dogs.\nUsually gets along with household pets.\nDoes best with reward-based training involving food or games.\nLearns quickly, but also bores quickly, and can be quite headstrong.  Standard Schnauzer Suggested Exercises  Makes a lively and alert housedog, but can be mischievous unless given enough exercise.\nIts exercise needs can be met with a long walk or run, along with a vigorous game.\nStandard schnauzers may not do well at dog parks, but it depends on the individual dog.\nGames and tricks provide needed mental exercise.  Standard Schnauzer Grooming  Coat is hard and wiry, longer on the legs, muzzle, and eyebrows.\nThe coat needs combing once or twice weekly.\nMany pet owners elect to have their dogs professionally groomed, or clipped into a trim that is more easily cared for. This must be repeated every two to three months.\nShow dogs must have their coat plucked and stripped.\nShedding is below average.  Suggested Standard Schnauzer Nutritional Needs  Standard schnauzers tend to stay in good weight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":12,"lifespan_upper_yr":14,"height_lower_in":18,"height_upper_in":20,"weight_lower_lb":35,"weight_upper_lb":45,"jogging_partner":4,"lap_dog":1,"good_with_children":3,"warm_weather":3,"cold_weather":3,"grooming_requirements":3,"shedding":2,"barking":3,"ease_of_training":3,"created_ts":"2024-02-27 20:21:13","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"toy-poodle","details":" Toy Poodle  History  Although the standard poodle is the original version of the poodle, it wasn't long before smaller versions appeared as well.\nThe first good evidence of toy poodles in Europe dates from about 1700, although it almost certainly predates that time.\nThe toy poodle was originally used as a lap dog, circus performer, and gypsy trick dog.\nThe French aristocracy became enamored with the poodle and adopted it as its own. It eventually became the national dog of France.\nThe French upper class enjoyed styling and even dying its hair in a variety of fashions.\nThe first evidence of toy poodles in America dates from 1846.\nThe AKC recognized the poodle in 1887. Only later did they split the breed into three varieties according to size.\nAfter a period in the 1920s during which they almost vanished from the American scene, poodles staged a comeback in the 1930s.\nPoodles were the most popular breed in America from 1960 to 1982, the longest continuous run of any breed.  Toy Poodle Behavior Concerns  Makes a biddable and affectionate companion.\nPlayful and very good with children, although very young or unruly children may hurt it with rough play.\nFriendly to strangers, other dogs and other pets.\nDoes best with reward-based training involving food, games or praise.\nEager to please, bright and responsive, poodles are among the easiest of dogs to train.\nLoves to learn tricks.\nExcels at obedience and agility competitions, as well as therapy dog work.\nSome may bark a lot, but can be easily trained not to.  Toy Poodle Suggested Exercises  Makes a well-mannered and alert housedog.\nA daily walk around the block, coupled with several play sessions, will meet its exercise needs.\nEnjoys retrieving small objects.\nDoes well in dog parks as long as large dogs are segregated.\nGames and tricks provide needed mental exercise.\nIts thick coat provides some protection against cold weather, but its small body size makes it vulnerable to chilling.  Toy Poodle Grooming  Coat is curly, harsh and dense.\nBrushing and combing every other day is necessary to prevent matting.\nMost people have their dogs professionally clipped every six weeks.\nMost people opt for a pet clip where the hair is fairly short all over.\nShedding is below average.\nThe eyes should be checked regularly for hair or lashes that may irritate their surface.\nNo breed is actually non-allergenic, but poodles may cause allergies in fewer people compared to other breeds.\nHair growing inside the ears may need to be plucked out or clipped.  Suggested Toy Poodle Nutritional Needs  Poodles tend to stay in good weight or to be a little overweight. The thick coat can sometimes obscure weight problems, so be sure to use your hands to feel.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nSmall snacks can cause weight problems in tiny dogs.\nToy poodle puppies should be fed often to prevent hypoglycemia, a serious condition to which very small puppies are prone. Frequent small meals of high protein, fat, and complex carbohydrates may help guard against this condition. ","lifespan_lower_yr":12,"lifespan_upper_yr":14,"height_lower_in":10,"height_upper_in":10,"weight_lower_lb":4,"weight_upper_lb":8,"jogging_partner":2,"lap_dog":5,"good_with_children":4,"warm_weather":3,"cold_weather":2,"grooming_requirements":5,"shedding":1,"barking":4,"ease_of_training":5,"created_ts":"2024-02-27 20:21:13","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"vizsla","details":" Vizsla  History  When the Magyars swarmed across Europe in the Middle Ages, over a thousand years ago, they assimilated various dogs from around the continent. These dogs settled with them in Hungary and no doubt were the ancestors of the Vizsla. Hunters in the Hungarian plains wanted a dog that was fast but didn't range too far away, that could both point and retrieve birds, and that could follow a scent trail, and they selected among these dogs for offspring that would meet their needs.\nDogs of Vizsla type were described by the Middle Ages, although it's not known if these were actually Vizslas.\nBy the 1700s, the breed was definitely established.\nThe breed suffered a massive decline during the late 1800s, but was brought back with careful breeding from the few good specimens that could be found.\nHungarians fleeing Russian occupation during World War II often took their Vizslas with them, spreading the breed throughout the world.\nThe AKC recognized the breed in 1960. The Vizsla is popular as a hunting companion, field trial competitor, pet, and show dog.  Vizsla Behavior Concerns  Makes an energetic and attentive family member.\nGentle and playful with children\nGood watchdog; can be protective.\nLoves to run and hunt.\nSociable with strangers.\nGood with other dogs and pets.\nCan be overly excitable.\nLearns quickly, but easily distracted.\nDoes best with a firm owner who can combine reward-based training with good control and leadership.  Vizsla Suggested Exercises  Makes a fairly calm and alert housedog if given adequate exercise. If not given enough exercise, it can be overactive and destructive.\nRequires daily exercise in the form of a long walk, or preferably, long jog. Vigorous games are also helpful.\nA well-fenced yard is essential.\nHunting is the favored exercise. It also enjoys retrieving.\nThis is not a breed for an inactive owner.\nObedience training is essential not only for control, but for the mental exercise it provides.  Vizsla Grooming  Coat is short and sleek.\nIt requires brushing once a week to remove dead hair, and occasional bathing.\nShedding is average.  Suggested Vizsla Nutritional Needs  Vizslas tend to stay in good weight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":10,"lifespan_upper_yr":14,"height_lower_in":21,"height_upper_in":24,"weight_lower_lb":45,"weight_upper_lb":65,"jogging_partner":5,"lap_dog":1,"good_with_children":3,"warm_weather":3,"cold_weather":2,"grooming_requirements":1,"shedding":3,"barking":2,"ease_of_training":3,"created_ts":"2024-02-27 20:21:14","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"weimaraner","details":" Weimaraner  History  In the 1800s, German hunters made a concerted effort to produce an all-around gundog that could hunt game of all sizes, even deer and bear. Some of the breeds used in the mix were the Bloodhound, Red Schweisshund, and several early pointing breeds.\nThe origin of the breed's distinctive gray color is unknown, but it was an early feature of the breed.\nThe new breed was initially called the Weimar Pointer because the effort to produce it was sponsored by the court of Weimar.\nThe German Weimaraner Club oversaw the breed's progress using stringent standards for breeding. They would not allow Weimaraners to be sold to non-members.\nIn 1929, an American gained entry into the club and was able to bring back two Weimaraners to America, where they elicited great interest.\nThe breed's early talent in obedience competitions aroused further interest, and its hunting ability won over sportsmen.\nThe AKC recognized the breed in 1943.  Weimaraner Behavior Concerns  Makes an energetic and protective family member.\nGentle and playful with children, although may be too boisterous for small children.\nDemanding of attention.\nLoves to run and hunt.\nOnly moderately outgoing toward strangers.\nMay be aggressive toward strange dogs and other pets.\nLearns quickly.\nDoes best with a firm owner who can combine reward-based training with good control and leadership.\nSome can whine or bark a lot.  Weimaraner Suggested Exercises  Makes a fairly calm and alert housedog if given adequate exercise. If not given enough exercise, can be overactive and destructive.\nRequires daily exercise in the form of a long walk, or preferably, long jog.\nA well-fenced yard is essential.\nHunting is the favored exercise. Swimming and retrieving are also favorites.\nThis is not a breed for an inactive owner.\nObedience training is essential not only for control, but for the mental exercise it provides.  Weimaraner Grooming  Coat is short and sleek.\nIt requires brushing once a week to remove dead hair.\nShedding is average.  Suggested Weimaraner Nutritional Needs  Weimaraners tend to stay in good weight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":0,"lifespan_upper_yr":0,"height_lower_in":0,"height_upper_in":0,"weight_lower_lb":0,"weight_upper_lb":0,"jogging_partner":5,"lap_dog":1,"good_with_children":3,"warm_weather":3,"cold_weather":2,"grooming_requirements":1,"shedding":3,"barking":3,"ease_of_training":4,"created_ts":"2024-02-27 20:21:15","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"west-highland-white-terrier","details":" West Highland White Terrier  History  The Westie's roots lie in Scotland, where it and other related terriers were used to rid farms and surrounding countryside of rodents, fox, badger and other small mammals. At the time, the breeds we now know as the West Highland White, Scottish, Cairn, and Skye Terriers were all grouped together as Scotch terriers.\nThese Scotch terriers developed various distinctive strains, and by 1900 a short-legged white strain became known as the Poltalloch terrier.\nSubsequent names included the White Scottish, Little Skye, Cairn, and Roseneath terrier. The AKC recognized the breed as the Roseneath Terrier in 1908. The name was changed to West Highland white terrier in 1909.\nThe most well-known Westie is probably the one that appears in advertisements of Black and White Scotch whiskey. \nThe Westie is among the most popular terriers in America.  West Highland White Terrier Behavior Concerns  Makes an affectionate and fun-loving companion.\nPlayful and good with children.\nBold, watchful, busy, and often mischievous.\nOutgoing toward strangers.\nMost get along well with other dogs, but some can be scrappy.\nMost get along with other household pets, except for rodents.\nIndependent and somewhat stubborn. Does best with reward-based training involving food or games.\nLearns quickly, but also bores quickly, and may come up with its own ideas.\nSome tend to bark a lot, which should be discouraged from an early age.\nMany like to dig.  West Highland White Terrier Suggested Exercises  Makes a lively and alert housedog.\nIts exercise needs can be met with a long walk or short run, along with a vigorous game. Westies also need a chance to sniff and explore in a safe place or on leash.\nThey tend to go off hunting and may not come when called.\nWesties tend to enjoy and do well at dog parks, although care must be taken not to allow them to bully other dogs.\nGames and tricks provide needed mental exercise.  West Highland White Terrier Grooming  Coat is hard and straight.\nThe coat needs combing two or three times weekly.\nShaping of the coat every three months is required to maintain the Westie's distinctive look.\nShow dogs must have their coat plucked and stripped, but clipping is preferred for pet dogs.\nShedding is below average.  Suggested West Highland White Terrier Nutritional Needs  Westies tend to stay in good weight or to be slightly overweight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nSome Westies may require a special diet because of allergies or liver problems. Your veterinarian is the best source of information in that case. ","lifespan_lower_yr":12,"lifespan_upper_yr":14,"height_lower_in":0,"height_upper_in":0,"weight_lower_lb":0,"weight_upper_lb":0,"jogging_partner":2,"lap_dog":2,"good_with_children":4,"warm_weather":3,"cold_weather":3,"grooming_requirements":3,"shedding":2,"barking":4,"ease_of_training":3,"created_ts":"2024-02-27 20:21:16","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"whippet","details":" Whippet  History  The whippet descends from greyhound roots, probably mixed with ratting terriers.\nThe resulting small dogs could be used for poaching in the royal forests, and for entertainment in snap dog contests in which bets were made on how many rabbits a dog could snap up before the rabbits escaped from a circle. This gave the whippet its first name of \"snap-dog.\"\nDuring the Industrial Revolution, workers brought their dogs with them to towns. They staged betting races in which the dogs raced in a 200-yard straight line toward a person waving a rag. This earned the breed the name of \"poor man's racehorse.\"\nThe AKC recognized the whippet in 1888.\nThe whippet is the most popular of the greyhound-like breeds. \nThe whippet is the most successful breed competing in the sport of lure-coursing, in which they chase a plastic bag dragged along a zig-zagging course at high speed.  Whippet Behavior Concerns  Makes a devoted and gentle companion.\nIt is one of the most demonstrative and obedient of the greyhound-like breeds.\nIt enjoys sitting close to its family; it is sometimes described as \"clingy.\"\nIt may tend to run off to chase moving things, especially small animals.\nSociable with children, strangers, and other dogs and animals (except small strange ones running away).\nAn alert watchdog, but not a very effective protection dog.\nLearns quickly, but is easily bored.\nDoes best with reward-based training involving food or play. Very sensitive.  Whippet Suggested Exercises  Makes a very quiet housedog as long as its exercise needs are met.\nRequires a moderate walk or jog, or a sprint in an enclosed area, every day.\nGames and tricks provide needed mental exercise.\nIts short hair provides virtually no protection against cold weather. A coat may be necessary in cold weather.  Whippet Grooming  Coat is short and thin.\nThe coat needs weekly brushing, and occasional bathing.\nShedding is below average.  Suggested Whippet Nutritional Needs  Whippet conformation is for a naturally thin build, but owners often overfeed them. You should be able to feel the ribs, but they should not be too noticeable.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight. ","lifespan_lower_yr":12,"lifespan_upper_yr":15,"height_lower_in":18,"height_upper_in":22,"weight_lower_lb":20,"weight_upper_lb":40,"jogging_partner":4,"lap_dog":3,"good_with_children":4,"warm_weather":3,"cold_weather":1,"grooming_requirements":1,"shedding":2,"barking":3,"ease_of_training":3,"created_ts":"2024-02-27 20:21:17","cleaned_ts":"2024-02-27 20:21:18"},{"breed":"yorkshire-terrier","details":" Yorkshire Terrier  History  In the late 1800s, England's Industrial Revolution attracted many workers from Scotland, who brought with them a variety of terriers. These terriers included the blue and silver Paisley and the blue and tan Clydesdale, both dogs with long silky coats and prick ears.\nThese dogs interbred with the native English terriers, which included the 10 pound Waterside terrier, a breed that excelled at ratting. In addition, crosses were made to a cross-bred Scotch terrier, an old style Skye terrier, and an Old English terrier. These dogs became the foundation of the Yorkshire terrier, a breed originally used to rid the mills of rats.\nWith the emergence of dog shows in the 1860s, many high society women turned their attention to pedigreed dogs that could look stylish on their mistress's lap, and the Yorkshire terrier fit the bill.\nHuddersfield Ben (1865-1871) became the first influential show dog and sire.\nThe breed was exhibited as Broken Haired Scotch terriers until 1870, when the name was changed to Yorkshire terrier at the suggestion of a reporter.\nYorkshire terriers were in America by the 1870s\nAKC recognized the breed in 1885.\nYorkies remained fairly unknown until the 1970s, when their popularity began a slow, steady rise. In 1995 they entered the top ten list of AKC's most popular breeds, and have only continued to rise.  Yorkshire Terrier Behavior Concerns  Makes a delightful and entertaining companion.\nPlayful and good with children, but children must be supervised because they could easily hurt such a small dog.\nTrue to its terrier heritage, it is spunky, busy, and often mischievous.\nTends to pick fights with larger dogs, and may chase small pets, especially rodents.\nA one family dog, tending to be aloof toward strangers. Early socialization so that it willingly accepts new people is important.\nDoes best with reward-based training involving food or games.\nLearns quickly, but also bores quickly, and may come up with its own ideas.\nSome tend to bark a lot, which should be discouraged from an early age.\nHousetraining can be more challenging than with many other breeds.  Yorkshire Terrier Suggested Exercises  Makes a lively and alert housedog.\nAlthough many of its physical exercise needs can be met with indoor games, it still needs the mental stimulation of walking and sniffing outdoors.\nA walk around the block once or twice daily will meet its outdoor needs, not counting bathroom breaks.\nMany Yorkies have been trained to use indoor potty systems.\nDog parks are not generally a good idea unless only small dogs are allowed together.\nSwimming is not recommended unless constantly supervised. Swimming with a full coat could be dangerous.\nGames and tricks provide needed mental exercise.\nExcursions in doggy purses can also provide entertainment.  Yorkshire Terrier Grooming  Coat is long, fine and perfectly straight.\nAdult color is dark steel blue with tan points. Young puppies are black and tan, with the black gradually turning gray and then blue as adults.\nBrushing and combing every day or two is necessary to prevent matts.\nMany pet owners elect to have their dogs professionally groomed, or clipped into a trim that is more easily cared for.\nHair must be kept out of eyes to avoid irritation.\nThe hair around the anus must be checked daily for hygiene issues.\nShedding is below average.\nRegular tooth brushing may prevent periodontal disease, which is common in Yorkies.  Suggested Yorkshire Terrier Nutritional Needs  Yorkshire terriers tend to stay in good weight.\nAdult dogs should be fed a balanced diet, with restricted calories if the dog starts to gain too much weight.\nYorkie puppies should be fed often to prevent hypoglycemia, a serious condition to which very small puppies are prone. Meals of high protein, fat, and complex carbohydrates may also help guard against this condition. ","lifespan_lower_yr":14,"lifespan_upper_yr":16,"height_lower_in":8,"height_upper_in":9,"weight_lower_lb":7,"weight_upper_lb":7,"jogging_partner":0,"lap_dog":3,"good_with_children":3,"warm_weather":2,"cold_weather":1,"grooming_requirements":5,"shedding":2,"barking":4,"ease_of_training":2,"created_ts":"2024-02-27 20:21:18","cleaned_ts":"2024-02-27 20:21:18"}]